{
    "id": "417a89e8e3e5cd1aea2e5447f59ab2512d86a701",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA2_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602782A"
        },
        "ProgramElementTitle": {
            "val": "Command, Control, Communications Technology"
        },
        "R1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "33.117"
            },
            "CurrentYear": {
                "val": "36.160"
            },
            "BudgetYearOne": {
                "val": "37.803"
            },
            "BudgetYearOneBase": {
                "val": "37.803"
            },
            "BudgetYearTwo": {
                "val": "39.092"
            },
            "BudgetYearThree": {
                "val": "38.489"
            },
            "BudgetYearFour": {
                "val": "39.257"
            },
            "BudgetYearFive": {
                "val": "40.053"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) researches and investigates communications, mission command (MC), and electronics components, sub-components, software and protocols that provide the Army with enhanced capabilities for secure, mobile, networked communications, assured information delivery, and presentation of information that enables decision-making. Commercial technologies are continuously investigated and leveraged where possible. Project 779 researches and develops MC software, algorithms, protocols, architectures, and devices that enable management of information across the tactical and strategic battle space; provides automated cognitive reasoning and decision making aids; and allows timely distribution, presentation\/display and use of MC data on Army platforms. Project H92 supports research in communications components, software, algorithms and protocols, which allow field commanders to communicate on-the-move to\/from virtually any location, through a seamless, secure, self-organizing, self-healing network.\n\nWork in this PE is complementary of PE 0601104A (University and Industry Research Centers), PE 0602270A (Electronic Warfare Technology) , PE 0602705A (Electronics and Electronic Devices), PE 0603008A (Electronic Warfare Advanced Technology), PE 0603270A (Electronic Warfare Technology), PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), and PE 0603794A (Command, Control and Communications Advanced Technology), and is fully coordinated with PE 0601104A (University and Industry Research Centers), PE 0602120A, (Sensors and Electronic Survivability), PE 0602783A (Computer and Software Technology), and PE 0602874A (Advanced Concepts and Simulation).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications -Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "33.807"
                },
                "CurrentYear": {
                    "val": "36.160"
                },
                "BudgetYearOne": {
                    "val": "38.461"
                },
                "BudgetYearOneBase": {
                    "val": "38.461"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "33.117"
                },
                "CurrentYear": {
                    "val": "36.160"
                },
                "BudgetYearOne": {
                    "val": "37.803"
                },
                "BudgetYearOneBase": {
                    "val": "37.803"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.690"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.658"
                },
                "BudgetYearOneBase": {
                    "val": "-0.658"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.690"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.658"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.658"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "779"
                    },
                    "ProjectTitle": {
                        "val": "Command, Control And Platform Electronics Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.407"
                        },
                        "CurrentYear": {
                            "val": "15.805"
                        },
                        "BudgetYearOne": {
                            "val": "16.444"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.444"
                        },
                        "BudgetYearTwo": {
                            "val": "17.863"
                        },
                        "BudgetYearThree": {
                            "val": "17.482"
                        },
                        "BudgetYearFour": {
                            "val": "17.826"
                        },
                        "BudgetYearFive": {
                            "val": "18.183"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project researches moveable and mobile command post hardware and other components, software and algorithms that enable commanders at all echelons to have more accurate, useful, and timely information and allows them to execute mission command (MC) from anywhere on the battlefield: in the command post, in vehicles, or dismounted.  Emphasis is on advancements to MC computing platforms with a specific emphasis on positioning, navigation, and timing (PNT), user\/computing platform interaction and cognitive burden reduction; informed operations\/data to decisions; and commander-centric capabilities including using automation to augment or supply staff capabilities. This project researches technologies that support multi-modal man-machine interaction, battle space visualization, positioning and navigation in degraded environments (poor Global Positioning System (GPS) performance), automated cognitive decision aids, real-time collaborative tactical planning tools, open system architectures, and integration concepts which contribute to more efficient expeditionary and uninterrupted operations.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications - Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Assured Positioning, Navigation, and Timing (A-PNT)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates positioning, navigation and timing sensor\/integration technologies to provide position, velocity, and time information to support operational and training requirements, especially in GPS denied\/degraded environments. This effort also designs PNT modeling and simulation (M&S) architectures, frameworks and models. Work being accomplished under PE 0603772A\/project 101 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.677"
                                            },
                                            "Text": {
                                                "val": "Investigated and analyzed new sensor technologies for potential navigation and timing applications such as atomic sensors, multi-Global Navigation Satellite Systems (multi-GNSS), emerging signals of opportunity (SOOs), and micro-electromechanical systems (MEMS) focusing on improvements to individual sensors and methods for improved manufacturing techniques allowing the potential for smaller integrated navigation systems; examined vision based sensors and other aiding techniques such as human motion classification and network assisted navigation to enable navigation in the absence of GPS signals; investigated GPS augmentation systems to evaluate compatibility with new Military-Code (M-Code) receiver chips and the ability to make GPS user equipment for ground vehicles and dismounted Soldiers less susceptible to interference sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.870"
                                            },
                                            "Text": {
                                                "val": "Investigate MEMS sensors, anti-jam\/anti-spoof antennas, multi-GNSS receivers that incorporate M-code capability; research the application of laser-based light detecting and ranging (LIDAR) as an improvement over visible light vision systems; investigate a common interface for PNT applications to enable the seamless incorporation of new sensors; research the application of atomic sensors for gyros, accelerometers and clocks for independent location information using no external signals; explore the feasibility of integrating star trackers with terrestrial PNT systems; research performance effects on navigation solutions when incorporating a variety of emerging PNT technologies such as cameras with rolling vs. global shutters; mature Blue Force Electronic Attack (BFEA) models and simulations to emulate and account for M-code enabled GPS receivers; conduct experiments with various technologies to provide PNT for autonomous vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.690"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.690"
                                            },
                                            "Text": {
                                                "val": "Will design and develop software tools to support the location and adjustment of pseudolite and autonomous navigation assets on the battlefield to maximize PNT information availability; expand upon research in celestial navigation to include tow-way time transfer techniques for independent localization and time for pseudolites in GPS denied environments; conduct research involving LIDAR odometry, visual navigation, and map building to help aid integrated navigation systems and improve the PNT solution accuracy and jam resistance for mounted, dismounted, and autonomous applications; investigate new anti-jam antenna designs for anti-spoofing capabilities; continue research in and fabrication of new and emerging inertial sensors in collaboration with the Army Research Laboratory and the Defense Advanced Research Projects Agency to reduce the size and increase the accuracy of these devices, allowing them to provide accurate position information for longer periods of time when GPS signals are lost or jammed; mature RF ranging and positioning sensor components and algorithms to further augment GPS signals, provide precise position information and shorten time to first fix; design a PNT simulation architecture and framework; design and code models with selectable fidelity for PNT components, devices, and systems of the Army and other Services; perform analyses and studies using PNT models to assess their usefulness to support Army and other Service science and technology efforts and acquisition decisions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Mission Command (MC) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and codes software to enable a uniform MC capability and experience for the commander in the command post, on the move in vehicles, or dismounted and increases the situational awareness and decision making capacity across the battlefield.  Work being accomplished under PE 0603772A\/project 101 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.730"
                                            },
                                            "Text": {
                                                "val": "Researched and brassboarded the required data, system architectures, and leader tools needed to provide continuously available MC capabilities from tactical through strategic echelons; investigated and designed multi-echelon, unified MC software with a particular emphasis on enabling small unit commander-centric operations; designed and coded MC software that dynamically assesses the mission and the battle space to help maximize mission success by managing limited and distributed resources,; designed and coded software tools that enable Soldiers to explore data, visualize relationships, and create and modify workflows to update and modify MC software applications without re-programming and revalidation; designed MC software that analyzes unstructured and structured data from discourse, social media, and computer systems to provide alerts, suggest collaboration opportunities, and deliver expert level decision support to the commander; designed and coded software that measures individual and staff workload to facilitate more agile team operation and that applies distributed computing to solve a complex, multi-element problem within a small group of Soldiers without reach back to higher echelons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.935"
                                            },
                                            "Text": {
                                                "val": "Design and validate an infrastructure and software architecture that permits a single source code base to deploy MC applications across different platforms in the command post, mounted and dismounted environments; investigate a virtual staff capability to supply staff-like functionality to the commander; mature software that enables small unit commander-centric operations by helping the commander to drive the operations process and assist in unit to unit and cross coalition interaction; investigate how to include human factors engineering early into MC software designs in order to simplify user interactions with the software and reduce cognitive load on the Soldiers; design software to perform MC of teams of humans and multiple autonomous systems to augment unit effectiveness and unburden Soldiers by eliminating multiple complex interfaces with the autonomous systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.754"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.754"
                                            },
                                            "Text": {
                                                "val": "Will investigate and develop software that will help the commander and staff define what MC tasks must be performed in order to insure mission success, help to optimally assign those tasks to resources such as Soldiers, track how the tasks are being completed, and support any needed adjustments to the mission tasks; develop software to display what is known about enemy actions in easy to understand ways and show how those actions will impact the current mission; develop software to process the needed mission tasks and enemy actions and generate recommendations suggesting courses of action that were successful in similar circumstances in the past; develop software that will help the commander and staff to interoperate more effectively by enabling the commander to easily make and track staff assignments and to quickly access staff reports, estimates, and recommendations regardless of the commanders physical location; continue to investigate how to determine which mission tasks can be given to unmanned systems (robots) to execute; investigate technologies to limit needed human involvement in unmanned system task execution; develop software to help planners to integrate multiple and different types of unmanned systems into a team with shared tasks in order to achieve mission success."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H92"
                    },
                    "ProjectTitle": {
                        "val": "Communications Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.710"
                        },
                        "CurrentYear": {
                            "val": "20.355"
                        },
                        "BudgetYearOne": {
                            "val": "21.359"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.359"
                        },
                        "BudgetYearTwo": {
                            "val": "21.229"
                        },
                        "BudgetYearThree": {
                            "val": "21.007"
                        },
                        "BudgetYearFour": {
                            "val": "21.431"
                        },
                        "BudgetYearFive": {
                            "val": "21.870"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates and applies advanced communications and network devices, software, algorithms and services by leveraging and adapting commercial research and new communications and network sciences work by the Army Research Lab, Network Science Collaborative Technology Alliance or other Basic Research efforts. This project focuses development in wireless transport (e.g. mobile radio based communications systems) to develop new techniques for improving communications in high radio frequency (RF) interference environments such as in the presence of electronic warfare (EW) and to increase the communications capacity of terrestrial and satellite communications (SATCOM) systems. This project also investigates enabling antenna components, materials, designs and configurations to reduce the visual signature of antennas on Soldier, vehicular and airborne platforms and reduce co-site interference on platforms with multiple transceivers such as radios and jammers. Additionally this project investigates cyber security devices, software and techniques to harden wireless communications networks against cyber attacks; and new mobile networking protocols to make wireless, on-the-move (OTM) communications networks more responsive to user needs. This project also investigates network operations software and techniques that improve the ability of the Soldier to manage and maintain complex, dynamic networks; and improved spectrum management software tools to make more efficient use of over-subscribed RF spectrum. This project also provides new technology capabilities to lower the size, weight, power (SWaP) and cost of networking systems deployed on Army platforms through rapid technology improvements in hardware and software convergence.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications (comms) and Intelligence portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antenna and Hardware Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates low cost, power efficient, conformal and directional antenna technologies for terrestrial, airborne, and tactical SATCOM ground terminals to enable them to operate OTM over multiple frequency bands, and further investigates armor embedded antenna and distributed array technologies. Together these efforts will improve ground forces electronic protection, increase signal power and range and provide greater connectivity for both mounted and dismounted forces. This effort also provides new technology capabilities to lower the SWAP and cost of networking systems deployed on Army platforms through hardware and software convergence. Work being accomplished under PE 0602270A\/project 906, PE 0603008A\/project TR1, PE 0603270A\/project K15 and PE 0603794A\/project EL4 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.871"
                                            },
                                            "Text": {
                                                "val": "Designed and matured a smart switching system for distributed antenna arrays enabling higher output power, interoperability and improved link connectivity for SATCOM; investigated and matured antenna systems and arrays that provide improved communications performance and reliability through EW jammed environments; developed and finalized a government standard architecture to provide standard form-fit and electronic interfaces for distributed terrestrial and SATCOM antenna systems to support interchange of communications modes on battlefield platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.787"
                                            },
                                            "Text": {
                                                "val": "Complete and demonstrate in a lab environment a smart switch for distributed antenna arrays enabling higher output power, interoperability and improved link connectivity for SATCOM; complete and demonstrate in a lab environment antennas and antenna arrays that provide improved communications performance and reliability through EW jammed environments; design\/develop a government standard architecture to provide standard form-fit and electronic interfaces for distributed terrestrial antenna systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.425"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.425"
                                            },
                                            "Text": {
                                                "val": "Will finalize a Government standard architecture to provide standard form-fit and electronic interfaces for distributed terrestrial antenna systems for ground vehicle and command post application; explore architecture approaches and potential benefits of upgrading conventional analog intermediate frequency (IF)-based SATCOM terminal designs to digital IF systems for enhanced flexibility and performance, reduced footprint and cost and improvement of features such as monitoring, alarms and built in test capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Information Assurance (IA) and Cyber Defense"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, codes and fabricates software, algorithms and devices to protect wireless tactical networks against computer network attacks. Effort includes technologies that are proactive rather than reactive in countering attacks against tactical military networks. Work being accomplished under PE 0603008A\/project TR2 and 0603794A\/ project EL5 complements this effort, and is fully coordinated with the Army Research Lab Cyber Security Collaborative Research Alliance, PE 0601104A\/project EA6."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.114"
                                            },
                                            "Text": {
                                                "val": "Evaluated and matured optimized cyber maneuver capabilities that incorporate the use of reasoning, intuition, and perception while determining the optimal scenario on when to change network configurations and settings to increase the difficulty for red forces to perform malicious network reconnaissance prior to attack; encoded, evaluated and matured software to provide a feedback system to optimize the effectiveness of  cyber maneuver and threat assessments; researched algorithms and evaluated the effectiveness of dynamically maneuvering computer operating systems and applications to further restrict red force ability to perform malicious reconnaissance on tactical network components and hosts; matured and optimized data sharing and collaboration techniques between offensive and defensive operations and across security boundaries to enable advanced warning and response actions; researched trans-disciplinary computer experimentation models that emulate attackers-defenders-users interactions and associated technological and human interrelationships; researched a software based encryptor point solution that meets National Security Agency (NSA) formal requirements to eliminate the need for physical encryption devices on Army tactical communications systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.654"
                                            },
                                            "Text": {
                                                "val": "Design and code software that employs techniques for data sharing and collaboration between offensive and defensive operations and across security boundaries to enable advanced warning and response actions; design and code a software based encryptor that meets NSA formal requirements to eliminate the need for physical encryption devices; mature design of security for network protocols; research, design and develop algorithms to identify, protect, and prevent insider threat negligence and-or malicious actions; research and design software tools and a framework for independent software assessments to easily and quickly identify vulnerabilities during development and integration with third party software to detect potential vulnerabilities well prior to the software being used on Army networks; research, design and code software that incorporates cyber risk assessment, threat detection, cyber response agility and psycho-social behavior prediction to improve network security; design and develop an NSA Type 1 reprogrammable logic single chip cyptographic engine which includes anti-tamper and security boundary technology (both information security functions) and cryptographic engine within the chip design, emphasis is to develop a capability that can be reused, scaled, and-or repackaged to satisfy the particular constraints of different platform developments (e.g., hand held devices, unmanned sensors, satellite systems, key load devices, etc.) without significant redevelopment and recertification efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.180"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.180"
                                            },
                                            "Text": {
                                                "val": "Will design models and algorithms in support of computer network defense and counter attack models; design software to address cyber risk detection, agility and human psychosocial elements as they relate to cyber defense; design, develop and validate new defensive cyber metrics; run defensive cyber operation experiments to assess tactical applicability of new cyber theories\/models; make determinations on how new validated cyber theories impact other on-going cyber research and how those programs should shift their technical implementations to incorporate these theories; design a robust software solution to identify, prevent and protect role-based tactical systems from insider threats and malicious behaviors and\/or negligence; design experiments for detection of insider threats based on biometric identification; identify tactical environmental roles to compare, group and generalize roles, identify system critical points and variables as part of a behavioral study, coordinate and collaborate with the Program Executive Offices (PEOs) and Program Managers (PMs) to gather necessary information on roles in the tactical environment; identify operational cases and insider threat scenarios, calculate risks and effects for each case type to identify solutions from commercial and government off the shelf or develop new solutions; design software and algorithms comprised of user behavioral components to identify and prevent insider, adversary and negligent action threats in existing tactical systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications Security"
                                    },
                                    "Description": {
                                        "val": "This effort researches technologies to improve the security posture of wired and wireless communications components, software and algorithms. Work being accomplished under PE 0603008A\/project TR2 and 0603794A\/ project EL5 complements this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.866"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.866"
                                            },
                                            "Text": {
                                                "val": "Will design an advanced processing technique to reduce interference in SATCOM waveforms; design a means to monitor spectrum for wideband SATCOM and design and document situational awareness parameters, protection through diversity and interference mitigation for Army tactical SATCOM Networks; perform a detailed study to analyze wideband SATCOM interference suppression for both enterprise applications utilizing digital IF and tactical multi-frequency, time division multiple access waveform applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future Communications and Networking Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and fabricates components and codes software for radios and network management systems to enable access to spectrum that is unavailable because of current inefficient spectrum management methods. This includes new management and visualization modalities as well as improved RF modulation techniques, devices and software. This effort investigates technologies for networking protocol development as well as networking technologies for routing and disruption tolerant networks. This effort also investigates RF signal processing, signal transmission and codes software to detect and overcome the interference of SATCOM due to jamming or atmospheric conditions such as scintillation. Work being accomplished under PE 0603008A\/project TR1 and 0603794A\/ project EL4 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.725"
                                            },
                                            "Text": {
                                                "val": "Investigated techniques for managing and self-initiating wireless networks to improve robustness, efficiency and capacity; investigated coordinated scheduling algorithms and efficient architectures, routing protocols etc. and incorporated a range of techniques (including directional networking, multi function waveforms, interference mitigation etc. to achieve efficient spectrum use and enable tactical wireless networks to increase overall performance in hostile and RF environments including spectrum congested and GPS denied environments; researched network and physical layer models for tactical networking waveforms to enable the evaluation of the effectiveness of new signal processing and networking technologies to overcome RF interference such as red force jamming; designed and coded network reasoning software to enable the dynamic selection of signal processing and RF transmission techniques such as adaptive signal cancellation, coordinated scheduling of discontiguous signals, directional networking and multiple input multiple output networks to overcome adversarial RF jamming; developed a waveform architecture to define interfaces between the various RF, networking and signal processing hardware components; evaluated and developed signal analysis algorithms to detect RF interference of SATCOM signals; researched and performed system analysis for protected SATCOM architectures to support modulation, coding and redundancy protection methods; researched and analyzed precision polarization concepts to support multiple communications paths and bandwidth expansion; performed modeling, simulation and emulation of networks to assess performance in contested environments; matured and evaluated performance of a signals management module for integration into the Soldier Radio Waveform to manage communications and blue force jamming RF emissions to prevent cosite interference while maintaining communications\/jamming performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.914"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and mature network and physical layer models for tactical networking waveforms to overcome RF interference; develop digital signal processing and adaptive interference cancellation algorithms to enable efficient utilization of spectrum; investigate and mature a waveform architecture to define interfaces between the various RF, networking and signal processing components; develop directional networking and disruption tolerant networks to protect the network from electronic warfare systems while using spectrum efficiently; continue to perform modeling, simulation and emulation of networks to assess network performance to quantify the efficacy of the various techniques being developed to improve the network capacity and robustness; develop network protocols for operations in contested electromagnetic environment using techniques such as interference cancellation, multifunction waveform and coordinated scheduling algorithms for electronic protection optimization; develop software defined networks for tactical applications; mature and begin implementation of feasible architectures and technologies for increasing tactical network capacity and performance in a dynamic spectrum environment; develop the framework for an adaptive media access code physical layer to evolve the tactical network while improving capacity; develop resilient core and routing protocols to increase performance of the tactical network; begin development of protocols to support mission and user-aware routing and content based networking; begin development of networking frameworks and network abstraction layer for interoperable end to end voice over internet protocol; research feasible approaches to enable networking in Global Positioning System denied environment; develop security framework by investigating multi layer security routing and conduct high assurance internet protocol encryptor bypass study."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.888"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.888"
                                            },
                                            "Text": {
                                                "val": "Will develop spectrum efficient multifunctional waveforms that enable coordination of multiple command, control, communications, computing, intelligence surveillance and reconnaissance (C4ISR)\/EW RF functions without cosite interference within a common RF converged chassis; mature common scheduling techniques to optimize electronic protection for tactical communication systems; implement digital RF interference cancellation algorithms for laboratory assessment; mature disruption tolerant network algorithms to make wireless networks more resilient against EW jamming while using spectrum efficiently; design and mature algorithms for forecasting and detecting anomalous network events (such as jamming, interference, congestion, network partitions) to improve network performance in a spectrum congested environment; develop a methodology to evaluate constrained application protocol management software interface to improve network management capability; design terrestrial communications waveform concept for a frequency-agile system that will support flexible resource allocation and noncontiguous channels to enable coexistence of terrestrial, SATCOM and other communications systems in congested spectrum; design standards, software, management protocols and data models for coordinated management of EW and Communications; mature end-to-end standard based combat voice architecture that is spectrum efficient and easy to set up and maintain; mature disruption tolerant network transport service that can provide robustness against disruptions and reliable delivery of critical data over Army tactical radio based networks; mature routing protocols and supporting framework that is mission- and user-aware to provide data delivery most efficiently in a multi-waveform environment; mature routing algorithms that support multiple network routes by coordinating multiple routing protocols for network transactions; mature software defined networking (SDN) architecture for the Army tactical edge networks and mature SDN waveforms that will identify and mitigate network vulnerabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}