{
    "id": "44ed2bb4ca47ddd9fc70665e521ba9c59cfd3158",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA7_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0607131A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Product Improvement Programs"
        },
        "R1LineNumber": {
            "val": "164"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "4.945"
            },
            "BudgetYearOne": {
                "val": "14.517"
            },
            "BudgetYearOneBase": {
                "val": "14.517"
            },
            "BudgetYearTwo": {
                "val": "7.001"
            },
            "BudgetYearThree": {
                "val": "5.753"
            },
            "BudgetYearFour": {
                "val": "5.835"
            },
            "BudgetYearFive": {
                "val": "6.716"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Project ER2: The Close Combat Technology program includes development efforts to upgrade Close Combat technologies, energetics, and munitions, such as counter explosives, grenades, demolitions, shoulder launched munitions, pyrotechnic simulators, countermeasure flares, non-lethal ammunition\/systems, networked munitions and mines, that have been fielded or have received approval for full rate production.  This program will identify, characterize, study, analyze, test and develop technologies to resolve close combat munition reliability, safety, environmental, storage, standardization, obsolescence and manufacturing\/producibility issues.  \n\nFY 2017 funds will be used to support the following efforts: MK3A2 Offensive Hand Grenade, improve Claymore Force-on-Force Training Aids, Device, Simulator and Simulation (TADSS) Trainer, Countermeasure Flare Decoy Formulations, AN-M82A Obscuration Grenade, and Non-Lethal Ammunition Obsolescence.\n\nProject ER5: The Indirect Fire and Fuze Technology program supports product improvement development efforts to upgrade indirect fire weapon systems and munitions that have already been fielded and\/or are in production.  Indirect Fire Weapons and Munitions Product Improvement Programs include improved target engagement; increased reliability, availability, maintainability, and safety; standardization and interoperability with weapons and munitions of Allied Nations; defense exportability features under the auspices of Better Buying Power; reduced taxpayer life-cycle costs; reduction of failure mechanisms and supply chain risk through introduction of new and alternative technology and materiel solutions; materiel and technology obsolescence mitigation; improvement of manufacturing methods and their associated production and life cycle support processes; new capabilities in response the evolving and emerging threats and countermeasures; and reduction\/elimination of potential environmental and health risks associated with these products and their underlying components, materials, and production processes.   \n\nThis program supports the standardization and interoperability of legacy and new production U.S. weapons and ammunition with Allied Nations to maximize battlefield interchangeability\/compatibility under the auspices of the international Joint Ballistics Memorandum Of Understanding (JBMOU).  Maximizing standardization, interchangeability, and exportability will also potentially increase Foreign Military Sales (FMS) of U.S. indirect fire Weapon and Munition products to maintain critical mass domestic production and affordable taxpayer costs through increased economies of scale.\n\nThis program also supports the identification, study, analysis and development of fuzing technologies and safe and arm devices in production and in the field. This program will implement these technologies into fuzing systems to preclude obsolescence, maximize standardization, enhance performance, and improve the safety and exportability of existing munitions. The program addresses two major areas: (1) analysis and (2) block upgrades. Analysis efforts will identify second sources for fuzing systems that may reduce cost by providing competition, and maintain production when sources or parts are no longer available. It will also allow for the performance enhancement of current ammunition items by conducting studies of major fuze components to detect and identify latent defects. The second major area is block upgrades, which will identify and perform studies on improvements to fuzes; increase commonality of fuze components and requirements. Block upgrades will enable the introduction of the latest technologies into fuzing, keep the fuzing design current to avoid obsolescence issues, and add capabilities. \n\nProject ER6: The Munitions, Survivability and Logistics program funding will be used to support direct fire ammunition from small caliber ammunition, 40mm grenade, medium caliber cannon ammunition and large caliber ammunition enhancements to lethality, effectiveness, survivability, accuracy and general product improvements.  In FY 2016, this program assures complete interchangeability of direct fire ammunition and weapons among all the North Atlantic Treaty Organization  (NATO) countries with all of the associated logistic, strategic and tactical advantages of the alliance.  The program involves development and testing compliance of NATO standardization agreements (STANAGS) and staffing of the North American Regional Test Center (NARTC).  In FY 2017, the NATO Standardization mission transfers to PE 0605805A - Munitions Standardization, Effectiveness and Safety, Project F21 - Direct Fire Technology and NATO Ammo Evaluation.       \n\nFY 2017 funds are used for a more lethal and safer design for 40mm grenades that will be built and tested.  An improved 30mm training round for the Apache helicopter will allow pilots to see where the rounds strike.  Warhead improvements for the 30mm Apache ammunition are also under development.  A number of studies on potential improvements for training ammunition and better primers will be conducted."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "4.945"
                },
                "BudgetYearOne": {
                    "val": "4.322"
                },
                "BudgetYearOneBase": {
                    "val": "4.322"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "4.945"
                },
                "BudgetYearOne": {
                    "val": "14.517"
                },
                "BudgetYearOneBase": {
                    "val": "14.517"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "10.195"
                },
                "BudgetYearOneBase": {
                    "val": "10.195"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "10.195"
                                },
                                "BudgetYearOneBase": {
                                    "val": "10.195"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "ER2"
                    },
                    "ProjectTitle": {
                        "val": "Close Combat Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.870"
                        },
                        "BudgetYearOne": {
                            "val": "4.300"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.300"
                        },
                        "BudgetYearTwo": {
                            "val": "1.183"
                        },
                        "BudgetYearThree": {
                            "val": "0.832"
                        },
                        "BudgetYearFour": {
                            "val": "0.956"
                        },
                        "BudgetYearFive": {
                            "val": "1.083"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.224"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Grenades MK3A2 Replacement, Concussion Grenade Optmization Effort and Claymore Force-on-Force Training Aids, Devices, Simulators, and Simulations (TADSS) Trainer are efforts previously funded under project 296 PE 0605805A - Munitions Standardization, Effectiveness and Safety.  FY2017 also includes Countermeasure Flare Decoy Formulations, AN-M8A2 Obscuration Grenade and Non-Lethal Ammunition Oblolescence."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program includes development efforts to upgrade Close Combat technologies, energetics, and munitions, such as counter explosives, grenades, demolitions, shoulder launched munitions, pyrotechnic simulators, countermeasure flares, non-lethal ammunition\/systems, networked munitions and mines, that have been fielded or have received approval for full rate production.  This program will identify, characterize, study, analyze, test and develop technologies to resolve close combat munition reliability, safety, environmental, storage, standardization, obsolescence and manufacturing\/producibility issues.\n\nFY 2017 funds will be used to support the following efforts: MK3A2 Offensive Hand Grenade, improve Claymore Force-on-Force Training Aids, Device, Simulator and Simulation (TADSS) Trainer, Countermeasure Flare Decoy Formulations, AN-M82A Obscuration Grenade, and Non-Lethal Ammunition Obsolescence."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Claymore Force-on-Force Training Aids, Devices, Simulators, and Simulations (TADSS) Trainer"
                                    },
                                    "Description": {
                                        "val": "Develop an improved Claymore Force-on-Force Training Aids, Devices, Simulators, and Simulations (TADSS) Trainer.  The Claymore does not have a TADSS trainer with sight, sound & Multiple Integrated Laser Engagement System (MILES) capability.  Development of an improved Claymore trainer will allow Claymore to be trained at Combat Training Centers (CTCs) and will provide more realistic and effective training for the user when they are training Claymore as an end item and when training Claymore as initiated by Spider."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.370"
                                            },
                                            "Text": {
                                                "val": "Continue the design and test of the Non-Pyro Claymore Simulation (NPCS), finalize the design and test of the Fireset Board and the Multiple Integrated Laser Engagement System (MILES) Emitting Unit. Conduct a Systems Requirements Review (SRR), a Preliminary Design Review (PDR), and perform a User Assessment and Demonstration of the System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.950"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.950"
                                            },
                                            "Text": {
                                                "val": "Design and test Fireset Board, Non-Pyro Claymore simulation and Multiple Integrated Laser Engagement System (MILES) Emitting Unit. Conduct a Preliminary Design Review, perform user assessments and demonstrations and a preliminary Drop and Loose Cargo test. Conduct a Systems Verification Test. All efforts will lead to delivery of a production representative prototype Claymore TADSS trainer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MK3A2 Replacement, Concussion Grenade Optimization Effort"
                                    },
                                    "Description": {
                                        "val": "The Current MK3A2 Offensive Hand Grenade can expose the warfighter to toxic levels of asbestos and is restricted for use in Continental United States and Outside Continental United State (CONUS\/OCONUS).  The warfighter cannot safely employ this grenade.  Alternate munitions do not satisfy user requirements for incapacitating the enemy.  This effort incorporates modern materials and insensitive explosives to provide a safer, producible concussion grenade."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "The FY16 effort will include finalizing the design of grenade.  The training device design will also be finalized.  Production Qualification (PQT) hardware will be procured and built."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.926"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.926"
                                            },
                                            "Text": {
                                                "val": "Production Qualification Testing (PQT) will be conducted in addition to Insensitive Munitions testing and other testing required to support Type Classification (TC).  The final report will be generated.  TC documentation will be generated in preparation for TC in 2QFY18."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Countermeasure Flare Decoy Formulations"
                                    },
                                    "Description": {
                                        "val": "Improve the producibility of countermeasure (CM) decoy formulations in order to increase the production safety and functional reliability to protect aircraft against multiple threat systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.480"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.480"
                                            },
                                            "Text": {
                                                "val": "Develop prototypes and conduct developmental testing.  Effort will result in a production representative prototype countermeasure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AN-M8A2 Obscuration Grenade"
                                    },
                                    "Description": {
                                        "val": "This effort supports the Type Classification \/ Production Prove Out of a new obscurant grenade that provides the warfighter with three times the performance of the current M83 without exposing the soldier to the carcinogens of the AN-M8.  Use of the AN-M8 Obscuration Grenade has been discontinued in Continental United State and Outside Continental United State (CONUS\/OCONUS) due to restrictions of Hexachlorethane on the battlefield.   The M83 is incapable of providing smoke duration or density at the required performance level of the AN-M8, so the current warfighter strategy is to utilize two M83 Obscuration Grenades to replace the performance of the AN-M8."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Effort during FY17 will include finalizing the design of th grenade, producing the test quantity and beginning TC\/FMR documentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Lethal Ammunition Obsolescence"
                                    },
                                    "Description": {
                                        "val": "Due to advancement in technology, electronic components of fuzed items are rapidly becoming obsolete.  Obsolescence slows or even stops production and delays delivery of systems to inventory which impacts warfighter readiness.  This effort will fund the replacement of obsolete chips on the BA39, XM1112 Tactical Non Lethal Munition 40MM projectile.  Qualification testing will also be required to ensure that the functionality of the round is unchanged."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.144"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.144"
                                            },
                                            "Text": {
                                                "val": "This effort will study alternatives to the obsolete components.  A contract will be issued to build prototype components for initial testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable for these items."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MK3A2 Replacement, Concussion Grenade Optimization Effort"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM CCS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.050"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Claymore Force-on-Force TADSS Trainer - Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM CCS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.020"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.085"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.085"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.105"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MK3A2 Replacement, Concussion Grenade Optimization Effort"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM CCS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.020"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.020"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Countermeasure Flare Decoy Formulations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM CCS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.030"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.030"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.060"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.090"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "M8A2 Enhanced Obscuration Grenade"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM CCS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.025"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.025"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.025"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Non-Lethal Ammunition Obsolescence"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM CCS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.025"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.025"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.025"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MK3A2 Replacement, Concussion Grenade Optimization Effort"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.480"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.480"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Claymore Force-on-Force TADSS Trainer - Design, Develop and Deliver a Production Prototype"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.865"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.865"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.215"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Countermeasure Flare Decoy Formulations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ACC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.170"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.520"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MK3A2 Replacement, Concussion Grenade Optimization Effort"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.909"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.909"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.909"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Countermeasure Flare Decoy Formulations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Aresenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.270"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.370"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "M8A2 Enhanced Obscuration Grenade"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.400"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "M8A2 Enhanced Obscuration Grenade"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ECBC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edgewood, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.300"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "M8A2 Enhanced Obscuration Grenade"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Pine Bluff"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pine Bluff Arsenal"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.075"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.075"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.075"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Non-Lethal Ammunition Obsolescence"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.119"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.119"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.119"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MK3A2 Replacement, Concussion Grenade Optimization Effort"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.877"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.877"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.877"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MK3A2 Replacement, Concussion Grenade Optimization Effort"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DAHLGREN"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dahlgren, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.090"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.090"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.090"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98191-4.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "98191-5.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "98191-6.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "98191-7.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Claymore Force-on-Force TADSS Trainer"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fireset Board Design and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Multiple Integrated Laser Engagement Sys (MILES) Emitting Unit Design and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Non-Pyro Claymore Simulation Design and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Early User Assessment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Readiness Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Preliminary Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Critical Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fort Leonard Wood and Benning Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Preliminary Drop and Loose Cargo Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Systems Verification Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Environmental Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Delivery 1 - Production Representative Prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MK3A2 GRENADE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Baseline Final Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Produce Test Quantity"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Detailed Spec, Type Classification\/Full Material Release (TC\/FMR) Documentation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Production Qualification Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Type Classification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Material Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Countermeasure Flare Decoy Formulations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Program Contract Preparation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prototype Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prototype and Developmental Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Hardware Contract Preparation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Hardware Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ECP Confirmation Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ECP Preparation and Staffing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ECP Tech Data Package"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AN-M8A2 Obscuration Grenade"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Final Design Review - For QTY"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "-Produce Test Quantity"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Type Classification Documentation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Material Release Documentation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "-Production Validation Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "-Type Classification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "-Full Material Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Non-Lethal Ammunition Obsolescence"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop Alternate Design"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Translate Process to Chip"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complete Translation Process"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Build Prototype"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Test Prototype"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Build Test Hardware Chips"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Build Qualification Hardware"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct Qualification Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Update TDP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ER5"
                    },
                    "ProjectTitle": {
                        "val": "Indirect Fire and Fuze Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.771"
                        },
                        "BudgetYearOne": {
                            "val": "0.883"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.883"
                        },
                        "BudgetYearTwo": {
                            "val": "2.159"
                        },
                        "BudgetYearThree": {
                            "val": "2.320"
                        },
                        "BudgetYearFour": {
                            "val": "2.328"
                        },
                        "BudgetYearFive": {
                            "val": "2.816"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.277"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program supports product improvement development efforts to upgrade indirect fire weapon systems and munitions that have already been fielded and\/or are in production.  Indirect Fire Weapons and Munitions Product Improvement Programs include improved target engagement; increased reliability, availability, maintainability, and safety; standardization and interoperability with weapons and munitions of Allied Nations; defense exportability features under the auspices of Better Buying Power; reduced taxpayer life-cycle costs; reduction of failure mechanisms and supply chain risk through introduction of new and alternative technology and materiel solutions; materiel and technology obsolescence mitigation; improvement of manufacturing methods and their associated production and life cycle support processes; new capabilities in response the evolving and emerging threats and countermeasures; and reduction\/elimination of potential environmental and health risks associated with these products and their underlying components, materials, and production processes.   \n\nThis program supports the standardization and interoperability of legacy and new production U.S. weapons and ammunition with Allied Nations to maximize battlefield interchangeability\/compatibility under the auspices of the international Joint Ballistics Memorandum Of Understanding (JBMOU).  Maximizing standardization, interchangeability, and exportability will also potentially increase Foreign Military Sales (FMS) of U.S. indirect fire Weapon and Munition products to maintain critical mass domestic production and affordable taxpayer costs through increased economies of scale.\n\nThis program also supports the identification, study, analysis and development of fuzing technologies and safe and arm devices in production and in the field. This program will implement these technologies into fuzing systems to preclude obsolescence, maximize standardization, enhance performance, and improve the safety and exportability of existing munitions. The program addresses two major areas: (1) analysis and (2) block upgrades. Analysis efforts will identify second sources for fuzing systems that may reduce cost by providing competition, and maintain production when sources or parts are no longer available. It will also allow for the performance enhancement of current ammunition items by conducting studies of major fuze components to detect and identify latent defects. The second major area is block upgrades, which will identify and perform studies on improvements to fuzes; increase commonality of fuze components and requirements. Block upgrades will enable the introduction of the latest technologies into fuzing, keep the fuzing design current to avoid obsolescence issues, and add capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ARDEC Fuze Technology Improvements"
                                    },
                                    "Description": {
                                        "val": "Activities include Maturation and Validation, and Risk Reduction of fuze component alternatives to increase sources of supply, improve performance, and lower cost. Integration of fuze initiation improvements to increase reliability and lower fuze costs. Evaluation of fuze electronic upgrades to improve safety and increase performance reliability. Evaluation of inductive fuze setting improvements to lower costs. Evaluation of fuze sensing interface improvements for increased safety."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.336"
                                            },
                                            "Text": {
                                                "val": "Block Upgrades: Will mature and evaluate Micro Electro Mechanical Systems (MEMS) component packaging improvements for increased performance and lower cost. Will conduct tests to demonstrate improvements to the mortar fuze electronics. Will conduct tests to prove-out the mortar fuze delay primer improvements. Will conduct fuze impact switch \/electronics integration and prototype builds. Will conduct fuze setback spring prototype fabrication and builds. Will evaluate improvements to the inductive fuze setter interface and initialization of large caliber indirect fire munitions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.625"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.625"
                                            },
                                            "Text": {
                                                "val": "Block Upgrades:. Will conduct engineering tests to prove-out the mortar fuze delay primer improvements. Will conduct engineering tests to prove-out the mortar fuze impact switch upgrades. Will conduct engineering tests to prove-out fuze setback spring interface improvements. \nAnalysis\/Risk Mitigation: Will conduct studies on electronic component replacement prototypes for indirect and direct fire fuzes due to component obsolescence."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Indirect Fires Weapons And Munitions Standardization and Interoperability"
                                    },
                                    "Description": {
                                        "val": "Activities include maturation, validation, and risk reduction of battlefield interchangeability\/compatibility and associated enabling technologies between US and Allied 155mm weapons and munitions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.435"
                                            },
                                            "Text": {
                                                "val": "Activities include ballistic testing including firing tables, safety, reliability and performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.258"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.258"
                                            },
                                            "Text": {
                                                "val": "Activities include ballistic testing including firing tables, safety, reliability and performance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Joint Ballistics Memorandum of Understanding (JBMOU) Concerning the Standardization of Elements of 155mm Weapons and Ammo between US, FR, GE, IT, and UK was signed 18Dec09.  This is a FY17 continuation of live fire testing, evaluation, and validation and any corresponding NATO Armaments Ballistics Kernel (NABK) and Firing Control Input (FCI) database changes, enables battlefield interchangeability of existing\/new 155mm cannon munitions between domestic US and NATO\/Allied Nations Indirect Fires Weapons And Munitions. \n\nARDEC Fuze Technology Improvement (FTI) will improve current production munitions by exploiting existing fuzing technologies and inserting them into current production fuzes, providing safer, more producible, and more lethal fuzing solutions.  FTI develops second source suppliers and resolve component obsolescence issues to mitigate risk and prevent production interruptions in order to continue to provide safer, more reliable munitions for the Warfighter with significant risk reduction to production fuzes also benefiting the US Taxpayer.  In FY16, FTI will ballistically evaluate a proximity sensor filter to eliminate potential of early M734A1 fuze function due to undesired out-range response and generate ECP(s) to incorporate changes into M734A1 fuze TDP, ballistically evaluate the omni-directional G-switch performance of the M433 grenade, and evaluate if it will reduce duds, due to improved reliability on soft targets and graze angles.  In FY17 FTI will analyze the design modification to the escapement housing will ensure the M433 HEDP round and M918 training rounds will decrease the risk of having a defeated safety and evaluate feasibility of incorporating state of the art MEMS G-Switch into the M734A1\/M783 through comparable G-Switch performance metrics and generate ECP(s) to incorporate changes into M734A1\/M783 TDPs, evaluate feasibility of incorporating state of the art MEMS G-Switch into the M734A1\/M783 through equivalency tests for comparable G-Switch performance metrics and generate ECP(s) to incorporate changes into M734A1\/M783 TDPs. FTI will also analyze the delay primer and evaluate changes to the explosive mixture of the delay primer input cup assembly to reduce occurrences of instantaneous firings and generate ECP to incorporate into M734A1 and M783 fuze TDPs. as well as evaluate the potential for a simplified inductive fuze setting capability to provide cost savings and simplify integration with future weapon platforms.\n\nFTI will evaluate the design and integration of a custom radar transceiver integrated circuit into indirect fire proximity fuzes due to component obsolescence through bench and sub-scale testing. FTI will conduct tests to evaluate the integration of the next generation microcontroller into 60, 81, and 120mm mortar fuzes to replace the current one-time-programmable part due to component obsolescence. FTI will evaluate reserve power source improvements for indirect fire fuzes that will provide a safer, more producible reserve battery configuration that performs reliably across the operating temperature range through bench and sub-scale testing. FTI will evaluate the design and integration of a MEMS-based G-switch from a second source of supply which is used on direct fire and indirect fire production fuzes for the elimination of a single point failure through analysis, bench, and sub-scale testing. FTI will evaluate improvements on 40mm medium caliber fuze that will reduce occurrences of rejected parts due to porosity of material which will increase throughput and avoid cost escalations due to additional quality controls and will subsequently generate an ECP to incorporate into the M550 TDP."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Fuze Technology Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Picatinny"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.200"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.200"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "40mm Fuze Prototypes with Improved Setback Interface"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMTEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Janesville, WI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.100"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.100"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Picatinny"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.235"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.158"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.158"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.393"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.393"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FTI - Government Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Picatinny"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.136"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.475"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.475"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.611"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.611"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FTI - Ballistic Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Yuma"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.050"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.050"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Interoperability Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Yuma"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.300"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.300"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98191-8.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Safe & Arm Device Technology Integration of MEMs G-switch"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "M734A1\/M783 Delay Primer Improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "M734A1 Electronics Upgrade"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "M734A1\/M783 Impact Switch Upgrade"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "40mm M550 Setback Spring Interface Improvement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fuze Initialization Improvement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Second Source Electronics for Indirect Fire Fuzes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mortar Fuze Microcontroller replacement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Power Source Improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Second Source MEMS G-Switch"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "40mm Fuze Improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ER6"
                    },
                    "ProjectTitle": {
                        "val": "Direct Fire Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.304"
                        },
                        "BudgetYearOne": {
                            "val": "9.334"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.334"
                        },
                        "BudgetYearTwo": {
                            "val": "3.659"
                        },
                        "BudgetYearThree": {
                            "val": "2.601"
                        },
                        "BudgetYearFour": {
                            "val": "2.551"
                        },
                        "BudgetYearFive": {
                            "val": "2.817"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The 0607131A ER6, Munitions, Survivability and Logistics, program is not a new start.  Funds in this program in FY 2016 are a realignment of funds from program 0605805A - Munitions Standardization, Effectiveness and Safety for more efficient and effective program management.  In FY 2016 the F21 Direct Fire Technology and North Atlantic Treaty Organization (NATO) Ammunition Evaluation program transfers to PE 0607131A, Weapons and Munitions Product Improvement Programs, Project ER6, Munitions, Survivability and Logistics."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Munitions, Survivability and Logistics program funding will be used to support direct fire ammunition from small caliber ammunition, 40mm grenade, medium caliber cannon ammunition and large caliber ammunition enhancements to lethality, effectiveness, survivability, accuracy and general product improvements.  In FY 2016, this program assures complete interchangeability of direct fire ammunition and weapons among all the North Atlantic Treaty Organization  (NATO) countries with all of the associated logistic, strategic and tactical advantages of the alliance.  The program involves development and testing compliance of NATO standardization agreements (STANAGS) and staffing of the North American Regional Test Center (NARTC).  In FY 2017, the NATO Standardization mission transfers to PE 0605805A - Munitions Standardization, Effectiveness and Safety, Project F21 - Direct Fire Technology and NATO Ammo Evaluation.       \n\nFY 2017 funds are used for a more lethal and safer design for 40mm grenades that will be built and tested.  An improved 30mm training round for the Apache helicopter will allow pilots to see where the rounds strike.  Warhead improvements for the 30mm Apache ammunition are also under development.  A number of studies on potential improvements for training ammunition and better primers will be conducted."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Ammo Design Qualification & NATO Mission Support"
                                    },
                                    "Description": {
                                        "val": "This program assures complete interchangeability of small caliber and automated cannon-caliber, and 40mm grenade ammunition and weapons among NATO countries to achieve the associated logistic, strategic and tactical advantages."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work is supporting NATO small arms ammunition interchangeability group meetings, documentation and test operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lightweight Ammunition"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and quantify a Lightweight Small Caliber Ammunition (LSCA) 7.62mm capability that will provide an ammunition weight savings of twenty percent to the M240 gunner, assistant gunner and ammo bearer."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.264"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.264"
                                            },
                                            "Text": {
                                                "val": "FY 2017 funds used to perform government testing and continued improvement of candidate designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Caliber Ammunition Training Range Impact Reduction Engineering Study"
                                    },
                                    "Description": {
                                        "val": "Perform an engineering study on the feasibility of reducing the surface danger zone of small caliber training ammunition while maintaining a ballistic match to the combat ammunition out to maximum effective range of the combat ammunition. The results of the study will assist in establishing the baseline requirements for future training ammunition."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work evaluates .50 Caliber ball and trace potential candidates."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Metastable Intermolecular Composite (MIC) Primer Lead Free Primer"
                                    },
                                    "Description": {
                                        "val": "Automate and Integrate environmental friendly lead free primary explosives within the small caliber family of ammunition.  Addresses health concerns of lead intake during firing by removing lead styphnate from small caliber primers.  Automated pilot line combined with new mix reduces human exposure, improves quality, improves safety and reduces environmental waste stream in manufacturing process."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work supports optimizing primer mix for 5.56mm, 7.62mm, and .50 cal primers, develops master test plan for cartridge qualification, tests some 5.56mm cartridges for compatibility as mix and process matures, completes design of automated pilot line to include mixing, dispensing, and drying of MIC green primers, and begins building pilot line process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will support complete optimization of 5.56mm, 7.62mm, and .50 cal primer mix, test multiple 7.62mm cartridges and remaining 5.56mm cartridges for compatibility as pilot line process matures, begin Energetic Munition Qualification Board (EMQB) processes, complete development of pilot line process, and complete prove-out test plans for pilot line equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modular Handgun Integration"
                                    },
                                    "Description": {
                                        "val": "Support handgun ammunition integration into new Army standard handgun weapon. Maintain compatibility with handgun weapon while improving operational availability."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work supports ammunition integration into new Army standard handgun weapon. Maintain compatibility with legacy handgun weapon while improving operational availability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Close Combat Mission Capability Kit (CCMCK)"
                                    },
                                    "Description": {
                                        "val": "CCMCK is a user installed weapons modification system, which allows the Soldier to employ weapons at a short range for force-on-force training using low velocity marking ammunition while precluding the weapon from firing standard service ammunition. The system provides normal environmental\/weapon employment cues and immediate target feedback through force-on-force, interactive live fire scenario tasks, and mission execution."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.025"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work replaces current primer system in CCMCK with Non-toxic (no lead) primers and execute effort to test solution feasibility of unmet user requirements. Users are regularly exposed to significant toxic metals levels due to repetitive high volume ammunition expenditures during training and experience unmet user requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.025"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.025"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will qualify one solution that will meet non-toxic needs and solve unmet requirements.  Users are regularly exposed to significant toxic metals levels due to repetitive high volume ammunition expenditures during training and experience unmet user requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support Sniper Ammunition Integration Into Army Standard Sniper Weapons"
                                    },
                                    "Description": {
                                        "val": "Modify existing sniper ammunition to support integration into new Army standard sniper weapons. Maintain compatibility with legacy sniper weapons while improving operational availability."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work supports ammunition integration into new Army standard sniper weapons, and maintains compatibility with legacy sniper weapons while improving operational availability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will test and evaluate sniper ammunition improvements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support improvements in Direct Fire Propulsion Systems"
                                    },
                                    "Description": {
                                        "val": "Improve Direct Fire Propulsion Systems to increase user survivability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.025"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.025"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will explore additional sources of supply in the National Technology and Industrial Base (NTIB) to reduce the dependence on foreign suppliers and pursue improvements to address temperature sensitivities of energetics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved M789 Lethality, Warhead Fragmentation Improvement"
                                    },
                                    "Description": {
                                        "val": "Improve M789 warhead fragmentation for lethality by utilizing fragmentation sleeves, scoring or other technologies within the warhead to promote more efficient fragmentation."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.550"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work encompasses the production qualification of the improved design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will support Request for Proposal (RFP), Solicitation, Contract Award, and Qualification Build."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "M433 Warhead Improvement"
                                    },
                                    "Description": {
                                        "val": "40mm: Improve lethality (fragmentation) of the M433 grenade."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.629"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work conducts a demonstration of subsystem and system maturity by conducting two integrated system demonstration tests.  Testing will confirm integration maturity and enable improvements in system manufacturing.  Contracting actions will be performed to find a source to manufacture developmental test and evaluation hardware."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.220"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.220"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will conduct Developmental Testing (DT) \/ Pre Production Qualification Test (PPQT) build, following Low Rate Initial Production (LRIP) quantity.  Technology readiness review will be conducted."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Practice Spotter Technology Insertion"
                                    },
                                    "Description": {
                                        "val": "Training Cartridge with impact initiated spotting charge. Goal is visible signature upon impact under all conditions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work supports design qualification."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hazards of Electromagnetic Radiation to Ordnance (HERO)  safe electric primers for 30mmx113mm Ammunition"
                                    },
                                    "Description": {
                                        "val": "30mm x 113mm is used on the Apache (AH64) and Blackhawk (MH60) systems, its primers are not HERO safe.  The primers do not meet the requirements of MIL-STD-464A.  Consequently 30mm x 113mm ammunition cannot be safely handled, including loading the systems, when in high energy electromagnetic environments such as on or near Navy ships.  It also introduces risk to the systems operating in unknown environments because there are approximately 10 exposed cartridges in the feed shoot between the Helicopter Body and the gun.   Effort will address this design shortcoming by  developing and proving out a laser initiated primer which will be a direct replacement of the existing primer.  Performance of the end items will not be affected by this change."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.200"
                                            },
                                            "Text": {
                                                "val": "FY 2017 dollars supports the development of the ignition train (laser plus energetics) and the electronics assemblies.  The design will be demonstrated in a laboratory environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "20mm C-RAM Ammo Improvement"
                                    },
                                    "Description": {
                                        "val": "Improvement of lethality and self-destruct safety \/ reliability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "FY 2017 funding will support demonstration of ammunition across operational temperatures from a fixed mounted burst fire weapon."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "120mm Tank Ammunition Propellant High Temperature Improvement"
                                    },
                                    "Description": {
                                        "val": "Develop improved tank ammunition propellants that can withstand higher temperatures and meet international norms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work supports the study changes and conduct test fixes to determine extent of engineering required."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0605805A Project F21"
                                    },
                                    "Title": {
                                        "val": "Direct Fire Technology and North Atlantic Treaty Organization (NATO) Ammunition Evaluation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.607"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.650"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.650"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.665"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.680"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.675"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "9.277"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "All contracts will be full and open competition firm fixed price."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Manager Maneuver Ammunition Systems (PM MAS) - Labor & Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-MAS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Contract 1 _M433 Warhead Improvement"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Contract 1 - M789 Enhanced Lethality"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Armament Research Development and Engineering Center (ARDEC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.234"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.234"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Naval Surface Warfare Center (NSWC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Naval Surface Warfare Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dahlgren, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.452"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Army Research Lab (ARL)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.452"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "North American Regional Test (NARTC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "North American Regional Test Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rock island, IL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98191-9.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "98191-10.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "New Ammo Design Qualification & NATO Mission Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Lightweight Ammunition"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Small Caliber Ammunition Training Range Impact Reduction Engineering Study"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Metastable Intermolecular Composite (MIC) Primer Lead Free Primer"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modular Handgun Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Close Combat Mission Capability Kit (CCMCK)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Support Sniper Ammunition Integration Into Army Standard Sniper Weapons"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Support improvements in Direct Fire Propulsion Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Improved M789 Lethality, Warhead Fragmentation Improvement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "M433 Warhead Improvement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Target Practice Spotter Technology Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Hazards of Electromagnetic Radiation to Ordnance (HERO)  safe electric primers f"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "20mm C-RAM Ammo Improvement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "120mm Tank Ammunition Propellant High Temperature Improvement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}