{
    "id": "453dce110c9d2892d43023801e05127b4ba7685a",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603673N"
        },
        "ProgramElementTitle": {
            "val": "(U)Future Naval Capabilities Advanced Tech Dev"
        },
        "R1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "257.806"
            },
            "CurrentYear": {
                "val": "265.562"
            },
            "BudgetYearOne": {
                "val": "249.092"
            },
            "BudgetYearOneBase": {
                "val": "249.092"
            },
            "BudgetYearTwo": {
                "val": "259.009"
            },
            "BudgetYearThree": {
                "val": "259.119"
            },
            "BudgetYearFour": {
                "val": "260.541"
            },
            "BudgetYearFive": {
                "val": "270.950"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) address the Advanced Technology Development associated with the Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the Navy's Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are identified by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders. The Enabling Capabilities (ECs) and associated technology product investments of the FNC Program are competitively selected by a 3-star Technology Oversight Group (TOG), chartered by the S&T Corporate Board and representing the requirements, acquisition, research and fleet\/forces communities of the Navy and the Marine Corps."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "260.847"
                },
                "CurrentYear": {
                    "val": "258.860"
                },
                "BudgetYearOne": {
                    "val": "271.498"
                },
                "BudgetYearOneBase": {
                    "val": "271.498"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "257.806"
                },
                "CurrentYear": {
                    "val": "265.562"
                },
                "BudgetYearOne": {
                    "val": "249.092"
                },
                "BudgetYearOneBase": {
                    "val": "249.092"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.041"
                },
                "CurrentYear": {
                    "val": "6.702"
                },
                "BudgetYearOne": {
                    "val": "-22.406"
                },
                "BudgetYearOneBase": {
                    "val": "-22.406"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.298"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "7.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.500"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.541"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-12.692"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.692"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-9.714"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-9.714"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 funding request was reduced by -$5.0 million as required for the Department of the Navy to comply with the Bipartisan Budget Act of 2015. \n\nTechnical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3346"
                    },
                    "ProjectTitle": {
                        "val": "Future Naval Capabilities Adv Tech Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "252.971"
                        },
                        "CurrentYear": {
                            "val": "258.562"
                        },
                        "BudgetYearOne": {
                            "val": "249.092"
                        },
                        "BudgetYearOneBase": {
                            "val": "249.092"
                        },
                        "BudgetYearTwo": {
                            "val": "259.009"
                        },
                        "BudgetYearThree": {
                            "val": "259.119"
                        },
                        "BudgetYearFour": {
                            "val": "260.541"
                        },
                        "BudgetYearFive": {
                            "val": "270.950"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "FNC investments are typically 3-5 years in duration.  They provide a continuance of basic research by maturing technologies from a Technology Readiness Level (TRL) of 3 or 4 to a TRL of 6.  All FNC products require BA2 and BA3 funded technology development, which is coordinated to ensure tangible technology products are delivered upon completion of each investment.  Each year the TOG refreshes the FNC Program by approving new ECs and technology products as older ones get delivered.  After transition to an acquisition program, FNC products are further engineered, integrated and ultimately, delivered to the warfighter. The development and delivery of each FNC product is guided by a Technology Transition Agreement (TTA) that is signed by the requirements and acquisition sponsors, as well as the S&T developer.\n\nThis project supports the naval pillars of Capable Manpower, Enterprise and Platform Enablers, Expeditionary Maneuver Warfare, Force Health Protection, Forcenet, Power and Energy, Sea Basing, Sea Shield and Sea Strike.  Each of these pillars is listed as a separate R-2 Activity.  Under each R-2 Activity, the BA 6.3 accomplishments and plans for every Enabling Capability (EC) and Technology Product in the FNC Program are listed.  ECs are composed of one or more interrelated technology products, so for clarity, each product is shown under its EC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CAPABLE MANPOWER (CMP)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Capable Manpower (CMP) FNC pillar.  The CMP Pillar develops deliverable technologies that provide new capabilities in manpower and personnel management, training and education, and human-systems integration for more intuitive systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.518"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: CMP-FY11-01 NAVAL NEXT-GENERATION IMMERSIVE TECHNOLOGY (N2IT) \n- Complete Augmented Immersive Team Training (AITT) - Develop, integrate, and demonstrate hardware and software for Augmented Reality training for infantry operations.\n- Complete Perceptual Training Systems and Tools (PercepTs) - Design, demonstrate, and evaluate the efficacy of new technologies for perceptual training.\n\nEC: CMP-FY12-01 LIVE, VIRTUAL, & CONSTRUCTIVE TRAINING FIDELITY\n- Continue Cognitive Fidelity Synthetic Environment - Design and develop virtual simulations that elicit the appropriate perceptual-cognitive responses for Naval aviation training.\n- Continue Tactics & Speech Capable Semi-Automated Forces - Demonstrate software that automatically generates doctrinally accurate semi-autonomous forces that are adaptive to training scenario events.\n- Continue Virtual-Constructive Representations on Live Avionics Displays - Test, evaluate, and refine the Live, Virtual, & Constructive (LVC) zymology used during experimentation and validation efforts.\n\nEC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Continue Manpower Planning and Optimization Toolset - Develop total ownership cost measures and analytical techniques to evaluate proposed shipboard manpower and personnel requirements.\n- Continue Platform Design and Acquisition Toolset - Develop a software toolset for evaluation of ship design and manpower configurations. \n\nEC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Continue Dynamic, Adaptive & Modular Training for UAS - Design knowledge structures to support activity learning, scenario requirements to activities links, semi-automated forces envelope generation, cognitive modeling, generative semi-automated forces behaviors and integration with DoN simulation and training systems.\n- Continue Selection for UAS Personnel (SUPer) - Construct unmanned aircraft operator selection and classification test batteries, including underlying data collection instruments within the DoN's APEX framework.\n- Continue UAS Control Station Human Machine Interface - Create Common Control Station information display design specifications that focus on  reducing the information demands placed on unmanned aircraft system operators.\n\nEC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Initiate Decision Making-Learning Management System (DM-LMS) - Define existing Marine Corps measures\/standards of Decision Making (DM) and instructional method guidelines and develop software products to plan, assess, and track decision making skill development.\n- Initiate Digital Integrated Representation of Tactical Environment (DIRTE) - Define existing Marine Corps CONOPS for classroom and sustainment training and develop rapid terrain modeling and sketchpad software products to enable small unit leaders and instructors to create effective decision making environments and scenarios.\n- Initiate Simulation Tailored Training and Assessment (ST2A) - Define existing Marine Corps situated tutor techniques and unobtrusive monitoring techniques and develop software and hardware prototypes to execute decision making program of instruction and scenarios in simulation.\n\nEC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\n- Initiate Environment Designed to Undertake Counter A2AD Tactics Training & Experimentation (EDUCAT2E) - Investigate and develop an approach to an objective, metrics-driven training and experimentation capability for Fast Attack Craft and Mine Warfare threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.451"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: CMP-FY12-01 LIVE, VIRTUAL, & CONSTRUCTIVE TRAINING FIDELITY\n- Complete Cognitive Fidelity Synthetic Environment - Design and develop virtual simulations that elicit the appropriate perceptual-cognitive responses for Naval aviation training.\n- Complete Tactics & Speech Capable Semi-Automated Forces - Demonstrate software that automatically generates doctrinally accurate semi-autonomous forces that are adaptive to training scenario events.\n- Complete Virtual-Constructive Representations on Live Avionics Displays - Test, evaluate, and refine the Live, Virtual, & Constructive (LVC) symbology used during experimentation and validation efforts.\n\nEC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Continue Manpower Planning and Optimization Toolset - Demonstrate software that assesses the risks and capabilities of varying levels of manpower authorizations to operate a specific platform design during various mission scenarios.\n- Continue Platform Design  and Acquisition Toolset - Demonstrate software that assesses the trade space and cost commitments of different platform designs and manning compliments. \n\nEC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Continue Dynamic, Adaptive & Modular Training for UAS - Design knowledge structures for integration with DoN simulation and training systems.\n- Continue Selection for UAS Personnel  (SUPer) - Construct unmanned aircraft operator selection and classification test batteries, including underlying data collection instruments within the DoN's APEX framework.\n- Continue UAS Control Station Human Machine Interface - Create Common Control Station information display design specifications that focus on supervisory control and the reduction of the information demands placed on unmanned aircraft system operators.\n\nEC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Continue Decision Making-Learning Management System (DM-LMS) - Define existing Marine Corps measures and standards of decision making and instructional method guidelines, and develop software products to plan, assess, and track decision making skill development.\n- Continue Digital Integrated Representation of Tactical Environment (DIRTE) - Define existing Marine Corps CONOPS for classroom and sustainment training and develop rapid terrain modeling and sketchpad software products that enable small unit leaders and instructors to create effective decision making environments and scenarios.\n- Continue Simulation Tailored Training and Assessment (ST2A) - Define existing Marine Corps situated tutor techniques and unobtrusive monitoring techniques, and develop software and hardware prototypes to execute decision making programs of instruction and scenarios in simulation.\n\nEC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\n- Continue Environment Designed to Undertake Counter A2AD Tactics Training & Experimentation (EDUCAT2E) - Develop threat response software models to support an objective, metrics-driven training and experimentation capability for Fast Attack Craft and Mine Warfare threats.\n\nEC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Initiate Operational Planning Tool - Demonstrate software to facilitate the planning cycle structure used by Navy command and control planners to prepare mission plans that range from the Maritime Operations Centers down to maritime tactical units."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.195"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.195"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Continue Manpower Planning and Optimization Toolset - Develop software that produces a feasible set of shipboard event timelines, workload packages, and skills for each billet created for a given ship and system design.\n- Complete Platform Design and Acquisition Toolset - Demonstrate software to simulate the design and manpower interactions that are used to determine the trade spaces and cost commitments required for a given platform design and manning compliment.\n\nEC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Continue UAS Control Station Human Machine Interface - Deliver Human Machine Interface Prototype Software for supervisory control of unmanned systems to the submarine combat system.\n- Complete Selection for UAS Personnel (SUPer) - Develop and demonstrate unmanned aircraft operator selection and classification test batteries.\n- Complete Dynamic, Adaptive & Modular Training for UAS - Develop and demonstrate automated scenarios and clutter entity behaviors in the Navy's common training system technology for the Next Generation Threat System.\n\nEC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Continue Digital Integrated Representation of Tactical Environment (DIRTE) - Define Enterprise level Application Programming Interface (API) requirements to create Virtual Battlespace 2 (VBS2) terrain from government supplied source data (e.g., National Geospatial-Intelligence Agency products such as Digital Terrain Elevation Data and Digital Feature Analysis Data).\n- Continue Simulation Tailored Training and Assessment (ST2A) - Develop software and hardware prototypes to execute decision making programs of instructional scenarios in simulation.\n- Continue Decision Making-Learning Management System (DM-LMS) - Develop a Marine Corps Training Information Management System (MCTIMS) software prototype to provide repository and trend analysis of performance data to inform training readiness assessments, including the performance and development of individual Marines, small unit leaders, and small units over time.\n\nEC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\t\n- Continue Environment Designed to Undertake Counter A2AD Tactics Training & Experimentation (EDUCAT2E) - Demonstrate simulated Electromagnetic Environmental Effects on Fleet training and operational systems in a networked Live, Virtual, and Constructive environment in a distributed scenario-driven Fleet Synthetic Training event.\n\nEC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Continue Operational Planning Tool - Develop software to assist Carrier Strike Group staffs that support comprehensive\/collaborative planning through the use of decision support services, analytic tools, and common displays that assist planners during the creation of navigation and tactical plans.\n\nEC: CMP-FY17-01 MANPOWER, PERSONNEL & TRAINING STRATEGIC PLANNING APPLICATION\n- Initiate Manpower, Personnel & Training Planning Application - Develop decision support software to capture key interconnections, time delays and feedbacks between Manpower, Personnel, and Training stakeholders that serves as a common set of assumptions and boundaries for decision analyses.\n\nEC: CMP-FY17-02 FUTURE INTEGRATED TRAINING ENVIRONMENT (FITE)\n- Initiate Future Integrated Training Environment (FITE) - Develop technologies and techniques to integrate Marine Corps simulations to support Live, Virtual, and Constructive training events."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENTERPRISE AND PLATFORM ENABLERS (EPE)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Enterprise and Platform Enablers (EPE) FNC pillar.  The EPE Pillar develops cross-cutting, deliverable technologies that provide new capabilities for naval service platforms that lower acquisition, operations and maintenance costs, improve system safety and availability, and improve platform survivability.  \n\nThe FY 2015 to FY 2016 increase was due primarily due to an increase in work required to complete EPE-FY12-02, the planned ramp-up of EPE-FY15-02 and EPE-FY15-03.\n\nThe FY 2016 to FY 2017 decrease was due primarily to the completion of EPE-FY10-01, EPE-FY12-01 and EPE-FY12-02, and the planned ramp-down of EPE-FY09-07 and EPE-FY11-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.624"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  EPE-FY09-01 Affordable Common Radar Architecture\n- Complete Affordable Common Radar Architecture - Develop, fabricate, integrate and test a low cost surface radar replacement system.\n\nEC: EPE-FY09-07 AFFORDABLE SUBMARINE PROPULSION AND CONTROL ACTUATION\n- Continue Advanced Material Propeller - Assess blade\/hub joint strength, perform blade fatigue and deflection testing, and static and dynamic testing of the complex hub unit.\n\nEC: EPE-FY10-01:  ADVANCED SHIPBOARD WATER DESALINATION\n- Continue Advanced Navy Reverse Osmosis System - 100K GPD (Formerly a compent technology of Advanced Navy Reverse Osmosis System) - Develop and test a 100K Gallons Per Day (GPD) robust reverse osmosis based water purification system for ship platforms.\n- Continue Advanced Navy Reverse Osmosis System - 4K GPD (Formerly a compent technology of Advanced Navy Reverse Osmosis System) - Develop and test a 4,000 Gallons Per Day (GPD) robust reverse osmosis based water purification system.\n\nEC: EPE-FY10-02 AFFORDABLE MODULAR PANORAMIC PHOTONICS MAST\n- Complete Modular Photonics Mast Housing - Resolve final testing issues and transition the Modular Photonics Mast Housing for submarines.\n\nEC: EPE-FY10-03 CORROSION AND CORROSION RELATED SIGNATURE TECHNOLOGIES FOR INCREASED OPERATIONAL AVAILABILITY\n- Complete Advanced-Robust ICCP Anodes and Reference Cells - Complete reference cell performance down select.\n\nEC:  EPE-FY11-01 FLIGHT DECK THERMAL MANAGEMENT \n- Continue Integrated Thermal Management System Design - Test scale panels in a relevant environment and determine integration issues.  \n\nEC: EPE-FY12-01 CORROSION MITIGATION TECHNOLOGIES\n- Continue Corrosion Resistant Surface Treatment - Complete development of single step coating product.\n- Continue Sprayable Acoustic Damping Systems - Develop product and complete corrosion testing of prototype Sprayable Acoustic Damping system.\n\nEC: EPE-FY12-02 INTEGRATED HYBRID STRUCTURAL MANAGEMENT SYSTEM (IHSMS)\n- Continue IHSMS Fleet Structural Health Management Decision Tool (formerly known as Distributed Structural Micro-Sensor Nodes and Rotor Hot Spot Sensors and Integration) - Develop wireless energy harvesting sensors for rotorcraft structural health management, and evaluate and optimize rotor-hot spot sensors and integration technologies that allow improved health assessment of rotating frame and selected structural hot spots.\n\nEC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Continue Tools for Predicting Array Operational Loading & Distribution - Collect lab and at-sea data to validate fully coupled  predictive models for hydrodynamic effects on a towed array.\n\nEC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Advance testing for variable coating formulas and evaluate properties.\n- Continue Aluminum Alloy Corrosion Prediction Tool - Develop algorithm for 5000 series aluminum alloy degree of sensitization and for prediction of Mean Time to Repair.\n\nEC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Initiate Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Conduct Navy gas turbine hot corrosion analysis and experimentation under shipboard environmental conditions and power scales.\n\nEC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Develop new test methods needed to evaluate new materials mitigation technology for submarines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.668"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EPE-FY09-07 AFFORDABLE SUBMARINE PROPULSION AND CONTROL ACTUATION\n- Continue Advanced Material Propeller - Develop Full Scale Test Plan for the Collins Class Submarine.\n\nEC: EPE-FY10-01: ADVANCED SHIPBOARD WATER DESALINATION\n- Complete Advanced Navy Reverse Osmosis System - 100K GPD - Demonstrate and test a 100K Gallons Per Day (GPD) robust reverse osmosis based water purification system on ship platforms.\n- Complete Advanced Navy Reverse Osmosis System - 4K GPD - Demonstrate and test a 4,000 Gallons Per Day (GPD) robust reverse osmosis based water purification system.\n\nEC: EPE-FY11-01 FLIGHT DECK THERMAL MANAGEMENT\n- Continue Integrated Thermal Management System Design - Finalize testing of a scale model and begin integrating the panels to a ship deck for the final demonstration.\n\nEC: EPE-FY12-01 CORROSION MITIGATION TECHNOLOGIES\n- Complete Corrosion Resistant Surface Treatment - Deliver impellers treated with Corrosion Resistant Surface Treatment to PMS-505 for installation on LCS.\n- Complete Sprayable Acoustic Damping Systems - Demonstrate and integrate spray applied damping systems for improved structural vibration control, total ownership cost reduction, improved platform performance, and reduced detectability.\n\nEC: EPE-FY12-02 INTEGRATED HYBRID STRUCTURAL MANAGEMENT SYSTEM (IHSMS)\n- Complete IHSMS Fleet Structural Health Management Decision Tool - Integrate structural health monitoring system into demonstration article, demonstrate structural health monitoring rotor hot-spot sensors and integration technologies, and evaluate system performance.\n\nEC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Continue Tools for Predicting Array Operational Loading & Distribution - Develop a design for a highly instrumented towed array to be used in validating the predictive model of the forces operating on a towed array.\n\nEC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Conduct test and evaluation of prototype surface treatment and repair tools to enable aluminum alloy sensitization repair\/desensitization technologies.\n- Continue Aluminum Alloy Corrosion Prediction Tool - Integrate a detection tool with sensitization prediction software as a singular tool with both detection and predictive capabilities to provide the time to repair aluminum ship structures.\n\nEC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Demonstrate, test, and down select advanced coating and alloy combinations that are suitable for higher temperature capable gas turbine operation.\n\nEC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Develop new test methods for materials being developed under the program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.178"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.178"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EPE-FY09-07 AFFORDABLE SUBMARINE PROPULSION AND CONTROL ACTUATION\n- Complete Advanced Material Propeller - Conduct Full Scale Testing on a Collins Class Submarine.\n\nEC: EPE-FY11-01 FLIGHT DECK THERMAL MANAGEMENT\n- Complete Integrated Thermal Management System Design - Demonstrate feasibility of flight deck thermal management system during at-sea test.\n\nEC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Continue Tools for Predicting Array Operational Loading & Distribution - Fabricate and use the previously designed highly instrumented towed array to validate the predictive model of the forces operating on a towed array.\n\nEC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Assess the effectiveness of the developed surface treatment and repair tools for desensitizing and repairing sensitized aluminum.\n- Continue Aluminum Alloy Corrosion Prediction Tool - Integrate the Degree of Sensitization (DoS) prediction algorithm software into the DoS detection tool.\n\nEC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Demonstrate, test, and down-select advanced coatings and alloy combinations that are suitable for higher temperature marine gas turbine engine service in the marine environment.\n\nEC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Construct new test methods for the materials being developed.\n\nEC: EPE-FY16-01 ADVANCED TOPCOAT SYSTEM (ATS)\n- Initiate Advanced Topcoat Systems for Air Vehicle (ATS-AV) - Perform initial laboratory verification and qualification studies on modified primer and topcoat chemistries, including chemical analysis and material interaction compatibility verification."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EXPEDITIONARY MANEUVER WARFARE (EMW)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains the Navy funded Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Expeditionary Maneuver Warfare (EMW) FNC Pillar.  The EMW Pillar develops deliverable technologies that provide new capabilities in expeditionary maneuver warfare, including naval ground forces, with special emphasis on regular and irregular warfare in urban environments and combating terrorism. \n\nThe FY 2015 to FY 2016 increase was due primarily to the initiation of EMW-FY16-01.\n\nThe FY 2016 to FY 2017 decrease was due to the planned ramp down of EMW-FY12-02 and the continuation of EMW-FY12-03, EMW-FY14-01 and EMW-FY16-01 in PE 0603640M."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.363"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EMW-FY12-02 FUTURE JOINT COUNTER RADIO-CONTROLLED IED ELECTRONIC WARFARE (JCREW)\n- Continue Distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (D-JCREW) - Implement distributed RF EW sensing and networked jamming techniques with multi-system tasking allocation in RF hardware for field testing during Marine Corp Training\n- Continue Integrated Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (I-JCREW) - Integrate new detection and countermeasure techniques with JCREW hardware for testing of enhanced, single platform effectiveness.\n\nEC:  EMW-FY13-01 AZIMUTH AND INERTIAL MICRO-ELECTRO-MECHANICAL SYSTEM (MEMS) NAVIGATION SYSTEM\n- Continue Micro-Electro-Mechanical (MEMS) Inertial Navigation System - Design and fabricate a full Navigation System for hand-held targeting systems that will reduce target location error.\n\nEC: EMW-FY14-01 SPECTRAL AND RECONNAISSANCE IMAGERY FOR TACTICAL EXPLOITATION (SPRITE)\n- Continue Automated Processing for Spectral Exploitation and Dissemination (APSED) - Develop an Electro-Optical (EO) and Hyper-Spectral Imagery (HSI) image processing architecture that includes EO-to-HSI cross-correlation and fusion, image archiving and retrieval, and exploitation product generation.\n- Continue Compact Wide Area Reconnaissance and Spectral Sensor (CWARSS) - Develop hardware for a wide-area intelligence, surveillance and reconnaissance capability with simultaneous high spatial and spectral resolution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.392"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EMW-FY12-02 FUTURE JOINT COUNTER RADIO-CONTROLLED IED ELECTRONIC WARFARE (JCREW)\n- Continue Distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (D-JCREW) - Using realistic scenarios, demonstrate tactical-level distributed jamming on multiple ground-based Electronic Warfare systems.\n- Continue Integrated Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (I-JCREW) - Employing realistic scenarios, demonstrate the simultaneous reception and transmission of Electronic Warfare and blue-force communication waveforms.\n\nEC: EMW-FY12-03 WIDE AREA SURGICAL AND PERSISTENT SURVEILLANCE (WASPS) CAPABILITIES FOR TIER 2\/3 UAVs\n- Complete Tactical Nighttime Wide Area Surveillance, initiated in PE 0603640M - Conduct final demonstration and complete transition.\n\nEC:  EMW-FY13-01 AZIMUTH AND INERTIAL MICRO-ELECTRO-MECHANICAL SYSTEM (MEMS) NAVIGATION SYSTEM\n- Complete Micro-Electro-Mechanical (MEMS) Inertial Navigation System - Test and demonstrate a full Navigation System for hand-held targeting systems. \n\nEC: EMW-FY14-01 SPECTRAL AND RECONNAISSANCE IMAGERY FOR TACTICAL EXPLOITATION (SPRITE)\n- Complete Automated Processing for Spectral Exploitation and Dissemination (APSED) - Demonstrate an Electro-Optical (EO) and Hyper-Spectral Imagery (HSI) Image Processing architecture that includes EO to HSI cross-correlation and fusion, image archiving and retrieval, and exploitation product generation.\n- Complete Compact Wide Area Reconnaissance and Spectral Sensor (CWARSS) - Demonstrate parts of the baseline design for a multi-model wide area sensor compatible with a small space, weight and power baseline.\n\nEC: EMW-FY16-01 DENSIFIED PROPELLANT FIRE FROM ENCLOSURE - CONFINED SPACE (FFE\/CS) PROPULSION TECHNOLOGIES\n- Initiate Densified Propellant Fire From Enclosure - Confined Space (FFE\/CS) Propulsion Technologies - Integrate rocket motor igniters with micro-electromechanical system ignition safety devices and multi-stage igniter plug designs to achieve warhead launch parameters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EMW-FY12-02 FUTURE JOINT COUNTER RADIO-CONTROLLED IED ELECTRONIC WARFARE (JCREW)\n- Complete Distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (D-JCREW) - Demonstrate tactical-level distributed jamming on multiple ground-based Electronic Warfare (EW) systems using realistic scenarios.\n- Complete Integrated Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (I-JCREW) - Demonstrate the simultaneous reception and transmission of Electronic Warfare (EW) and blue-force communication waveforms using realistic scenarios.\n\nEC: EMW-FY16-01 DENSIFIED PROPELLANT FIRE FROM ENCLOSURE - CONFINED SPACE (FFE\/CS)\nPROPULSION TECHNOLOGIES\n- Continued in PE 0603640M\n\nEC: EMW-FY17-01 HIGH RELIABILITY DPICM REPLACEMENT (HRDR)\n- Initiate High Reliability DPICM Replacement - Demonstrate with the 155mm M777A2 gun launch through modeling and simulation that High Reliability Dual-purpose Improved Conventional Munitions hardware will survive setback and gun balloting forces in order to activate the on-board power supply and initialize the arming sequence."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE HEALTH PROTECTION (FHP)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Force Health Protection (FHP) FNC pillar.  The FHP Pillar develops deliverable technologies that provide new capabilities that provide Sailors and Marines with the best possible protection from operational threats by reducing morbidity and mortality when casualties occur.\n\nThe FY 2015 to FY 2016 increase was due primarily to the planned ramp-up of FHP-FY13-03, FHP-FY14-01 and FHP-FY14-03.\n\nThe FY 2016 to FY 2017 decrease was due primarily to the completion of FHP-FY11-01 and the planned ramp down of FHP-FY12-02, FHP-FY13-03 and FYP-FY14-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.946"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FHP-FY11-01 MULTIFUNCTIONAL BLOOD SUBSTITUTE (MFBS)\n- Continue Multifunctional Blood Substitute (MFBS) - Formulate a resuscitation fluid that provides volume expansion and improves clotting in hemorrhaging combat casualties.\n\t\nEC: FHP-FY12-01 AUTOMATED CRITICAL CARE SYSTEM \n- Continue Automated Critical Care System (ACCS) - Develop autonomous hardware and software system to monitor and maintain combat causalities with minimal human intervention during a 2-6 hour Casualty Evacuation (CASEVAC) scenario.\n\nEC: FHP-FY12-02 SAVING LIVES WITH EMERGENCY MEDICAL PERFLUOROCARBONS IN THE FIELD (SEMPER FI) FOR SEA, AIR & LAND DYSOXIA\n- Continue SEMPer Fi for Air Dysoxia - Research candidate drugs based on small and large animal testing for treatment of pulmonary hypertension.\n- Continue SEMPer Fi for Land Blast Kit -Perform small and large animal testing to validate therapeutic intervention and dosing with hypothermia for immediate treatment of blast overpressure in small and large animals, including injury to the brain and\/or internal organs.\n\nEC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH \n- Continue Hypoxia Alert and Mitigation System - Utilize algorithms and early stage hardware prototypes to detect\/predict onset of hypoxia or hypoxia-like symptoms for mountain operators, casualties, and aviators.\n\nEC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Continue Acute Care Cover for Severely Injured Limbs (ACCSIL) - Begin early stage integration for fieldable wound cover to include novel outer cover materials and internal pharmaceutical coating that improve the clinical outcome of severe wounds.\n\nEC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Continue Algorithm - Develop large animal injury profiles to  design test parameters for an algorithm that integrates blast intensity data with cognitive impairment data to predict likelihood of brain injury after a given blast event.\n- Continue Neuro-Functional Assessment Tool - Integrate and test computer control interface subsystem for a non-psychometric device that detects and estimates severity of traumatic brain injury.\n- Continue Sensor - Develop preliminary hardware design of blast sensors that detects and quantifies acceleration, pressure, and impulse from a given blast event and outputs the data electronically."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.797"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FHP-FY11-01 MULTIFUNCTIONAL BLOOD SUBSTITUTE (MFBS)\n- Complete Multifunctional Blood Substitute (MFBS) - Formulate a resuscitation fluid that provides volume expansion and improves clotting in hemorrhaging combat casualties.\n\nEC: FHP-FY12-01 AUTOMATED CRITICAL CARE SYSTEM \n- Continue Automated Critical Care System (ACCS) - Integrate down-selected hardware with an autonomous software system to monitor and maintain combat causalities with minimal human intervention during a 2-6 hour Casualty Evacuation scenario.\n\nEC: FHP-FY12-02 SAVING LIVES WITH EMERGENCY MEDICAL PERFLUOROCARBONS IN THE FIELD (SEMPER FI) FOR SEA, AIR & LAND DYSOXIA\n-Continue SEMPer Fi for Air Dysoxia - Perform down-select of candidate drugs based on small and large animal testing for treatment of pulmonary hypertension.\n- Continue SEMPer Fi for Land Blast Kit - Demonstrate an optimal treatment application and overall duration of therapeutic hypothermia for immediate treatment of blast overpressure in small and large animals, including injury to the brain and\/or internal organs.\n\nEC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH \n- Continue Hypoxia Alert and Mitigation System - Execute laboratory testing to optimize hypoxia-detection algorithms intended for use in high altitude operations. \n\nEC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Continue Acute Care Cover for Severely Injured Limbs (ACCSIL) - Integrate outer cover materials and an internal pharmaceutical coating into a single system to improve the clinical outcome of severe wounds on the battlefield.\n\nEC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Continue Algorithm - Refine developmental algorithms using experimental data to integrate blast intensity data with cognitive impairment data to predict the likelihood of brain injury after single or multiple blast exposures.\n- Continue Neuro-Functional Assessment Tool - Identify and refine a non-psychometric device that detects and estimates the severity of traumatic brain injury.\n- Continue Sensor - Conduct optimization and testing of a self-powered blast sensor that detects and quantifies acceleration, pressure and impulse from a given blast event."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FHP-FY12-01 AUTOMATED CRITICAL CARE SYSTEM\n- Complete Automated Critical Care System (ACCS) - Complete integration of software algorithms and hardware, and perform FDA tests\/trials as required.  \n\nEC: FHP-FY12-02 SAVING LIVES WITH EMERGENCY MEDICAL PERFLUOROCARBONS IN THE FIELD (SEMPER FI) FOR SEA, AIR & LAND DYSOXIA\n- Complete SEMPer Fi for Air Dysoxia - Finish down-select of candidate drugs based on small and large animal testing for treatment of pulmonary hypertension.\n- Complete SEMPer Fi for Land Blast Kit - Conduct final demonstration of an optimal treatment application and overall duration of therapeutic hypothermia for immediate treatment of blast overpressure in small and large animals, including injury to the brain and\/or internal organs.\n\nEC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH\n- Complete Hypoxia Alert and Mitigation System - Adapt hypoxia alert system hardware\/software to guide treatment of casualties in order to sustain performance during high-altitude mountain operations.\n\nEC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Continue Acute Care Cover for Severely Injured Limbs (ACCSIL) - Integrate the bioactive coating and external conformal cover, conclude pre-clinical studies, and prepare for initiation clinical studies.  \n\nEC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Continue Blast Load Assessment: Sense and Test (BLAST) (formerly sensor, algorithm, and neurofunctional assessment tool) - Formulate algorithms to guide medical evaluation decisions after exposure to potential traumatic brain injuries and provide scientific evidence for the development of safe blast exposure limits, enhance the neuro-functional assessment tool to discriminate between traumatic brain injury and other operational impacts, and integrate blast force data from the sensor into the predictive traumatic brain injury algorithm.\n\nEC: FHP-FY16-01 INCAPACITATION PREDICTION FOR READINESS IN EXPEDITIONARY DOMAINS - AN INTEGRATED COMPUTATIONAL TOOL (I-PREDICT)\n- Initiate I-PREDICT - Incorporate the high strain rate characteristics of human tissues to allow accurate prediction of military type injuries."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCENET (FNT)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Forcenet (FNT) FNC Pillar.  The FNT pillar develops deliverable technologies that provide new capabilities in Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR), networking, navigation, sensors, decision support, cyber-space, intelligence, and space technologies that will provide the architectural framework for naval warfare in the information age.\n\nThe FY 2016 to FY 2017 increase was due primarily to the ramp up of FNT-FY14-02, FNT-FY15-01, FNT-FY15-02 and FNT-FY16-02, and the initiation of FNT-FY17-01, FNT-FY17-02 and FNT-FY17-04."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "53.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  FNT-FY10-02 ACTIONABLE INTELLIGENCE ENABLED BY PERSISTENT SURVEILLANCE\n- Complete Autonomous Unmanned Aerial Vehicle (UAV) Collision Avoidance System - Demonstrate autonomous collision avoidance system performance for all classes of aircraft or Unmanned Aerial Vehicles (UAV) in the National Airspace System (NAS).\n- Complete Ultra Wide Field of View (FOV) Area Surveillance System - Finish integration of flight-test optical hardware and image processing software into a prototype payload assembly. \n\nEC:  FNT-FY10-03 SATELLITE COMMUNICATIONS (SATCOM) VULNERABILITY MITIGATION\n- Complete Multi-Link Common Data Link (CDL) System - Complete system integration and demonstration of a Multi-Link Common Data Link (CDL) System.\n\nEC: FNT-FY11-01 PRO-ACTIVE COMPUTER NETWORK DEFENSE AND INFORMATION ASSURANCE\n- Complete Pro-Active Computer Network Defense and Information Assurance (formerly known as Common Operational Security Decision System, Next Generation Security and Security Management Protocol, and Next Generation Sensors and Gateways) - Developed the Sensor anomaly detection algorithms and completed integration of the internal communication policy and messaging management modules for the COSDS, Gateway and the Sensors.  Completed the Course-of-Action User Interface controls for the COSDS and integrated the topolgy data and IP fetching cabilities into the COSDS visualization mechanism.  \n\nEC: FNT-FY11-05 NRL SPACE\n- Complete Multi-INT Tracking - Develop real-time fusion algorithms and visualization techniques to detect, track and visualize current and historical maritime vessel track data.\n- Complete Tagging - Develop real-time fusion algorithms and visualization techniques to detect, track and visualize current and historical maritime vessel track data.\n\nEC: FNT-FY12-01 ADVANCED TACTICAL DATA LINK (ATDL)\n- Continue Mission-Based Waveform Controls & Networking - Integrate completed waveforms into host terminal having NSA certification for field testing demonstration.\n\nEC: FNT-FY12-02 AUTONOMOUS PERSISTENT TACTICAL SURVEILLANCE\n- Continue Autonomous Information-Based Surveillance Control - Integrate and test information based algorithms for UAV routing and patching.\n- Continue Contextual Enterprise Information - Adapt the analytical services framework and continue development of real-time enterprise exploitation algorithms for transition and participation in Cloud LTE \n- Continue Mobile Autonomous ISR to C2 Synchronization - Develop enterprise distributed software and begin work on a generalized solution.\n\nEC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE \n- Continue EW Battle Management (EWBM) - Integrate distributed EW communication and coordination techniques with operational Naval Command and Control and Combat Systems used on surface platforms. \n\nEC: FNT-FY13-03 SILK THREAD\n- Continue Product 1 - Conduct Advanced Technology Development.\n- Continue Product 2 - Conduct Advanced Technology Development.\n\nEC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Continue Adaptive Multi-Int Correlation & Identification (AMICA) - Develop, test and modify algorithms to enable cross-domain information fusion and optimize use of remote sensing assets.\n- Continue Detection & Classification Algorithms (DCA) - Develop, test and modify algorithms to provide enhanced detection and classification metrics and robust performance under stressing environmental conditions.\n\nEC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Continue Adaptive TCPED for ASW Services - Integrate new methods and demonstrate via simulation performance in limited bandwidth environments.\n- Continue Data Exfiltration and Networked Platform Interaction - Integrate components and evaluate performance in a size, weight and power package consistent with a sonobuoy.\n\nEC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Initiate Advanced AEW Electronic Protection - Integrate and test E2-D electronic protection techniques.\n\nEC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Initiate Naval Tactical Cloud Analytics (formerly know as ASW Naval Tactical Cloud, EXW Naval Tactical Cloud and IAMD Naval Tactical Cloud) - Develop, integrate and validate, through Limited Technology Experiments , enhanced ASW, Expeditionary Warfare (EXW) and IAMD situational awareness, decision support analytics, and widgets through mission focused exploitation of all relevant cross-domain data within the Naval Tactical Cloud.\n\nEC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Initiate Compact, Scalable Integrated RF (Compact-SIRF) - Integrate new techniques for data conversion and distribution in low size, weight and power analog RF and digital hardware within compact system design.\n- Initiate Electronic Warfare Tactical Decision Aid (EW-TACAID) - Integrate an intuitive EW display with an onboard integrated adaptive high fidelity training capability to improve the warfighters' ability to manage increasingly complex RF environments.\n- Initiate Scalable Integrated RF for Submarines (SIRF-Sub) - Integrate new techniques for data conversion and distribution with RF and digital hardware components for insertion into the next generation submarine EW system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "51.657"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FNT-FY12-01 ADVANCED TACTICAL DATA LINK (ATDL)\n- Complete Mission-Based Waveform Controls & Networking - Port baseline waveform and Anti-Access\/Area Denial enhancements to reference implementation hardware for field testing and demonstration.\n\nEC: FNT-FY12-02 AUTONOMOUS PERSISTENT TACTICAL SURVEILLANCE\n- Complete Autonomous Information-Based Surveillance Control - Complete integration and testing of information based algorithms for Unmanned Aerial Vehicle (UAV) routing and pathing.\n- Complete Contextual Enterprise Information - Adapt the analytical services framework and finalize development of real-time enterprise exploitation algorithms for transition and participation in cloud-oriented limited technology experiments.\n- Complete Mobile Autonomous ISR to C2 Synchronization - Transition to MARCORSYSCOM a service that can track mission task readiness as a function of addressed information fulfillments and unaddressed information deficits.  \n\nEC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE \n- Continue EW Battle Management (EWBM) - Integrate interactive Electronic Warfare displays and alternate communications methods into Navy surface ship combat systems and command and control doctrine.\n\nEC: FNT-FY13-03 SILK THREAD\n- Continue Silk Thread Product 1 - Conduct advanced technology development.\n- Continue Silk Thread Product 2 - Conduct advanced technology development.\n\nEC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Continue Adaptive Multi-Int Correlation & Identification (AMICA) - Develop, test and modify algorithms to enable cross-domain information fusion and optimize use of remote sensing assets.\n- Continue Detection & Classification Algorithms (DCA) - Develop, test and modify algorithms to provide enhanced detection and classification metrics and robust performance under stressing environmental conditions.\n\nEC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Continue Adaptive TCPED for ASW Services - Integrate new methods and demonstrate their performance via simulation in limited bandwidth environments.\n- Continue Data Exfiltration and Networked Platform Interaction - Integrate components with selected waveforms and evaluate communication performance in packages consistent with the size, weight and power constraints of sonobuoys and unmanned underwater vehicles.\n\nEC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Conduct integration and testing of E-2D Advanced Hawkeye electronic protection techniques.\n\nEC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud (formerly called Naval Tactical Cloud Analytics) - Develop, integrate and validate through Limited Technology Experiments, enhanced ASW, IAMD and EXW  situational awareness, decision support analytics and planning algorithms and widgets through mission focused exploitation of all relevant cross-domain data within the Naval Tactical Cloud.  \n\nEC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Demonstrate in the laboratory an initial modular Radio Frequency functionality for Size, Weight and Power (SWaP) restricted platforms.\n- Continue Electronic Warfare Tactical Decision Aid (EW-TACAID) - Demonstrate an Electronic Warfare display with an onboard, integrated, and adaptive high fidelity training capability to improve the warfighters' ability to manage increasingly complex Radio Frequency environments.\n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Demonstrate in the laboratory initial techniques for high speed data conversion and multi-function Radio Frequency processing.\n\nEC: FNT-FY16-01 BUGLE\n- Initiate Bugle - Develop and test algorithms for integration into communication systems.\n\nEC: FNT-FY16-02 COMBINED EO\/IR SURVEILLANCE AND RESPONSE SYSTEM (CESARS)\n- Initiate Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Develop and test an integrated, multiband laser and sensor architecture that is scalable and modular. \n- Initiate Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Develop and test an open architecture design for a panoramic, staring, imaging system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "59.633"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "59.633"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE\n- Continue EW Battle Management (EWBM) - Integrate Blue and Red force monitoring in Electronic Warfare (EW) planning and execution, and Navy communication and control doctrine.\n\nEC: FNT-FY13-03 SILK THREAD\n- Continue Silk Thread Product 1 - Conduct advanced technology development.\n- Continue Silk Thread Product 2 - Conduct advanced technology development.\n\nEC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Complete Adaptive Multi-Int Correlation & Identification (AMICA) - Develop, test and modify algorithms to enable cross-domain information fusion and optimization of theater and tactical battlespace assets to conduct anti-surface warfare.\n- Complete Detection & Classification Algorithms (DCA) - Develop, test and modify algorithms to provide enhanced detection and classification metrics and robust performance under stressing environmental conditions.\n\nEC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Continue Adaptive TCPED for ASW Services - Develop algorithms and software to assure network connectivity for low latency data sharing and autonomous and adaptive Command and Control (C2) services for coordination of data collection and sharing.\n- Continue Data Exfiltration and Networked Platform Interaction - Demonstrate and assess the performance of the radio components and waveforms in the host platform in simulated environments.\n\nEC: FNT-FY14-03 EXCHANGE OF ACTIONABLE INFORMATION AT THE TACTICAL EDGE (EAITE)\n- Continue from PE 0603640M Actionable Information Tactical Applications from PE 0603640M - Develop algorithms to assess the content of a machine produced product to a reference Information Requirement (IR) ontology.\n\nEC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Implement techniques to improve Advanced Hawkeye E2-D electronic protection capability.\n\nEC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud - Test and evaluate new analytic services based on multi-source correlation (Environment, Combat Systems, C2, ISR, EW, Cyber and national\/offboard ISR) using property graphs, applying probabilistic analytic models for improved target detection and for historical and predictive analytics supporting ASW, IAMD and EXW amphibious missions.\n\nEC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Demonstrate the ability to simultaneously run and change in real time different Electronic Warfare\/Electronic INTelligence (EW\/ELINT) processing capabilities on the same modular hardware.\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Demonstrate in the laboratory an initial modular Broadband Radio Frequency (RF) front end coupled to a small Intelligence, Surveillance, and Reconnaissance (ISR) collection payload.\n- Continue Electronic Warfare Tactical Decision Aid (EW-TACAID) - Develop an intuitive Electronic Warfare display with an onboard integrated adaptive training capability to improve the ability of Electronic Support Measures to manage increasingly complex Radio Frequency environments.\n\nEC: FNT-FY16-01 BUGLE\n- Continue Bugle - Develop and test algorithms for integration into communication systems.\n\nEC: FNT-FY16-02 Combined EO\/IR Surveillance and Response System (CESARS)\n- Continue Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Begin fabrication of staring, panoramic situational awareness sensors.\n- Continue Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Begin fabrication of the high resolution sensor.\n\nEC: FNT-FY17-01 COMMUNICATIONS AND INTEROPERABILITY FOR INTEGRATED FIRES (CIIF)\n- Initiate Communications as a Service (CaaS) - Develop, emulate and prototype multi-commodity flow optimization techniques and routing\/bridging between Internet Protocol (IP) and non-IP networks with end-to-end Quality of Service (QoS).\n- Initiate Mission-based Networking for DDS (MiND) - Develop power-control, medium-access control and network topology\/routing to enhance bandwidth and scalability, while creating a new Internet Protocol (IP) interface and maintaining interoperability with legacy Cooperative Engagement Capability (CEC) systems.\n\nEC: FNT-FY17-02 SUBMARINE SIMULTANEOUS TRANSMIT AND RECEIVE (SUBSTAR)\n- Initiate Submarine Simultaneous Transmit and Receive (SubSTAR) - Verify concept of submarine broadband antenna enabling simultaneous transmit and receive capability.\n\nEC: FNT-FY17-04 RESILIENT HULL\/INFRASTRUCTURE MECHANICAL & ELECTRICAL SECURITY (RHIMES)\t\n- Initiate SCAMM - Develop and demonstrate software algorithms that protect naval Hull, Mechanical and Electrical (HM&E) systems against cyber threats.\n- Initiate SCRAM - Develop and demonstrate information shaping cyber capabilities for tactical platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "POWER AND ENERGY (P&E)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Power and Energy (P&E) FNC pillar.  The P&E Pillar develops deliverable technologies that provide new capabilities in energy security, efficient power and energy systems, high energy and pulse power.   \n\nThe FY 2016 to FY 2017 increase was due primarily to the ramp-up of P&E-FY15-03 and the initiation of P&E-FY17-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.603"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: P&E-FY12-01 RENEWABLE-SUSTAINABLE EXPEDITIONARY POWER\n- Continue Renewable Thermal Engine - Continue fabrication and prototype assembly to include signature and susceptibility requirements as well as deployment\/stowage mechanisms.\n\nEC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Continue Air Independent Propulsion System - Integrate system components for packaging and demonstration in a prototype Unmanned Underwater Vehicle energy section hull.\n\nEC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Continue High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Conduct testing to Phase 1 metrics, select Phase 2 performer, and initiate Phase 2 development, to include reduced scale testing of candidate protection methods in a relevant power system environment.\n\nEC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Initiate Compact High Density Tactical Energy Storage - Develop multifunction energy storage module control, interface, thermal management and containment subcomponents for tactical application.\n- Initiate Multi-Function High Density Shipboard Energy Storage - Develop full scale ship multifunction energy storage module control, interface, thermal management and containment subcomponents for shipboard applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.024"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: P&E-FY12-01 RENEWABLE-SUSTAINABLE EXPEDITIONARY POWER\n- Complete Renewable Thermal Engine - Conduct full-scale testing and a TRL 6 demonstration, and deliver tactical power system prototype to USMC transition sponsor.\n\nEC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Continue Air Independent Propulsion System - Conduct Phase II fuel cell energy system integration into a UUV energy section and conduct TRL-6 land-based testing and transition planning. \n\nEC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Continue High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Develop final Phase II design for prototype circuit protection devices and initiate development of the devices and the associated test environment.\n\nEC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Continue Compact High Density Tactical Energy Storage - Develop and test a multifunction energy storage module system, which integrates target subcomponent technologies.\n- Continue Multi-Function High Density Shipboard Energy Storage - Develop a subscale ship multi-function energy storage module integrated system and conduct initial shipboard testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.641"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.641"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Complete Air Independent Propulsion System - Conduct Phase II fuel cell energy system integration into a UUV energy section and conduct TRL-6 land-based testing and transition planning. \n\nEC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Continue High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Select the appropriate 20kV semiconductor devices and develop the related circuit topology and fault sensing algorithms.\n\nEC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Continue Multi-Function High Density Shipboard Energy Storage - Develop a ship multi-function energy storage module integrated system and complete development of a safe non-propagating battery subsystem.\n- Continue Compact High Density Tactical Energy Storage - Initiate development of a full scale multifunction energy storage module with hybrid power system interface.\n\nEC: P&E-FY17-02 TORPEDO ADVANCED PROPULSION SYSTEM (TAPS)\n- Initiate Torpedo Advanced Propulsion System (TAPS) - Initiate limited component development and testing."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA BASING (BAS)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Sea Basing (BAS) FNC pillar.  The BAS Pillar develops deliverable logistics, shipping and at-sea transfer technologies that provide new capabilities for projecting expeditionary force from the sea base and providing sea based joint operational independence through improved connector, at-sea transfer and shipboard logistical capabilities.  \n\nThe FY 2015 to FY 2016 decrease was due to the completion of BAS-FY07-02 and the planned ramp-down of BAS-FY11-01.\n\nThe FY 2016 to FY 2017 decrease was due to the completion of BAS-FY11-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.693"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: BAS-FY07-02 SURFACE CONNECTOR VEHICLE TRANSFER\n- Complete Interface Ramp Technologies development - Conduct final American Bureau of Shipping (ABS) certification and testing of the JHSV ramp.\n\nEC: BAS-FY11-01 CONNECTORS AND THE SEA BASE\n- Continue Advanced Mooring System - Conduct integration, testing, and demonstration of the Advanced Mooring System S&T demonstrator at full-scale in a relevant environment.\n- Continue Environmental Ship Motion Forecasting - Complete integration and testing of environmental and ship motion sensor and forecasting system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.934"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: BAS-FY11-01 CONNECTORS AND THE SEA BASE\n- Complete Advanced Mooring System - Demonstrate a fully capable advanced mooring system and transition it to sponsors.\n- Complete Environmental Ship Motion Forecasting - Develop wave and ship motion forecasting technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA SHIELD (SHD)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Sea Shield (SHD) FNC pillar.  The SHD Pillar develops deliverable technologies that provide new capabilities in theater air and missile defense, anti-submarine warfare, mine countermeasures, defensive surface warfare, global defensive assurance, anti-terrorism, and fleet\/force protection.  \n\nThe FY 2015 to FY 2016 increase was due primarily to the planned ramp-up of SHD-FY14-04 and SHD-FY14-08, the delayed initiation of SHD-FY15-03, and the initiation of SHD-FY16-04, SHD-FY16-05, SHD-FY16-06, SHD-FY16-07 and SHD-FY16-OSD.\n\nThe FY 2016 to FY 2017 decrease was due primarily to the completion of SHD-FY10-01, SHD-FY10-03, SHD-FY11-01, SHD-FY12-01 and SHD-FY12-03, the planned ramp down of SHD-FY13-05, SHD-FY14-02 and SHD-FY16-05, and the movement of SHD-FY16-OSD out of the FNC Program into PE 0603782N."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "72.382"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: SHD-FY10-01 ANTI-SHIP MISSILE DEFENSE TECHNOLOGIES\n- Continue Enhanced Lethality Guidance Algorithms (ELGA) - Conduct hardware-in-the-loop testing of the ELGA guidance algorithm.\n- Continue Enhanced Maneuverability Missile Airframe (EMMA) - Conduct risk reduction rocket motor testing to demonstrate performance against exit criteria.\n\nEC: SHD-FY10-03 ADVANCED SONAR TECHNOLOGY FOR HIGH CLEARANCE RATE MCM\n- Complete Integrated Forward looking Sonar - Dual Frequency Synthetic Aperture Sonar (FLS-DFSAS) - Conduct forward looking sonar dual frequency synthetic aperture sonar algorithm development and conduct at-sea experimentation and demonstration.\n- Continue Long Range LFBB Sonar (AUV Platform Option) - Demonstrate at-sea performance of the Long Range LFBB sonar in a relevant environment.\n- Complete Very Shallow Water (VSW) Acoustic Color-Imaging Sonar - Conduct final testing required for transition.\n\nEC: SHD-FY10-05 AFFORDABLE VECTOR SENSOR TOWED ARRAY AND SIGNAL PROCESSING\n- Continue Vector Sensor Towed Array - Develop and deliver a thin-line Vector Sensor Towed Array (VSTA) system and demonstrate thin-line twin-line capability in a single array.\n- Complete Vector Sensor Towed Array Signal Processing - Deliver sonar signal processing hardware and software for experimentation and transition into the Advanced Processor Build for FY-17.\n\nEC: SHD-FY11-01 TORPEDO COMMON HYBRID FUZING SYSTEM\n- Continue Torpedo Common Hybrid Fuzing System - Conduct system integration, field testing and demonstration of a prototype system.\n\nEC: SHD-FY12-01 FORCE LEVEL RADAR RESOURCE MANAGEMENT FOR INTEGRATED AIR AND MISSILE DEFENSE (IAMD)\n- Continue Radar Resource Manager for IAMD - Conduct end-to-end testing to validate algorithms.\n\nEC: SHD-FY12-03 SONAR AUTOMATION\n- Continue Active Sonar Automation - Develop tools, utilizing new algorithms, for use in current active sonar systems that improve operator performance and reduce workload.\n- Continue Passive Sonar Automation - Develop tools utilizing new algorithms for use in current passive sonar systems that improve operator performance and reduce operator workload when used against quiet submarines in the presence of clutter.\n\nEC: SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Continue Compact Modular Sensor-Processing Suite (CMSS) - Integrate LIDAR into compact configuration and initiate data collection flight tests.\n\nEC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR \n- Continue Cooperative Networked Radar - Integrate and test cross platform radar operation.\n\nEC: SHD-FY13-05 HIGH ALTITUDE ASW (HAASW) FROM THE P-8\n- Continue Next Generation Multistatic Active Capability (NGMAC) - Improve and evaluate the performance of hardware and software for use in improving the Multistatic Active Capability sonobuoys and P-8A  signal processing.\n- Continue Unmanned Targeting Air System (UTAS) - Integrate Compact magnetometers into the Unmanned Air System (UAS) candidates and develop test plans for a maneuver table to compare Tier 1 and Tier 2 UAS's for the ASW mission.\n\nEC: SHD-FY13-07 USV PAYLOADS FOR SINGLE SORTIE MINE COUNTERMEASURES\n- Continue USV-based Mine Neutralization (formerly called Drifting Mine Neutralization Technology) - Develop and modify processing and hardware for neutralization technologies.\n Continue MCM Payload Automation for Data Analysis (Formerly a technology component of MCM Payload Automation) - Integrate and modify technologies for mine countermeasures automatic target recognition.\n- Continue MCM Payload Automation for Planning (Formerly a technology component of MCM Payload Automation) - Integrate and modify processing, autonomy, and control technologies for mine warfare environmental decision aid library.\n- Continue Single Sortie MCM Detect-to-Engage Payload - Design and develop launch, recovery, communication, recharging systems, and associated algorithms\/vehicle payload support hardware.\n\nEC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE \n- Continue ATT Timeline Compression (ATTTC) - Conduct real-time coding of bistatic detection and automatic preset\/launch sequence.\n- Continue Concept C Countermeasure - Conduct hardware fabrication.  \n- Continue HVU Mounted Sonar - Begin component prototype development of transducer array and electronics.\n\nEC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Autonomous Threat Detection and Localization - Build initial AUWS sensor nodes and integrate them into the Build initial AUWS sensor nodes.\n- Continue Remote Command & Control - Build and integrate the AUWS communications packages into the AUWS nodes, and conduct functional testing.\n- Continue Tactical Positioning & Fire Control - Build the AUWS node deployment modules, integrate into a UUV test-bed, and conduct functional testing. \n\nEC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S - Conduct modeling and simulation testing of the algorithm in a realistic environment.\n- Continue Terminator E - Conduct modeling and simulation testing of the algorithm in a realistic environment.\n- Continue Terminator R - Conduct modeling and simulation testing of the algorithm in a realistic environment.\n\nEC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Initiate Hyper Velocity Projectile - Design, fabricate and begin assembly of hypervelocity projectiles in preparation for full-up launch to validate common interfaces for powder gun and railgun launch."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "80.274"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: SHD-FY10-01 ANTI-SHIP MISSILE DEFENSE TECHNOLOGIES\n- Complete Enhanced Lethality Guidance Algorithms (ELGA) - Demonstrate and validate the guidance algorithm with respect to exit criteria.\n- Complete Enhanced Maneuverability Missile Airframe (EMMA) - Demonstrate the dual pulse rocket motor and integrated thrust vector control, and deliver the final rocket motor design.\n\nEC: SHD-FY10-03 ADVANCED SONAR TECHNOLOGY FOR HIGH CLEARANCE RATE MCM\n- Complete Long Range LFBB Sonar (AUV Platform Option) - Perform final system demonstration and exit event.\n\nEC: SHD-FY10-05 AFFORDABLE VECTOR SENSOR TOWED ARRAY AND SIGNAL PROCESSING\n- Complete Vector Sensor Towed Array - Finalize the demonstration of a thin, twin-line capability in a single array.\n\nEC: SHD-FY11-01 TORPEDO COMMON HYBRID FUZING SYSTEM\n- Complete Torpedo Common Hybrid Fuzing System - Conduct final field testing, demonstrate a prototype system, and transition the system to acquisition for engineering development.\n\nEC: SHD-FY12-01 FORCE LEVEL RADAR RESOURCE MANAGEMENT FOR INTEGRATED AIR AND MISSILE DEFENSE (IAMD)\n- Complete Radar Resource Manager for IAMD - Conduct a final demonstration of the Radar Resource Manager and validate the technology deliverable with respect to exit criteria.\n\nEC: SHD-FY12-03 SONAR AUTOMATION\n- Complete Active Sonar Automation - Evaluate and deliver algorithms for use in current active sonar systems that improve operator performance and reduce workload.\n- Complete Passive Sonar Automation - Evaluate and deliver algorithms for use in current passive sonar systems that improve operator performance and reduce workload when used against quiet submarines in the presence of clutter.\n\nEC: SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Continue Compact Modular Sensor-Processing Suite (CMSS) - Demonstrate multi-sensor detection of ocean mines from a manned helicopter.\n\nEC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR\n- Continue Cooperative Networked Radar - Conduct integration and testing for cross platform radar operation. \n\nEC: SHD-FY13-05 HIGH ALTITUDE ASW (HAASW) FROM THE P-8\n- Continue Next Generation Multistatic Active Capability (NGMAC) - Improve and evaluate the performance of hardware and software for use in improving the Multistatic Active Capability sonobuoys and P-8A signal processing.\n- Complete Unmanned Targeting Air System (UTAS) - Integrate compact magnetometers into Unmanned Air System (UAS) candidates and develop test plans for a maneuver table to compare Tier 1 and Tier 2 UAS's for the ASW mission.\n\nEC: SHD-FY13-07 USV PAYLOADS FOR SINGLE SORTIE MINE COUNTERMEASURES\n- Continue MCM Payload Automation for Data Analysis - Develop and extend adaptive Automatic Target Recognition approaches to advanced environmental models supporting Net-centric Sensor Analysis for MIW (NSAM).\n- Continue MCM Payload Automation for Planning - Develop and extend adaptive Automatic Target Recognition approaches to advanced environmental models supporting the Mine-warfare Environmental Decision-Aid Library (MEDAL).\n- Continue Single Sortie MCM Detect-to-Engage Payload - Design and develop launch, recovery, communications, and recharging systems, and associated algorithms and vehicle payload support hardware.\n- Continue USV-based Mine Neutralization - Develop and modify the processing and hardware for neutralization technologies.\n\nEC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE \n- Continue Concept C Countermeasure - Develop test plan for array design improvements.\n- Continue ATT Timeline Compression (ATTTC) - Begin in-water demonstrations.\n- Complete HVU Mounted Sonar - Complete array electronics and fabricate the first transmit\/receive panels, validating performance in a lake test.\n\nEC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Autonomous Threat Detection and Localization - Develop and integrate node deployment modules and the weapons payload, and conduct functional testing.\n- Continue Remote Command & Control - Develop communications package improvements and conduct functional component and system testing.\n- Continue Tactical Positioning & Fire Control - Conduct testing and evaluation, and integrate improved sensor node hardware and detection, classification, localization and targeting algorithms.\n\nEC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S (formerly Terminator E, R and S) - Validate the Ship Self-Defense System (SSDS) algorithm and the fire control loop concept using modeling and simulation tools.\n\nEC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Initiate MCM Task Force Planning - Extend algorithms for squadron-level planning and re-planning.\n- Initiate Expeditionary MCM Automated Data Analysis - Develop advanced automatic target recognition capabilities for Synthetic Aperture Sonar (SAS) and closed-aperture SAS.\n\nEC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Continue Hyper Velocity Projectile - Design, fabricate and begin assembly of hypervelocity projectiles in preparation for a full-up launch to validate common interfaces for powder gun and railgun launch. \n\nEC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Initiate Ship-launched EW Extended Endurance Decoy (SEWEED) - Build mockups of the fuselage, rotor and antenna cavity for RF payload antenna isolation experiments.\n\nEC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Initiate Surface Ship Periscope Detection and Discrimination (SSPDD) - Customize hardware interfaces for assembly and integration of system level components.\n\nEC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Initiate Next Generation Airborne Passive System (NGAPS) - Develop algorithms and hardware for field communications control, health monitoring, mission planning and contact separation and correlation.   \n\nEC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Initiate Softkill Performance and Real-Time Assessment (SPARTA) - Develop and optimize performance assessment algorithms, and align them with a pending system requirements review.\n\n EC: SHD-FY16-OSD MODULAR UNDERSEA EFFECTORS (MUSE)\n- Initate Modular UnderSea Effectors (MUSE) - Commence design of delivery and mooring approaches, technologies to integrate UUV-based and encapsulated undersea weapons, and prototyping of advanced sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "68.870"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "68.870"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Complete Compact Modular Sensor-Processing Suite (CMSS) - Complete Compact Modular Sensor-Processing Suite (CMSS) - Demonstrate multi-sensor detection of ocean mines from a manned helicopter.\n\nEC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR\n- Complete Cooperative Networked Radar - Test and demonstrate software algorithms and techniques for cross-platform radar operation deliver enhanced sensitivity.\n\nEC: SHD-FY13-05 HIGH ALTITUDE ASW (HAASW) FROM THE P-8\n- Complete Next Generation Multistatic Active Capability (NGMAC) - Demonstrate the Next Generation Multistatic Active Capability sonobuoys in a relevant at sea Navy environment.\n\nEC: SHD-FY13-07 USV PAYLOADS FOR SINGLE SORTIE MINE COUNTERMEASURES\n- Complete USV-based Mine Neutralization - Perform final system demonstration of Neutralizer Test Bed and associated technologies.\n- Complete Single Sortie MCM Detect-to-Engage Payload - Perform final system demonstration of launch, recovery, communications,  recharging systems, and associated algorithms\/vehicle payload support hardware.\n- Complete MCM Payload Automation for Data Analysis - Demonstrate system-level Automatic Target Recognition (ATR) capability at technology development exit event.\n- Complete MCM Payload Automation for Planning - Demonstrate component level risk analysis in war game exit event.\n\nEC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE\n- Continue ATT Timeline Compression (ATTTC) - Conduct in-water component testing and data collection.\n- Continue Concept C Countermeasure - Conduct bench testing of array design improvements and prepare for in-water tests.\n\nEC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Tactical Positioning & Fire Control - Demonstrate node deployment modules & weapons payload integration.\n- Continue Autonomous Threat Detection and Localization - Develop final sensor node hardware\/software and perform functional testing.\n- Continue Remote Command & Control - Demonstrate an integrated communications package.\n\nEC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S (formerly Terminator E, R and S) - Validate the Ship Self-Defense System (SSDS) algorithm and the fire control loop concept using modeling and simulation tools.\n\nEC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Continue MCM Task Force Planning - Develop approach to automate data management from Naval message traffic to support re-planning, scheduling, and situational awareness.\n- Continue Expeditionary MCM Automated Data Analysis - Extend in situ retraining algorithms to multi-band advanced sonar systems.\n\nEC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Continue Hyper Velocity Projectile - Design, fabricate and begin assembly of hypervelocity projectiles in preparation for a full-up launch to validate common interfaces for powder gun and railgun launches.\n\nEC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Continue Ship-launched EW Extended Endurance Decoy (SEWEED) - Build mockups of the fuselage, rotor, and antenna cavity for RF payload antenna isolation experiments.\n\nEC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Continue Surface Ship Periscope Detection and Discrimination (SSPDD) - Customize hardware interfaces for assembly and integration of system level components.\n\nEC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Continue Next Generation Airborne Passive System (NGAPS) - Integrate algorithms with hardware for field communications, control, health monitoring, mission planning and contact separation and correlation.\n\nEC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Continue Softkill Performance and Real-Time Assessment (SPARTA) - Develop and optimize performance assessment algorithms and align them with a pending system requirements review.\n\nEC: SHD-FY16-OSD MODULAR UNDERSEA EFFECTORS (MUSE)\n- Continued in PE 0603782N.\n\nEC: SHD-FY17-02 AUTONOMOUS UNMANNED SURFACE VEHICLES FOR MINE WARFARE (MIW)\n- Initiate Autonomous Situational Awareness and Hazard Avoidance System for USVs - Integrate autonomous control on an Unmanned Surface Vehicle (USV) and demonstrate at-sea.\n- Initiate High Temperature Superconducting (HTS) Magnetic Influence Sweep Payload for USVs - Integrate the superconducting system on an Unmanned Surface Vehicle (USV) and demonstrate at-sea.\n- Initiate Underway Refueling and Data Transfer for USVs and RMMVs - Integrate underway refueling and data transfer technology with Unmanned Surface Vehicles (USVs) and Remote Multi-Mission Vehicles (RMMVs) and demonstrate at-sea.\n\nEC: SHD-FY17-05 DEEP RELIABLE ACOUSTIC PATH EXPLOITATION SYSTEM (DRAPES)\n- Initiate Deep Reliable Acoustic Path Exploitation System (DRAPES) - Integrate algorithms and hardware for undersea communications, health monitoring, and contact separation and correlation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA STRIKE (STK)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE.  The Sea Strike (STK) FNC pillar develops deliverable technologies that provide new capabilities in power projection and deterrence, precise and persistent offensive power, weapons, aircraft, and expeditionary warfare.  \n\nThe FY 2015 to FY 2016 decrease was due primarily to the completion of STK-FY09-03, STK-FY11-01 and STK-FY11-02.\n\nThe FY 2016 to FY 2017 increase was due primarily to the planned ramp-up of STK-FY15-01, STK-FY15-02, STK-FY16-01 and STK-FY17-04."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "46.205"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  STK-FY09-03 ENHANCED WEAPONS TECHNOLOGIES\n- Complete Counter Air Defense Improvements - Finish propulsion system, manufacture hardware, cast propellant grains, assemble rocket motors and test in both performance and insensitive munitions conditions.\n- Continue High Speed Components - Resolve testing issues and prepare for additional testing required for transition.\n\nEC: STK-FY11-01 STRIKE ACCELERATOR\n- Complete Strike Accelerator - Transition new technologies that enable utilizing tactical aircraft Radar and forward looking infrared sensors to quickly identify and target maritime threats at extended range.\n\nEC: STK-FY11-02 RADAR ELECTRONIC ATTACK PROTECTION (REAP)\n- Complete Identification and Defeat of EA Systems (IDEAS) - Integrate and test highly robust EW techniques that protect U.S. forces from Advanced Electronic Attack Systems.\n- Complete Network \"Sentric\" Electronic Protection (EP) - Integrate and test techniques for APG-79 electronic protection.\n\nEC: STK-FY12-01 SUBMARINE SURVIVABILITY - ELECTRONIC WARFARE\n- Continue Coherent Electronic Attack for Submarines (CEAS) - Integrate robust and highly advanced electronic attack techniques to provide a collaborative electronic attack capability against surface targets.\n\nEC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Continue Long Range Find, Fix and ID - Integrate and test algorithms for moving maritime RF identification.\n\nEC: STK-FY13-02 HOSTILE FIRE (HF) SUPPRESSION\n- Continue Hostile Fire Suppression System - Continue visible dazzle effectiveness requirements experiments.  \n\nEC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Continue Anti-Surface Warfare (ASuW) Weapon Upgrade - Conduct Phase I demonstration.\n\nEC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Continue SMOKE - Develop an advanced kinematic improvement to the AIM-9X Sidewinder missile.\n\nEC: STK-FY14-01 BANK SHOT\n- Continue Bank Shot - Develop the software architecture and associated algorithms that provide for fusion of passive sensor data.\n\nEC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Continue Collaborative Anti-Surface Warfare Engagement (CASE) - Demonstrate software operability and inter-operability for flexible weapon behaviors at the salvo level in an Anti-Access, Area Denial environment.\n- Continue Collaborative Electronic Attack (CEA) - Integrate robust and highly advanced electronic attack techniques to provide a collaborative electronic attack capability against surface targets.\n\nEC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Initiate Synthetic Aperture Radar Electronic Protection - Integrate and test synthetic aperture radar electronic protection algorithms and techniques.\n\nEC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Initiate Helicopter Active RPG Protection (HARP) - Demonstrate the technological feasibility of a Rocket Propelled Grenade (RPG) hard-kill defense system and its component operability on the MV-22. \n- Initiate Multi-Spectral EO\/IR Seeker Defeat - Integrate existing and developmental EO\/IR diode sources into the existing Counter Measure Jammer free space and fiber based optical designs. \n\nEC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Initiate MUHV Autonomy Suite - Initiate open-loop testing of the autonomy suite.\n- Initiate MUHV Sensors, Navigation and Guidance - Initiate communication system open-loop testing.\n\nEC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Continue Extended-Range Targeting (E-RAT) - Develop concept and technology demonstration plans of subsystem models to assess the feasibility and operability of new technologies for targeting and fire control modes at extended ranges.\n\nEC: STK-FY17-04 ALPO\n- Initiate ALPO - Begin the technological feasibility and assessment phase of an advanced signal processing system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.365"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: STK-FY09-03 ENHANCED WEAPONS TECHNOLOGIES\n- Complete High Speed Components - Finish development and conduct final testing required for transition.\n\nEC: STK-FY12-01 SUBMARINE SURVIVABILITY - ELECTRONIC WARFARE\n- Complete Coherent Electronic Attack for Submarines (CEAS) - Develop prototype hardware and software for insertion of advanced electronic support and electronic attack techniques into a payload form factor consistent with compact applications, including submarine masts.  \n\nEC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Continue Long Range Find, Fix and ID - Conduct integration and testing for moving maritime Radio Frequency identification algorithms.\n\nEC: STK-FY13-02 HOSTILE FIRE (HF) SUPPRESSION\n- Complete Hostile Fire Suppression System - Demonstrate real-time reactive hostile shooter suppression in a field test demonstration.\n\nEC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Continue Anti-Surface Warfare (ASuW) Weapon Upgrade - Demonstrate and evaluate relevant algorithms during at-sea testing.\n\nEC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Continue SMOKE - Design, develop and demonstrate an advanced propulsion system for a future Air-to-Air missile.\n\nEC: STK-FY14-01 BANK SHOT\n- Continue Bank Shot - Develop the software architecture and associated algorithms that provide for data fusion.\n\nEC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Continue Collaborative Anti-Surface Warfare Engagement (CASE) - Demonstrate software operability and inter-operability for flexible weapon behaviors at the salvo level in an Anti-Access, Area-Denial environment.\n- Continue Collaborative Electronic Attack (CEA) - Integrate and test highly advanced electronic attack techniques to provide an advanced collaborative electronic attack capability against surface targets.\n\nEC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Conduct integration and testing of synthetic aperture radar electronic protection algorithms and techniques.\n\nEC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Demonstrate the technological feasibility of a Rocket Propelled Grenade (RPG) hard-kill defense system and its component operability on the MV-22.\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Develop Electro-Optical\/Infrared (EO\/IR) countermeasure high power sources and supporting optics that can be integrated into Joint and Allied systems.\n\nEC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Conduct in-water autonomy open-loop testing.\n- Continue MUHV Sensors, Navigation and Guidance - Conduct in-water navigation system demonstrations (open and closed loop).\n\nEC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Continue Extended-Range Targeting (E-RAT) - Conduct concept and technology demonstrations of subsystem models to assess the feasibility and operability of new technologies for targeting and fire control modes at extended ranges.\n\nEC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Initiate Reactive Electronic Attack Measures (REAM) - Develop a test bed for testing enhanced Radio Frequency sensing algorithms and an integration strategy for targeted transition systems.\n\nEC: STK-FY17-04 ALPO\n- Continue ALPO - Begin development of an advanced signal processing system in a relevant tactical environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "47.467"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "47.467"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Continue Long Range Find, Fix and ID - Test and verify performance of algorithms for achieving Radio Frequency (RF) identification of moving maritime contacts.\n\nEC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Continue Anti-Surface Warfare (ASuW) Weapon Upgrade - Evaluate system performance based during in-water testing.\n\nEC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Continue SMOKE - Design, develop and demonstrate an advanced propulsion system for a future Air-to-Air missile.\n\nEC: STK-FY14-01 BANK SHOT\n- Complete Bank Shot - Develop the software architecture and associated algorithms that provide for data fusion.\n\nEC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Continue Collaborative Anti-Surface Warfare Engagement (CASE) - Demonstrate software operability and interoperability for flexible weapon behaviors at the salvo level in an Anti-Access, Area-Denial environment.\n- Continue Collaborative Electronic Attack (CEA) - Perform lab testing of Collaborative Peer-to-Peer Adaptable Electronic Warfare (EW) Mission Prioritization and threat classification algorithms.\n\nEC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Test algorithms and techniques to improve synthetic aperture radar electronic protection.\n\nEC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Demonstrate the technological feasibility of a Rocket Propelled Grenade (RPG) hard-kill defense system and its component operability.\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Begin subcomponent design integration of the Electro-Optic (EO) source to be used in combination with an existing Infra-Red CounterMeasures (IRCM) Laser to support transition.\n\nEC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Conduct open-loop in-water demonstrations of autonomy algorithms for mission planning, waypoint navigation, and vehicle health assessment.\n- Continue MUHV Sensors, Navigation and Guidance - Conduct in-water demonstrations of multiband and hybrid sonar, inertial navigation, and fiber optic systems.\n\nEC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Continue Extended-Range Targeting (E-RAT) - Conduct technology concept demonstrations of subsystem models to assess the feasibility and operability of new technologies for the targeting and fire control modes at extended ranges.\n\nEC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Continue Reactive Electronic Attack Measures (REAM) - Design and integrate adaptive capabilities into an advanced prototype within an existing Electronic Attack (EA) suite subsystem and adaptive threat simulator.\n\nEC: STK-FY17-04 ALPO\n- Continue ALPO - Continue technology development of an advanced signal processing system in a relevant tactical environment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As discussed in Section A, there are a significant number of FNC technology products within this PE.  In all cases, these technology products support the Department of the Navy's FNC Program and are managed at the Office of Naval Research.  All FNC investments in this PE are subjected to management oversight by 2-star chaired Integrated Product Teams (IPTs) that control the naval pillars of Sea Shield, Sea Strike, Sea Basing, Forcenet, Naval Expeditionary Maneuver Warfare, Enterprise and Platform Enablers, Power and Energy, Capable Manpower, and Force Health Protection.  Each EC is aligned to a pillar and each technology product is aligned to an EC.  At the lowest level, each technology product is measured against both technical and financial milestones on a monthly basis.  Annually, each technology product is reviewed in depth for technical performance and development status by the Chief of Naval Research against goals that have been approved by the Navy's 3-star Technology Oversight Group (TOG).  Also annually, each technology product is reviewed by its 2-star chaired pillar IPT for transition planning and adequacy and transition commitment level.   Products must meet TOG required transition commitment levels for S&T development to continue.  Transition issues and required adjustments are reported annually by the Chief of Naval Research to the TOG, which establishes investment priorities for the FNC Program."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.835"
                        },
                        "CurrentYear": {
                            "val": "7.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.835"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The efforts described in this Project address the Advanced Technology Development associated with the Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the Navy's Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are identified by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders. The Enabling Capabilities (ECs) and associated technology product investments of the FNC Program are competitively selected by a 3-star Technology Oversight Group (TOG), chartered by the S&T Corporate Board and representing the requirements, acquisition, research and fleet\/forces communities of the Navy and the Marine Corps."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "ASW Research Prog - Cong"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.835"
                                        },
                                        "Text": {
                                            "val": "Anti-Submarine Warfare (ASW) surveillance efforts have been successfully used to address field experimentation and algorithm development.  FY2015  Details are classified but involve understanding upper ocean acoustic structure to address passive detection opportunities,  numerical modeling to understand ocean clutter impeding detection and creating false alarms, and new sensor opportunities. Numerical modeling has been completed for the initial conops evaluation and are being provided to USN for consideration."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.000"
                                        },
                                        "Text": {
                                            "val": "Expand field experimentation into new environments to further refine understanding of upper ocean acoustical phenomena for passive detection."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In all cases, FNC technology products support the Department of the Navy's FNC Program and are managed at the Office of Naval Research.  All FNC investments in this PE are subjected to management oversight by 2-star chaired Integrated Product Teams (IPTs).  Each EC is aligned to a pillar and each technology product is aligned to an EC.  At the lowest level, each technology product is measured against both technical and financial milestones on a monthly basis.  Annually, each technology product is reviewed in depth for technical performance and development status by the Chief of Naval Research against goals that have been approved by the Navy's 3-star Technology Oversight Group (TOG).  Also annually, each technology product is reviewed by its 2-star chaired pillar IPT for transition planning and adequacy and transition commitment level.   Products must meet TOG required transition commitment levels for S&T development to continue.  Transition issues and required adjustments are reported annually by the Chief of Naval Research to the TOG, which establishes investment priorities for the FNC Program."
                        }
                    }
                }
            ]
        }
    }
}