{
    "id": "4cfe358a3bb68e51e826018df3d0297bfd2042ad",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA3_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603313A"
        },
        "ProgramElementTitle": {
            "val": "Missile and Rocket Advanced Technology"
        },
        "R1LineNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "78.302"
            },
            "CurrentYear": {
                "val": "104.449"
            },
            "BudgetYearOne": {
                "val": "52.190"
            },
            "BudgetYearOneBase": {
                "val": "52.190"
            },
            "BudgetYearTwo": {
                "val": "58.142"
            },
            "BudgetYearThree": {
                "val": "56.688"
            },
            "BudgetYearFour": {
                "val": "59.300"
            },
            "BudgetYearFive": {
                "val": "60.486"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures, fabricates, and demonstrates advanced rocket, missile, interceptor, and guided munition technologies to enhance weapon system lethality, survivability, agility, deployability, and affordability. Project 206 develops high fidelity simulations for advanced tactical missiles and interceptors. Project 263 demonstrates missile and interceptor systems with capabilities to provide protection against rockets, artillery, and mortars; provide precision weapons for small units in close combat; provide precision long-range fires; and provide minimum smoke propulsion for aviation missiles. Project 704 demonstrates the capability to detect and track rocket, artillery, mortar, and unmanned air vehicles threats. NA6 is a congressional increase project.\n \nWork in this PE is complimentary to PE 0602303A (Missile Technology) and is fully coordinated with PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603003A (Aviation Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), PE 0603270A (Electronic Warfare Technology), PE 0603734A (Combat Engineering Systems), and PE 0708045A (Manufacturing Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.   \n \nWork in this PE is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC) located at Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "79.934"
                },
                "CurrentYear": {
                    "val": "49.449"
                },
                "BudgetYearOne": {
                    "val": "52.190"
                },
                "BudgetYearOneBase": {
                    "val": "52.190"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "78.302"
                },
                "CurrentYear": {
                    "val": "104.449"
                },
                "BudgetYearOne": {
                    "val": "52.190"
                },
                "BudgetYearOneBase": {
                    "val": "52.190"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.632"
                },
                "CurrentYear": {
                    "val": "55.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "55.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.632"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "206"
                    },
                    "ProjectTitle": {
                        "val": "Missile Simulation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.703"
                        },
                        "CurrentYear": {
                            "val": "1.731"
                        },
                        "BudgetYearOne": {
                            "val": "2.435"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.435"
                        },
                        "BudgetYearTwo": {
                            "val": "2.475"
                        },
                        "BudgetYearThree": {
                            "val": "2.488"
                        },
                        "BudgetYearFour": {
                            "val": "2.574"
                        },
                        "BudgetYearFive": {
                            "val": "2.625"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates advanced modeling and simulation technologies for missile design and analysis. Evaluation of missile technology by means of modeling and simulation provides a cost-effective method that supports missile maturation throughout the weapon system life cycle. This effort permits a reduction in the number of flight tests required for programs of record as well as improves the confidence of flight test readiness and probability of flight test success.  \n\nThis project support efforts in the Army Science and Technology Lethality portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center, (AMRDEC) Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Missile Simulation"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced analysis and high fidelity modeling and simulation technologies for advanced missiles and interceptor design and analysis. Evaluation of missile technology through modeling and simulation provides a cost-effective method to support missile maturation throughout the weapon system life cycle. This effort shortens component design timelines, reduces integration activities, enables a reduction of flight tests required for programs of record and improves the confidence of flight test readiness and the probability of flight test success."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.703"
                                            },
                                            "Text": {
                                                "val": "Designed a radio frequency scene generation algorithm and began hardware\/software integration into hardware-in-the-loop to support testing of advanced millimeter wave (MMW) sensors. Designed an integrated, cohesive sensor development modeling and simulation environment to significantly reduce seeker design and development timeline. Completed missile life-cycle cost analysis model, optimized for use during the S&T phase of technology development to design in cost saving features."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.731"
                                            },
                                            "Text": {
                                                "val": "Mature radio frequency (RF) scene generation algorithms and continue hardware\/software integration into hardware-in-the-loop to support testing of advanced millimeter wave radar sensors. Mature a modeling and simulation environment to significantly reduce seeker algorithm design and development timelines. Refine and validate missile life-cycle cost analysis model against existing life-cycle cost information, optimized for use during the S&T phase of technology development to design in cost saving features. Design and begin development of a testbed to explore advanced network integration techniques for emerging air and missile defense weapons reducing hardware integration costs and improving weapons pairing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.435"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.435"
                                            },
                                            "Text": {
                                                "val": "Will complete the maturation and demonstration of a modeling and simulation environment to significantly reduce seeker algorithm design and development timelines; complete the maturation of radio frequency (RF) scene generation algorithms and continue hardware\/software integration into hardware-in-the-loop to support testing of advanced millimeter wave radar sensors; develop novel methods to address deficiencies in Electro-Optical\/Infrared (EO\/IR) real-time high-bandwidth sensor stimulation for Hardware in the loop, which will meet future needs of large format & high bandwidth\/high fidelity sensor systems; and will continue development of a testbed to explore advanced network integration techniques for emerging air and missile defense weapons reducing hardware integration costs and improving weapons pairing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "263"
                    },
                    "ProjectTitle": {
                        "val": "Future Msl Tech Integr(FMTI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.198"
                        },
                        "CurrentYear": {
                            "val": "27.572"
                        },
                        "BudgetYearOne": {
                            "val": "23.282"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.282"
                        },
                        "BudgetYearTwo": {
                            "val": "30.021"
                        },
                        "BudgetYearThree": {
                            "val": "31.521"
                        },
                        "BudgetYearFour": {
                            "val": "30.174"
                        },
                        "BudgetYearFive": {
                            "val": "44.608"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures, fabricates, and demonstrates advanced missile and interceptor technologies, such as seekers, guidance and controls, propulsion, and airframes. The project goal is to reduce the life-cycle costs and cost per kill of precision guided missiles and interceptors. \n\nThis Project support efforts in the Army Science and Technology Lethality and Ground Maneuver portfolios.\n\nThis Project matures technologies from Program Element (PE) 0602303A and directly supports systems managed by the Program Executive Officer for Missiles and Space. Work in this project is in collaboration with PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technologies), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology) and PE 0708045A (Manufacturing Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technical Fire Control Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates Technical Fire Control technology necessary to generate and execute a firing solution for defeat of rocket, artillery, and mortar (RAM), Unmanned Aerial Systems (UAS), and\/or Cruise Missile threats in the required timeline to protect ground forces. This effort develops Technical Fire Control technology to complement the interceptor development performed in the Guided Interceptor Technology for Defense against RAM, UAS and\/or Cruise Missile, Hit-to-Kill Interceptor Technology for Defense against RAM, UAS and\/or Cruise Missile, and Counter RAM, UAS and\/or Cruise Missile Tracking and Fire Control (PE 0603313A Project 704) efforts. These combined efforts will conduct multiple interceptor Hardware-in-the-Loop (HWIL) demonstrations each year. The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC) and other Air and Missile Defense programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.532"
                                            },
                                            "Text": {
                                                "val": "Continued refinements and enhancements of Technical Fire Control nodes for Counter RAM, UAS, and Cruise Missile interceptors based on current threat analysis. Used these Technical Fire Control nodes to conduct virtual flight tests against emerging threats in HWIL."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guided Interceptor Concept Technology for defense against Rockets, Artillery, and Mortars (RAM), Unmanned Aerial Systems (UAS), and Cruise Missiles"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a Guided missile-based Interceptor concept initially focused to defeat RAM, UAS, and Cruise Missile threats with the potential for precision ground-to-ground applications. This effort designs, fabricates, evaluates, and flight demonstrates a guided missile-based interceptor and launch system. The complementary effort in PE 0603313A, Project 704, Technical Fire Control Technology, provides the interceptor with a firing solution and launch command based on tracking of the UAS, RAM, and Cruise Missile threats. This effort will support the design, fabrication, integration, HWIL tests, and flight demonstration of multiple guided interceptors. The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC) and other Air and Missile Defense programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.142"
                                            },
                                            "Text": {
                                                "val": "Completed Critical Design Reviews for alternative components for Guided interceptors to defeat RAM, UAS and Cruise Missile. Tested form-factor components in HWIL to provide pre-flight predictions and reduce risk. Updated and refined the system simulation based on performance demonstrated in HWIL pre-flight predictions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hit-to-Kill Interceptor Concept Technology for Defense against Rockets, Artillery, and Mortars (RAM), Unmanned Aerial Systems (UAS), and Cruise Missiles"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a compact, very light weight, RF seeker guided Hit-to-Kill (HTK) missile-based Interceptor concept initially focused to defeat RAM threats in flight with the potential for use on air launched platforms, small weapons platforms, and ground-to-ground applications. This effort designs, fabricates, and evaluates a Hit-to-Kill counter RAM system consisting of interceptors and a launch system. Complementary efforts include: Technical Fire Control Technology provides the firing solution and launch command and Counter RAM, UAS and\/or Cruise Missile Tracking and Fire Control, PE 0603313A Project 704, provides tracking of the threat for intercept. This effort will support the design, fabrication, integration, and HWIL tests of multiple hit-to-kill interceptors. The technologies demonstrated will be applicable to the IFPC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.636"
                                            },
                                            "Text": {
                                                "val": "Continued integration and testing, and analysis of HTK components; began fabrication and testing of the active seeker for HTK to provide a Fire Control independent solution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Tactical Extended Range Missile"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturation, fabrication, and demonstration of technologies for low-cost precision fires missile capable of deep strike engagements. The aim is to provide extended range and expanded target set capability through advanced propulsion, new payload technology, and maintain effectiveness in Global Positioning System (GPS) challenged environments through new and novel navigation technologies. This effort supports the Army need for developing capability enablers in the area of Extended Range Precision Fires."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Text": {
                                                "val": "Conducted trade studies through simulation to determine subsystem requirements for delivery of enhanced lethal effects to long range targets; evaluated the target sets at various ranges and matched payload technologies with the threat sets; matched propulsion technologies with range and missile size; evaluated emerging navigation technologies for GPS challenged environments; evaluated requirements for compatibility with both current and future long range launch systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.638"
                                            },
                                            "Text": {
                                                "val": "Complete simulation trade studies determining subsystem requirements for delivery of enhanced lethal effects to long range targets; mature multi-functional payload technologies to service the broad threat set of targets with one warhead; mature and perform preliminary testing of advanced propulsion technologies that provide low cost energy management to enhance kinematic performance for long range precision fires; mature navigation technologies for GPS challenged environments in order to enhance the precision of long range precision fires in denied environments; design and fabricate control actuation system hardware, develop navigation algorithms and perform structural analysis for tail controlled long range rockets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.962"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.962"
                                            },
                                            "Text": {
                                                "val": "Will continue to refine and update the long range fires missile system simulation to reflect the emerging navigation, propulsion, and payload technologies. This system simulation will be used to assess improved missile performance provided by these technologies and guide their continued development; continue to refine navigation system concept designs that leverage emerging navigation technologies being developed under PE 0602303A; and continue development and maturation of novel motor technology for long range precision fires - complete preliminary design, conduct design review, and originate static motor testing to assess performance for extended range missile capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection System Interceptor Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates modular hard-kill Active Protection System (APS) technologies with the Hit Avoidance Architecture and APS Common Controller and matures modeling and simulation for system integration and demonstration. Specifically the hardkill APS portion and modeling and simulation efforts will be addressed by AMRDEC. This effort supports the Army's APS program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats. This effort supports the development of an APS Common Architecture enabling adaptable APS solutions that can be integrated across Army vehicle platforms as required. This effort compliments work being accomplished under PE 0602601A\/Project C05, PE 0602618A\/Project H80, PE 0603004A\/Project 232, PE 0603005A\/Project 221, and PE 0603270A\/Project K16."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.993"
                                            },
                                            "Text": {
                                                "val": "Began integration of a modular hard-kill active protection sub-system (including countermeasures, detection sensors, and tracking sensors) with a common controller through a common architecture for use in an integrated survivability suite on a combat vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Advance APS modeling and simulation to configure and evaluate subsystem integration on physical and virtual demonstrator platforms; evaluate mature, hard-kill countermeasure subsystems for adaption to the Modular Active Protection System (MAPS) controller, through the common architecture, allowing hardware integration with a physical demonstrator combat vehicle platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.250"
                                            },
                                            "Text": {
                                                "val": "Will continue analysis of APScountermeasure and fire control sensor alternatives with modeling and simulation; continue maturation and adaptation of a hard-kill countermeasure and fire control sensor in support of developing improved survivability equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hunter Killer Missile Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation, fabrication, integration, HWIL test, and flight demonstration of technology for an affordable discriminate extended range precision missile to include critical component technologies such as advanced propulsion, seekers, fire control, datalink, guidance and controls, and maneuverable airframes. Critical subsystem technology development transitions to 0603313A\/263 Low Cost Extended Range Missile and 0603313A\/704 Low Cost Extended Range Air Defense efforts for further maturation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.695"
                                            },
                                            "Text": {
                                                "val": "Conducted trade studies to determine subsystem requirements. Identified critical components and begin designing and maturation of those critical components such as propulsion, datalink, and tracker. Began development of system-level modeling and simulation necessary to mature and evaluate concepts for prediction of system capability across a broad spectrum of missions. Evaluated fire control requirements and identified key technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.803"
                                            },
                                            "Text": {
                                                "val": "Complete trade studies determining system and subsystems requirements for an affordable discriminate extended range precision missile; advance development of system-level modeling and simulation to mature and evaluate concepts for system performance predictions; mature key critical subsystem technologies in support of identified system requirements such as propulsion and navigation; mature maneuverable airframe guidance and controls algorithms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.024"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.024"
                                            },
                                            "Text": {
                                                "val": "Will continue to advance development of system-level modeling and simulation to mature and evaluate concepts for system performance predictions; continue to mature key critical subsystem technologies in support of identified system requirements, and begin to integrate subsystems and perform laboratory evaluations and testing in relevant environments to inform requirements for further maturation of concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Close Combat Weapons Technology"
                                    },
                                    "Description": {
                                        "val": "This effort addresses close combat weapon systems technology to include seeker, navigation and materials technology to enable a lightweight command launch unit for the man-portable Javelin weapon system, and system trade studies, and technology maturation and demonstration for a next generation close combat precision missile system for dismounted and mounted maneuver. This effort is coordinated with PE 0602709A\/Night Vision Technology."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.131"
                                            },
                                            "Text": {
                                                "val": "Finalize fabrication, integration, and testing of reduced weight, advanced composite housing including foam components for Javelin Light Weight Command Launch Unit (LW CLU); fabricate, integrate, and test an inertial navigation sensor with increased accuracy to include on-the-move capabilities (both targeting and navigation) and reduced size, weight, and power (SWaP) to provide precision for far target location; fabricate, integrate, and test a target acquisition sensor for the Javelin LW CLU increasing target acquisition range and reducing SWaP; perform system-level trade studies to identify critical technology needs such as seekers, propulsion and guidance for a next generation close combat missile system; mature key technologies for a next generation close combat missile system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.046"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.046"
                                            },
                                            "Text": {
                                                "val": "Will investigate and evaluate current system capabilities that support emerging requirements for close combat missile systems; perform detailed system designs and effectiveness analyses to shape critical component development that enable increased performance while ensuring affordability for future expeditionary and maneuvering capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "704"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Missile Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.401"
                        },
                        "CurrentYear": {
                            "val": "20.146"
                        },
                        "BudgetYearOne": {
                            "val": "26.473"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.473"
                        },
                        "BudgetYearTwo": {
                            "val": "25.646"
                        },
                        "BudgetYearThree": {
                            "val": "22.679"
                        },
                        "BudgetYearFour": {
                            "val": "26.552"
                        },
                        "BudgetYearFive": {
                            "val": "13.253"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures advanced missile system concepts and related hardware to enhance weapon system lethality, survivability, agility, versatility, deployability, and affordability for defense against future air and ground, armored and non-armored threats.    \n \nThis project support efforts in the Army Science and Technology Lethality portfolio.\n\nWork in this project is in collaboration with Program element (PE) 0602624A (Weapons and Munitions Technologies).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Counter Rockets, Artillery, Mortars (RAM), Unmanned Aerial Systems (UAS), and Cruise Missile Tracking and Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates system technology to provide 360 degree, near hemispherical coverage for tracking and intercept of RAM, UAS, and\/or Cruise Missile threats. This effort determines the trajectory and location of the incoming RAM, UAS, and\/or Cruise Missile threats and feeds that information to the technical fire control node to generate a firing solution provided to the guidance section of each of the missile interceptors. These efforts will be evaluated through Hardware-in-the-Loop (HWIL) tests and multiple interceptor flights. The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC) and other Air and Missile Defense programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.180"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and assessed performance utilizing existing counter RAM, UAS, and Cruise Missile tracking and fire control systems networked information against the full range of target types (RAM, UAS, and Cruise Missile), scenarios and multiple engagements utilizing simulations and HWIL."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.254"
                                            },
                                            "Text": {
                                                "val": "Test and refine autopilot algorithms of the active Hit-to-Kill (HTK) interceptor to provide protection against incoming RAM threats that can take target location updates from any applicable fire control sensor; refine and verify aerodynamic performance predictions; and update the HTK system simulation used for system performance prediction and analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.038"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.038"
                                            },
                                            "Text": {
                                                "val": "Will develop a surrogate demonstration launcher; begin integration of digital data link technology and ground station components; and begin integration of inertial and network alignment technology; will continue to coordinate integration of a mobile multi-purpose detect, decide, and defeat expeditionary technology; and continue to mature software algorithms and perform platform integration of cueing and tracking sensor capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low-cost Extended Range Air Defense"
                                    },
                                    "Description": {
                                        "val": "This effort matures key technologies of a lower-cost interceptor system with a low- to medium-altitude, medium- to long-range capability. This effort will enable lower cost interceptor integration into a net-enabled Air and Missile Defense Task Force for the protection of high value assets. Technologies will address the defeat of air defense threats such as UAS and Cruise Missile threats with secondary capabilities against Large Caliber Rockets (LCR), Short Range Ballistic Missiles (SRBM), and Tactical Air-to-Surface Missiles (TASMS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.221"
                                            },
                                            "Text": {
                                                "val": "Completed initial design of a medium- to long-range interceptor including identification of critical interceptor technology and component performance requirements. Began development of interceptor component technologies to include propulsion, seeker, guidance, navigation and controls and begin development of an interceptor simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.087"
                                            },
                                            "Text": {
                                                "val": "Complete design and begin static testing of solid rocket motor; complete target generator for hardware-in-the-loop calibration and testing of active radar seeker, guidance electronics, and control system; complete wind tunnel testing and aerodynamic analysis of interceptor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.184"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.184"
                                            },
                                            "Text": {
                                                "val": "Will continue component development and maturation for low-cost air defense interceptor system; complete static testing and evaluation of solid rocket motor design; continue development of secure digital data link, flight termination system, and control actuation system; complete development, fabrication, and integration of guidance electronics unit (GEU); and begin subsystem test and evaluation; Complete hardware-in-the-loop simulation tools and apparatus required to test interceptor navigation instrumentation, data link components, and control system technologies; and evaluate navigation instruments for eventual flight demonstration testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seeker and Guidance Technology for Air Defense"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation and integration of seeker and guidance technologies supporting air defense missile systems. Technologies addressed enable the defeat of multiple air defense threats such as Rockets, Artillery, and Mortars, UAS, and Cruise Missile threats with secondary capabilities against LCR, SRBM, and TASMS."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.805"
                                            },
                                            "Text": {
                                                "val": "Mature active seeker for the Hit-to-Kill interceptor for utilization against RAM threats in the Counter RAM, UAS, and Cruise Missile Tracking and Fire Control effort; mature low-cost active radio frequency (RF) seeker detailed design and begin fabrication and testing of seeker sub-systems for low-cost extended range air defense interceptor; continue maturation of guidance algorithms and navigation technology to support low-cost extended range air defense interceptor; mature low-cost extended range air defense interceptor hardware-in-the-loop simulation and software integration facilities for calibration and testing of active RF seekers, guidance electronics units, and control systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.601"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.601"
                                            },
                                            "Text": {
                                                "val": "Will complete development and fabrication of low-cost air defense interceptor seeker and integrate with guidance electronics unit in software integration facility for calibration and testing on flight motion simulator HWIL; continue maturation of guidance algorithms, and navigation technology implementation for accurate mid-course and terminal homing guidance at extended ranges; begin calibration, test, and evaluation of integrated subsystems on flight motion simulator in HWIL."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-role Missile Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation, fabrication, integration, HWIL development and test, and flight demonstration of critical technology that supports an open systems architecture to enable modular designs of guided and unguided missiles for smaller and lighter missile options with multi-role engagement capabilities reducing the life cycle cost for missiles.  Critical component technologies include advanced propulsion, payload (lethal and non-lethal), seekers, fire control, datalink, guidance and controls, and maneuverable airframes.  This effort matures and demonstrates technology from PE 0602303A, Multi-Role Missile Technology."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.650"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.650"
                                            },
                                            "Text": {
                                                "val": "Will continue maturation of component technology development from PE 0602303A (Multi-Role Missile Technology), perform laboratory testing and simulation evaluations; integrate modular missile technology subsystem; and perform ground launched, unguided\/ballistic flight test to verify mechanical and electrical integrity."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NA6"
                    },
                    "ProjectTitle": {
                        "val": "Missile and Rocket Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "35.000"
                        },
                        "CurrentYear": {
                            "val": "55.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Missile and Rocket advanced technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "35.000"
                                        },
                                        "Text": {
                                            "val": "Program increase for missile and rocket advanced technology development"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "55.000"
                                        },
                                        "Text": {
                                            "val": "Program increase for missile and rocket advanced technology development"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}