{
    "id": "4da6b46e71f2e5ed027281ad36f5433327339a13",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA6_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605898A"
        },
        "ProgramElementTitle": {
            "val": "Management HQ - R&D"
        },
        "R1LineNumber": {
            "val": "158"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "48.951"
            },
            "CurrentYear": {
                "val": "48.955"
            },
            "BudgetYearOne": {
                "val": "49.885"
            },
            "BudgetYearOneBase": {
                "val": "49.885"
            },
            "BudgetYearTwo": {
                "val": "49.742"
            },
            "BudgetYearThree": {
                "val": "45.816"
            },
            "BudgetYearFour": {
                "val": "39.744"
            },
            "BudgetYearFive": {
                "val": "33.125"
            }
        },
        "ProgramElementNote": {
            "val": "Planned Program Army Joint Test Element (JTE) move to PE 0605712, Project 001 in FY17."
        },
        "ProgramElementMissionDescription": {
            "val": "This project provides funding for the salaries and related personnel benefits for the authorized civilian personnel positions that provide for the management functions and the technical direction of the U.S. Army Test and Evaluation Command (ATEC) mission located at Aberdeen Proving Ground, Maryland.  ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, assessments and experiments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter. \n\nThis project includes staff\/management functions of resource management, human resources, safety, security, environmental, strategic planning and information\/technology support for command-wide databases in support of the developmental, evaluation and operational test mission with technical direction to the Army Evaluation Center (AEC), Aberdeen Proving Ground, Maryland; to the Operational Test Command (OTC), Fort Hood, Texas which consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Integrated Test and Evaluation Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas; and to the seven Major Range and Test Facility Base (MRTFBs) and one non-MRTFB test range:  Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; West Desert Test Center (WDTC), at Dugway Proving Ground (DPG), Utah; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Yuma Test Center (YTC) at Yuma Proving Ground (YPG), Arizona; Cold Regions Test Center (CRTC), Fort Greely, Alaska; and Tropic Regions Test Center (TRTC) at various locations, as well as for Redstone Test Center (RTC) Redstone Arsenal, Alabama. This is the operating budget for ATEC Headquarters, which provides technical direction for the annual execution of ~ 2,700 developmental tests; approximately ~70 operational events; and more than ~700 Evaluation and Safety documents supporting acquisition programs.  ATEC’s FY15 total authorized workforce is 8,282 with a $1.8 billion program.\n\nThe Army Joint Test Element (JTE) examines Joint Service, Combatant Command (COCOM) and DOD agencies mission gaps, tactics and doctrine resulting in the development of Tactics Techniques and Procedures (TTP), Concept of Operations (CONOPS), and assessment documents.  Products are developed through operational non-materiel solutions to urgent, specific, Joint Warfighter problems. The JTE coordinates and develops nominations for Quick Reaction Tests (QRTs), Joint Feasibility Studies (JFS); serves as the Operational Test Agency (OTA) for Army-led QRTs; and coordinates resources to support Joint Feasibility Studies (JFSs) and chartered Joint Tests (JT) under the Joint Test Unit (JTU) assigned to ATEC as the joint OTA.  The ATEC Commanding General serves as the Executive Steering Committee (ESG) member, while the Executive Director serves as the Technical Advisory Board (TAB) member.  DoDD 5010.41 provides policies and responsibilities for the JTE.  The DA G-8 is the agent for JTE for operations and DOD level Senior Advisory Council (SAC) responsibly.  Mission support also includes the support to two Joint Test Units (JTU) under the re-engineered Joint Test program.  ATEC provides military resource support to Nellis Air Force Base, and Suffolk VA with Officer and Non-Commissioned Officer (NCO) support.  Additional support to Joint Tests remains a requirement until the OSD Chartered projects are completed and transitioned to the respective Sponsoring COCOM.\n\nThis project does not finance test facility operations, test instrumentation or test equipment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.583"
                },
                "CurrentYear": {
                    "val": "48.955"
                },
                "BudgetYearOne": {
                    "val": "50.090"
                },
                "BudgetYearOneBase": {
                    "val": "50.090"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "48.951"
                },
                "CurrentYear": {
                    "val": "48.955"
                },
                "BudgetYearOne": {
                    "val": "49.885"
                },
                "BudgetYearOneBase": {
                    "val": "49.885"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.632"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.205"
                },
                "BudgetYearOneBase": {
                    "val": "-0.205"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.632"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.205"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.205"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY17 reduction in funding is attributed to realignment of funds from Planned Program: Army Joint Test Element (JTE) (i.e., PE 0605898, Project M65) to PE 0605712, Project 001."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "M65"
                    },
                    "ProjectTitle": {
                        "val": "Army Test and Evaluation Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.951"
                        },
                        "CurrentYear": {
                            "val": "48.955"
                        },
                        "BudgetYearOne": {
                            "val": "49.885"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.885"
                        },
                        "BudgetYearTwo": {
                            "val": "49.742"
                        },
                        "BudgetYearThree": {
                            "val": "45.816"
                        },
                        "BudgetYearFour": {
                            "val": "39.744"
                        },
                        "BudgetYearFive": {
                            "val": "33.125"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Army Joint Test Element (JTE) will be moved to PE 0605712, Project 001 in FY17."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides funding for the salaries and related personnel benefits for the authorized civilian personnel positions that provide for the management functions and the technical direction of the U.S. Army Test and Evaluation Command (ATEC) mission located at Aberdeen Proving Ground, Maryland.  ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, assessments and experiments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter. \n\nThis project includes staff\/management functions of resource management, human resources, safety, security, environmental, strategic planning and information\/technology support for command-wide databases in support of the developmental, evaluation and operational test mission with technical direction to the Army Evaluation Center (AEC), Aberdeen Proving Ground, Maryland; to the Operational Test Command (OTC), Fort Hood, Texas which consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Integrated Test and Evaluation Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas; and to the seven Major Range and Test Facility Base (MRTFBs) and one non-MRTFB test range:  Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; West Desert Test Center (WSTC) at Dugway Proving Ground (DPG), Utah; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Yuma Test Center (YTC), at Yuma Proving Ground (YPG), Arizona; Cold Regions Test Center (CRTC), Fort Greely, Alaska; and Tropic Regions Test Center (TRTC) at various locations, as well as for Redstone Test Center (RTC) Redstone Arsenal, Alabama. This is the operating budget for ATEC Headquarters, which provides technical direction for the annual execution of ~ 2,700 developmental tests; approximately ~70 operational events; and more than ~700 Evaluation and Safety documents supporting acquisition programs. ATEC’s FY15 total authorized workforce is 8,282 with a $1.8 billion program.\n\nThe Army Joint Test Element (JTE) examines Joint Service, Combatant Command (COCOM) and DOD agencies mission gaps, tactics and doctrine resulting in the development of Tactics Techniques and Procedures (TTP), Concept of Operations (CONOPS), and assessment documents.  Products are developed through operational non-materiel solutions to urgent, specific, Joint Warfighter problems. The JTE coordinates and develops nominations for Quick Reaction Tests (QRTs), Joint Feasibility Studies (JFS); serves as the Operational Test Agency (OTA) for Army-led QRTs; and coordinates resources to support Joint Feasibility Studies (JFSs) and chartered Joint Tests (JT) under the Joint Test Unit (JTU) assigned to ATEC as the joint OTA.  The ATEC Commanding General serves as the Executive Steering Committee (ESG) member, while the Executive Director serves as the Technical Advisory Board (TAB) member.  DoDD 5010.41 provides policies and responsibilities for the JTE.  The DA G-8 is the agent for JTE for operations and DOD level Senior Advisory Council (SAC) responsibly.  Mission support also includes the support to two Joint Test Units (JTU) under the re-engineered Joint Test program.  ATEC provides military resource support to Nellis Air Force Base, and Suffolk VA with Officer and Non-Commissioned Officer (NCO) support.  Additional support to Joint Tests remains a requirement until the OSD Chartered projects are completed and transitioned to the respective Sponsoring COCOM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Test and Evaluation Command (ATEC)"
                                    },
                                    "Description": {
                                        "val": "Civilian labor and other support required to manage and administer the Army test and evaluation mission at ATEC.  ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, assessments and experiments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.691"
                                            },
                                            "Text": {
                                                "val": "Funded the authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "48.692"
                                            },
                                            "Text": {
                                                "val": "Funds authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.885"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.885"
                                            },
                                            "Text": {
                                                "val": "Will fund authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Joint Test Element (JTE)"
                                    },
                                    "Description": {
                                        "val": "This project also funds Army's Joint Test Element (JTE) which is comprised of civilian and military personnel.  The JTE is required to research COCOM Integrated Priorities, Generate\/Develop\/Support efforts through rigorous COCOM engagements, and provide support during QRT\/JT support through the transition phase at the end of each directed project.  As the OTA, the JTE is responsible to maintain oversight status for the OSD for all directed test  efforts. In addition, JTE provides for handbook development for the Warfighter throughout the world in hard copy and in electronic book form."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.260"
                                            },
                                            "Text": {
                                                "val": "Funded the civilian labor and COCOM engagements, e-book development and exploring transition efforts to TRADOC\/ARCIC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.263"
                                            },
                                            "Text": {
                                                "val": "Funds civilian labor and COCOM engagements, e-book development and exploring transition efforts to TRADOC\/ARCIC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}