{
    "id": "5ff55ad85379ed0521b58ae55405fe1e57e6fae9",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA2_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602783A"
        },
        "ProgramElementTitle": {
            "val": "Computer and Software Technology"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "10.514"
            },
            "CurrentYear": {
                "val": "12.656"
            },
            "BudgetYearOne": {
                "val": "13.811"
            },
            "BudgetYearOneBase": {
                "val": "13.811"
            },
            "BudgetYearTwo": {
                "val": "14.007"
            },
            "BudgetYearThree": {
                "val": "14.136"
            },
            "BudgetYearFour": {
                "val": "14.415"
            },
            "BudgetYearFive": {
                "val": "14.703"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) develops and evaluates hardware and software algorithms enabling enhanced understanding and accelerating the decision cycle time for commanders and leaders operating in a mobile, dispersed, highly networked environment.  Project Y10 supports research on information and communications technology.  \n\nWork in this PE complements and is fully coordinated with efforts in PE 0602705A (Electronics and Electronic Devices), 0602716A (Human Factors Engineering Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), and PE 0603008A (Command, Control, Communications Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL) at the Adelphi and Aberdeen Proving Ground, MD locations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.761"
                },
                "CurrentYear": {
                    "val": "12.656"
                },
                "BudgetYearOne": {
                    "val": "13.811"
                },
                "BudgetYearOneBase": {
                    "val": "13.811"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.514"
                },
                "CurrentYear": {
                    "val": "12.656"
                },
                "BudgetYearOne": {
                    "val": "13.811"
                },
                "BudgetYearOneBase": {
                    "val": "13.811"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.247"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.247"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "Y10"
                    },
                    "ProjectTitle": {
                        "val": "Computer\/Info Sci Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.514"
                        },
                        "CurrentYear": {
                            "val": "12.656"
                        },
                        "BudgetYearOne": {
                            "val": "13.811"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.811"
                        },
                        "BudgetYearTwo": {
                            "val": "14.007"
                        },
                        "BudgetYearThree": {
                            "val": "14.136"
                        },
                        "BudgetYearFour": {
                            "val": "14.415"
                        },
                        "BudgetYearFive": {
                            "val": "14.703"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project develops and characterizes information and communications processing software to automate the delivery of information for planning, rehearsal, and execution by ground commanders. Efforts develop communication\/network architectures, software, and the information fusion software necessary to simplify the understanding and interactions from humans to humans, humans to computers, and computers to humans.  Research enables enhanced understanding of many information sources and accelerates the decision cycle time for commanders and leaders operating in the mobile, dispersed, highly networked environment envisioned for the future force.\n\nWork in this project is fully coordinated with Program Element (PE) 0603008A (Command, Control, Communications Advanced Technology), PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), PE 0603008A (Command, Control, Communications Advanced Technology), and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nThis project supports Army science and technology efforts in the Command, Control, Communications, and Intelligence portfolio.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL), Adelphi and Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Processing"
                                    },
                                    "Description": {
                                        "val": "This effort develops and characterizes fusion software to improve the completeness and timeliness of decision-making for Mission Command.  The goal of this effort is to develop software applicable to the Distributed Common Ground Station – Army (DCGS-A) architecture (an integrated architecture of all ground\/surface systems) and for future force assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.248"
                                            },
                                            "Text": {
                                                "val": "Characterized techniques for predicting crowd attitudes, intent, and behaviors from fused text sources; and developed concepts for integrating social network analysis into Mission Command."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.696"
                                            },
                                            "Text": {
                                                "val": "Examine text analytics techniques for rapid extraction of social and cultural relationship information to increase the accuracy and timeliness of predicting attitudes for use in social network analyses; and characterize the use of crowd sourcing and teaming concepts for analysis in a DCGS-A-like environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.833"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.833"
                                            },
                                            "Text": {
                                                "val": "Will investigate extension of social media analysis techniques to predict adversarial behaviors; and address the issues of incorporating prediction tools into a tactical local cloud computing cluster and the potential to execute these prediction tools within a tactical environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Assurance"
                                    },
                                    "Description": {
                                        "val": "This effort designs and characterizes software for the protection of information and networks in wireless tactical environments. The goal is to develop software algorithms that detect and defeat malicious activities of adversaries in bandwidth constrained tactical networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.207"
                                            },
                                            "Text": {
                                                "val": "Designed and characterized an intrusion prevention architecture that dynamically monitors host and network data to detect, analyze, respond, and protect against unauthorized cyber activity in bandwidth- and power-constrained environments; investigated models that were used to develop and characterize secure protocols that may be used in tactical networks; and explored active protection approaches that may be managed and\/or deployed locally, centrally, or in a distributed environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.562"
                                            },
                                            "Text": {
                                                "val": "Develop and characterize techniques for novel stealthy (i.e., low probability of detection and intercept) information communications for future tactical networks; develop computational tools that provide theoretically-grounded risk assessments and situational awareness by integrating a broad range of information about vulnerability and network structure and roles that is automatically obtained from the network; and design innovative detectors, analyst aids, and prevention\/recovery tools that provide robustness and fight-through capabilities to complex heterogeneous networks that combine a variety of wireless and wired technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.944"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.944"
                                            },
                                            "Text": {
                                                "val": "Will design and characterize techniques of active cyber defense effects to disrupt adversarial command and control of heterogeneous networks while maintaining communication with key cyber terrain assets (i.e., elements of the domain that enable mission essential warfighting functions); explore and validate novel big data analytical approaches to identify and manage risks posed by emerging vulnerabilities; and develop proof-of-concept detection capabilities to identify malicious or anomalous events in a complex, interconnected information environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Exchange"
                                    },
                                    "Description": {
                                        "val": "This effort will develop software that integrates sensor data from local and external information sources and develop text and video analytic approaches to support automated intelligence analysis and decision making. The goal is to enable tactical users to cooperatively share relevant and timely tactical information within a distributed wireless environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.280"
                                            },
                                            "Text": {
                                                "val": "Developed and characterized text, image, and full motion video processing algorithms for use within representative state transfer services operating across a suite of distributed nodes using realistic network connectivity and data sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.270"
                                            },
                                            "Text": {
                                                "val": "Explore text-based techniques, like transfer learning and semantic representation of visual concepts, as a means of overcoming challenges in extracting objects, actions, and context from video; and develop tools to assist with information extraction from various communication modes to include text embedded in video transmissions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.287"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.287"
                                            },
                                            "Text": {
                                                "val": "Will develop quantitative models of trust and quality; explore approaches to applying user context (e.g. mission, cognitive state, trust, and quality) in networked military and social information delivery; and develop text and video analytics from research in PE 0601104A Project H50 (Network Sciences Collaborative Technology Alliance) and Project J15 (Network and Information Sciences International Technology Alliance) along with new internal ARL research and explore its effect on intelligence products."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Language Translation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and assesses computational multilingual algorithms and software frameworks to enable commanders and troops to bridge language barriers in order to counter adversaries and collaborate with allies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.139"
                                            },
                                            "Text": {
                                                "val": "Developed, refined, and tested advanced algorithms to improve machine translation technologies by incorporating data subset selection techniques into algorithms to generalize existing machine translation modules to new domains of military interest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.053"
                                            },
                                            "Text": {
                                                "val": "Implement and validate advanced algorithms that improve machine translation technologies by incorporating data selection techniques into algorithms to generalize existing machine translation  modules; and increase ability to translate low density languages of military interest to include key languages native to Africa."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.647"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.647"
                                            },
                                            "Text": {
                                                "val": "Will explore the use of linguistic analysis to refine the automated interpretation of cultural concepts within multi-lingual information sources; and develop and assess techniques for rapid linguistic analysis and translation of documents written in low-density languages that lack a large body of relevant previously translated texts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Theory"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs theory based software models to characterize and validate emerging network protocols and structures.  The goal of this effort is to develop software algorithms that maintain effective communications in networks in spite of disruptive effects such as task reorganization, mobility of friendly forces, and adversarial attacks on friendly networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.158"
                                            },
                                            "Text": {
                                                "val": "Developed and characterized ultraviolet (UV) communications components that attach to the standard radio frequency (RF) common sensor radio; used simulation to investigate how mobility and autonomy may be exploited to maintain connectivity; and investigated mapping connectivity regions to blend with mobility planning and sensing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "Implement UV communications components that attach to the RF common sensor radio; validate simulation models to investigate how mobility and autonomy may be exploited to maintain connectivity; validate that optical and UV can provide robust non-line-of- sight communications to augment RF communications; and implement mapping connectivity regions to blend with mobility planning and sensing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.415"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.415"
                                            },
                                            "Text": {
                                                "val": "Will implement techniques for adapting communications components at the physical, media access control (MAC), and networking layers to enable robust wireless communications; develop tools for content and software based networking that enable discovery of, access to, and processing of information sources in highly dynamic and contested environments; and explore and create methodologies and approaches to increase the validity of network science experimentation results across contexts, at the appropriate network scale, and with the appropriate fidelity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Heterogeneous Computing and Computational Sciences"
                                    },
                                    "Description": {
                                        "val": "This effort researches and develops software algorithms to allow information processing across different computing hardware platforms.  The goal of this research is to provide high performance computing (HPC) equivalent processing capabilities to the Soldier on the battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.426"
                                            },
                                            "Text": {
                                                "val": "Investigated approaches for computational off-loading to disparate, hybrid cores focused on extracting maximum performance from the parallel nature of many-core pervasive technologies; created new models to describe offered load and computational capacity within local tactical cloud-based services in Army-centric mobile and ad hoc networked devices; and developed software engineering protocols and methods to promote portability while maintaining efficiency with heterogeneous systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.673"
                                            },
                                            "Text": {
                                                "val": "Design an auto-tuning approach to balance performance models for hybrid cores where low-level instruction scheduling is a problem; implement new mathematical algorithm to address placement of mobile HPC in dynamic battlefield networks; and design the problem for heterogeneous networks and quantify minimum communications path lengths (using quantum annealing algorithms) to converge on a solution for optimum distribution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.685"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.685"
                                            },
                                            "Text": {
                                                "val": "Will implement auto-tuning approach to balance performance models on next generation hybrid cores where low-level instruction scheduling is a problem; validate mathematical algorithm to address placement of mobile HPC in dynamic battlefield along with other HPC systems; investigate methods for mitigating bandwidth allocation issues by utilizing emerging memory hierarchies and storage; and create algorithms to quantify resiliency for tactical HPC systems and associated programming models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Material Modeling for Force Protection"
                                    },
                                    "Description": {
                                        "val": "This effort designs and characterizes software to improve parallel processing for computationally intensive physics problems.  The intent is to create a computational science environment to assist researchers from different disciplines to work collaboratively and to exchange models and results."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.056"
                                            },
                                            "Text": {
                                                "val": "Developed and extended capabilities to couple multi-scale\/multi-physics software that will be designed to achieve efficiency across a growing base of computing cores; and investigated the use of domain specific languages to couple novel HPC capabilities within the material modeling domain and facilitate rapid software deployment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.002"
                                            },
                                            "Text": {
                                                "val": "Develop hierarchical multi-scale models for material behavior and design; use multiple parallel model couplings to tie models of different length or time scales together; investigate emerging programming languages for scalability and portability on different HPC computing platforms; and investigate applicability of emerging programming languages for the specific class of multi-physics applications related to underbody blast applications which includes modeling of the Soldier."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}