{
    "id": "66208f144733259938dc4636030979cd32817e0d",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA6_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605712A"
        },
        "ProgramElementTitle": {
            "val": "Support of Operational Testing"
        },
        "R1LineNumber": {
            "val": "151"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "48.953"
            },
            "CurrentYear": {
                "val": "49.337"
            },
            "BudgetYearOne": {
                "val": "49.684"
            },
            "BudgetYearOneBase": {
                "val": "49.684"
            },
            "BudgetYearTwo": {
                "val": "50.745"
            },
            "BudgetYearThree": {
                "val": "53.832"
            },
            "BudgetYearFour": {
                "val": "54.877"
            },
            "BudgetYearFive": {
                "val": "56.360"
            }
        },
        "ProgramElementNote": {
            "val": "Army Joint Test Element (JTE) moved from Program Element 0605898A, Project M65 to 0605712A, Project 001 in FY 2017."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (V02) provides the resources to operate the Army's Operational Test Command (OTC) which conducts independent operational tests that provide significant data to the Army decision-makers on key Army systems and concepts.  This project finances recurring costs for OTC that are essential for conducting realistic and continuous testing in the critical areas of equipment, doctrine, force design and training.  These recurring costs include civilian pay, requirements for test support contracts, temporary duty, training, supplies and equipment.  \n\nOTC consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Integrated Test and Evaluation Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas. These activities support the development and fielding cycle of all Army acquisition programs including rapid fielding initiatives.  The primary mission of these test directorates is to perform detailed planning, execution, and reporting of Initial Operational Test and Evaluation (IOTE), and Force Development Test and Experimentation (FDTE).  Funding is also used to support the planning, execution and reporting of Intelligence and Electronic Warfare operational testing.\n\nThis project (001) also provides funding for the Army Joint Test Element (JTE) which examines Joint Service, Combatant Command (COCOM) and DoD agencies mission gaps, tactics and doctrine resulting in the development of Tactics Techniques and Procedures (TTP), Concept of Operations (CONOPS), and assessment documents.  Products are developed through operational non-materiel solutions to urgent, specific, Joint Warfighter problems. The JTE coordinates and develops nominations for Quick Reaction Tests (QRTs), Joint Feasibility Studies (JFS); serves as the Operational Test Agency (OTA) for Army-led QRTs; and coordinates resources to support Joint Feasibility Studies (JFSs) and chartered Joint Tests (JT) under the Joint Test Unit (JTU) assigned to ATEC as the joint OTA.  The ATEC Commanding General serves as the Executive Steering Committee (ESG) member, while the Executive Director serves as the Technical Advisory Board (TAB) member.  DoDD 5010.41 provides policies and responsibilities for the JTE.  The DA G-8 is the agent for JTE for operations and DoD level Senior Advisory Council (SAC) responsibly.  Mission support also includes the support to two Joint Test Units (JTU) under the re-engineered Joint Test program.  ATEC provides military resource support to Nellis Air Force Base, and Suffolk VA with Officer and Non-Commissioned Officer (NCO) support.  Additional support to Joint Tests remains a requirement until the OSD Chartered projects are completed and transitioned to the respective Sponsoring COCOM."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.217"
                },
                "CurrentYear": {
                    "val": "49.337"
                },
                "BudgetYearOne": {
                    "val": "49.644"
                },
                "BudgetYearOneBase": {
                    "val": "49.644"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "48.953"
                },
                "CurrentYear": {
                    "val": "49.337"
                },
                "BudgetYearOne": {
                    "val": "49.684"
                },
                "BudgetYearOneBase": {
                    "val": "49.684"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.264"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.040"
                },
                "BudgetYearOneBase": {
                    "val": "0.040"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.264"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.040"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.040"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Army Joint Test Element (JTE) moved from Program Element 0605898A, Project M65 to 0605712A, Project 001 in FY 17."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "ATEC Joint Tests And Follow-On Test & Eval"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.077"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.077"
                        },
                        "BudgetYearTwo": {
                            "val": "0.089"
                        },
                        "BudgetYearThree": {
                            "val": "0.114"
                        },
                        "BudgetYearFour": {
                            "val": "0.136"
                        },
                        "BudgetYearFive": {
                            "val": "0.150"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Army Joint Test Element (JTE) moved from Program Element 0605898A, Project M65 to 0605712A, Project 001 starting in FY 17."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides funding for the Army Joint Test Element (JTE) which examines Joint Service, Combatant Command (COCOM) and DoD agencies mission gaps, tactics and doctrine resulting in the development of Tactics Techniques and Procedures (TTP), Concept of Operations (CONOPS), and assessment documents.  Products are developed through operational non-materiel solutions to urgent, specific, Joint Warfighter problems. The JTE coordinates and develops nominations for Quick Reaction Tests (QRTs), Joint Feasibility Studies (JFS); serves as the Operational Test Agency (OTA) for Army-led QRTs; and coordinates resources to support Joint Feasibility Studies (JFSs) and chartered Joint Tests (JT) under the Joint Test Unit (JTU) assigned to ATEC as the joint OTA.  The ATEC Commanding General serves as the Executive Steering Committee (ESG) member, while the Executive Director serves as the Technical Advisory Board (TAB) member.  DoDD 5010.41 provides policies and responsibilities for the JTE.  The DA G-8 is the agent for JTE for operations and DoD level Senior Advisory Council (SAC) member.  Mission support also includes supporting two Joint Tests under the Joint Test program, and assigned special projects.  ATEC provides military resource support to Nellis Air Force Base, and Suffolk VA with Officer and Non-Commissioned Officer (NCO) support.  Additional support to Joint Tests remains a requirement until the OSD Chartered projects are completed and transitioned to the respective Sponsoring COCOM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Joint Test Element (JTE) Management Support"
                                    },
                                    "Description": {
                                        "val": "This project funds Army's Joint Test Element (JTE) which is comprised of civilian and military personnel.  The JTE is required to research COCOM Integrated Priorities, Generate\/Develop\/Support efforts through rigorous COCOM engagements, and provide support during QRT\/JT support through the transition phase at the end of each directed project.  As the OTA, the JTE is responsible to maintain oversight status for the OSD for all directed test efforts. In addition, JTE provides for handbook development for the Warfighter throughout the world in hard copy and in electronic book form."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.077"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.077"
                                            },
                                            "Text": {
                                                "val": "Will fund civilian labor and non-labor requirements such as supplies and travel in support of JTE initiatives, program support from remote JT stations and COCOM engagements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "V02"
                    },
                    "ProjectTitle": {
                        "val": "ATEC Activities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.953"
                        },
                        "CurrentYear": {
                            "val": "49.337"
                        },
                        "BudgetYearOne": {
                            "val": "49.607"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.607"
                        },
                        "BudgetYearTwo": {
                            "val": "50.656"
                        },
                        "BudgetYearThree": {
                            "val": "53.718"
                        },
                        "BudgetYearFour": {
                            "val": "54.741"
                        },
                        "BudgetYearFive": {
                            "val": "56.210"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Operational Test Command (OTC) conducts independent operational tests that provide significant data to the Army decision-makers on key Army systems and concepts.  This program element finances recurring costs for OTC that are essential for conducting realistic and continuous testing in the critical areas of equipment, doctrine, force design and training.  These recurring costs include civilian pay, requirements for test support contracts, temporary duty, training, supplies and equipment.  \n\nOTC consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Integrated Test and Evaluation Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas.  These activities support the development and fielding cycle of all Army acquisition programs including rapid fielding initiatives.  The primary mission of these test directorates is to perform detailed planning, execution, and reporting of Initial Operational Test and Evaluation (IOTE), Limited User Test (LUT), and Force Development Test and Experimentation (FDTE).  USAOTC conducts operational tests required by public law (Title 10 USC 2399) that provide significant data to the Army decision-makers on key Army systems and concepts.  Funding is also used to support the planning, execution and reporting of Intelligence and Electronic Warfare operational testing."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Test Command (OTC) Activities"
                                    },
                                    "Description": {
                                        "val": "Operational costs including: civilian pay, support contracts, temporary duty, supplies and equipment for subordinate elements of the Operational Test Command."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.953"
                                            },
                                            "Text": {
                                                "val": "Operational costs included civilian pay, support contracts, temporary duty, supplies and equipment for the Operational Test Command."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "49.337"
                                            },
                                            "Text": {
                                                "val": "Operational costs included civilian pay, support contracts, temporary duty, supplies and equipment for the Operational Test Command."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.607"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.607"
                                            },
                                            "Text": {
                                                "val": "Operational costs will include civilian pay, support contracts, temporary duty, training, supplies and equipment for the Operational Test Command."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}