{
    "id": "697144261f9b4c0431848b1a43f24f01a3caa8cc",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0305207F"
        },
        "ProgramElementTitle": {
            "val": "Manned Reconnaissance Systems"
        },
        "R1LineNumber": {
            "val": "206"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "14.116"
            },
            "CurrentYear": {
                "val": "13.245"
            },
            "BudgetYearOne": {
                "val": "20.975"
            },
            "BudgetYearOneBase": {
                "val": "20.975"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "14.228"
            },
            "BudgetYearThree": {
                "val": "14.324"
            },
            "BudgetYearFour": {
                "val": "14.589"
            },
            "BudgetYearFive": {
                "val": "14.848"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.516"
                },
                "CurrentYear": {
                    "val": "13.245"
                },
                "BudgetYearOne": {
                    "val": "14.184"
                },
                "BudgetYearOneBase": {
                    "val": "14.184"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.116"
                },
                "CurrentYear": {
                    "val": "13.245"
                },
                "BudgetYearOne": {
                    "val": "20.975"
                },
                "BudgetYearOneBase": {
                    "val": "20.975"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.600"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "6.791"
                },
                "BudgetYearOneBase": {
                    "val": "6.791"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.600"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "6.791"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.791"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015 funding total includes a Below Threshold Reprogramming of $600K for Caldera Event technology.\n\nFY 2017 funding total includes 1) a $7.0M USD\/I Add specifically for COMBAT SENT Baseline upgrade shortfall, and 2) a $209K reduction for inflation rates leading to an overall increase of $6.791M."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674754"
                    },
                    "ProjectTitle": {
                        "val": "RC-135 Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.116"
                        },
                        "CurrentYear": {
                            "val": "13.245"
                        },
                        "BudgetYearOne": {
                            "val": "20.975"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.975"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.228"
                        },
                        "BudgetYearThree": {
                            "val": "14.324"
                        },
                        "BudgetYearFour": {
                            "val": "14.589"
                        },
                        "BudgetYearFive": {
                            "val": "14.848"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The RC-135 operational systems development and enhancement activities support the design studies, engineering analysis, non-recurring engineering, and other efforts associated with the integration and modification of the RC-135 programs and their specialized mission systems, both air and ground.  Associated ground systems include RIVET JOINT Mission Trainers (RJMT, a.k.a. mission crew simulators), Ground Data Processing Systems (GDPS), Distributed Mission Shelters (DMS), Mission Crew Training Systems (MCTS), Airborne Capabilities Extension System (ACES), and the Operational Flight Trainers (OFT, a.k.a. flight deck simulators).  Extensive utilization of Commercial-Off-The-Shelf (COTS) based solutions allows rapid fielding of needed capabilities through upgrades and supports Diminishing Manufacturing Sources (DMS)\/Vanishing Vendor Items (VVI) logistics mitigation efforts.  The results of these efforts provide for preliminary assessments of technical feasibility, operability, or military utility as well as specific engineering implementations for integration into the various systems baseline configurations.  \n\nThese activities are managed by the Air Force through the 645th Aeronautical System Group (645 AESG).  The 645 AESG (a.k.a. BIG SAFARI Systems Program Office or SPO) manages engineering, ground and support systems modifications, integration, flight testing, product assurance, acceptance testing, logistics, and training activities.  \n\nAircraft, sensor systems, and associated ground support system engineering planned for FY 2017 budget includes developmental planning, execution and support for the RC-135V\/W RIVET JOINT Baselines 12 and 13, the RC-135U COMBAT SENT Baselines 5 and 6, and the RC-135S COBRA BALL Baseline 5 and 6 configurations.  The world-wide challenge of keeping pace against technologically agile targets used by both nation and non-nation-state adversaries and the rapid evolution of COTS technologies demands a responsive and adaptive acquisition strategy for fielding incremental spiral upgrades and baseline capabilities that are logistically supportable at all locations.  The BIG SAFARI SPO uses an incremental baseline strategy to mitigate risk, find affordable solutions and field needed capabilities on the aircraft and associated ground support and training systems.  Obsolescence and DMS\/VVI logistical concerns are addressed with each baseline upgrade strategy and assessed annually as part of the fleet sustainment responsibilities.  \n\nRIVET JOINT Baseline 12 upgrades consist of, but are not limited to, increased digital signal exploitation, increased digital signal recorder bandwidth, enhanced spatial processing\/exploitation, enhanced weather radar, digitally enhanced electronic flight instrument system (EFIS), continued Communications, Navigation and Surveillance\/Air Traffic Management (CNS\/ATM) and Required Navigational Performance (RNP) compliant cockpit avionics enhancements, Air Force Distributed Common Ground System (AF-DCGS) interoperability, operator work station 3-D map projection, enhanced operator reporting management tools, modernized communications security (COMSEC) protocols, and a new steerable beam antenna.  RIVET JOINT Baseline 13 upgrades consist of, but are not limited to, providing a continuous recording capability, Super Wideband Compressive Receiver (SWCR) and Nyquist Folding Receiver (NYFR), global air traffic management (GATM) avionics upgrades such as new autopilot, automated data system-broadcast (ADS-B) and Mode 5 identify friendly or foe (IFF) systems, and family of beyond-line-of-sight terminals (FAB-T) advanced extremely high frequency (AEHF) communications suite. \n\nCOMBAT SENT Baseline 5 upgrades consist of, but are not limited to, active ranging and theater networked geo-location (TNG) capability, Proforma search and classification tools, cooling duct and lighting improvements, CORVUS related precision electronic intelligence (ELINT) SWCR enhancements, RJ Baseline 13 communications intelligence (COMINT), upgraded computer architecture, primary sensor measurement system (PRISMS), wideband global satellite (WGS) communications enhanced integration, development of an airborne tracking system, communications upgrade to include Multifunctional Information Distribution System Joint Tactical Radio System (MIDS-J), and continued Communications, Navigation and Surveillance\/Air Traffic Management (CNS\/ATM) and Required Navigational Performance (RNP) compliant cockpit avionics enhancements.  COMBAT SENT Baseline 6 developmental enhancements consist of, but are not limited to, steerable beams for the COMINT sub-system, improved SWCR capability and specific emitter ID\/SET ELINT sub-system, PRISMS merge with manual precision collections, millimeter wave and low band capabilities with PRISMS, digitizing antennas, direction finding of High Frequency signals and expanded streaming audio services and 360 degree aircraft tracking system.\n\nCOBRA BALL Baseline 5 upgrades consist of, but are not limited to, RJ Baseline 11 COMINT, Medium-Wave Infra-Red Acquisition (MIRA) sensor\/processor upgrade, measurements and signature intelligence (MASINT) Collection System (MCS) optical upgrade, WGS communications enhanced integration, communications upgrades to include MIDS-J and an intercom system (FORCE), U-Band antenna, continued CNS\/ATM and RNP compliant cockpit avionics enhancements, and foreign instrumentation intelligence (FISINT) system refresh.  COBRA BALL Baseline 6 developmental enhancements consist of, but are not limited to, high gain S-Band antenna, large format Sapphire windows, RJ Baseline 13 COMINT capability, FISINT analog to digital receiver, and Brave version of the digital cockpit avionics systems to continue CNS\/ATM and RNP compliance initiatives.          \n\nActivities also include studies and analysis to support both current program planning and execution and future program planning.  \n\nThis program is in Budget Activity 7, Operational Systems Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production fielding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Baseline Configuration Development"
                                    },
                                    "Description": {
                                        "val": "Non-recurring engineering (NRE) for Baseline system developments and enhancements to improve mission capabilities of the RIVET JOINT Baselines 12 and 13 (BL-12 and BL-13), COMBAT SENT Baselines 5 and 6 (BL-5 and BL-6) and COBRA BALL Baselines 5 and 6 (BL-5 and BL-6)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.116"
                                            },
                                            "Text": {
                                                "val": "• Continued Design Studies\n• Continued Engineering Analysis\n• Continued Non-Recurring Engineering (NRE) and other efforts associated with the integration and modification of the RC-135 primary mission equipment\n• Continued Specialized Mission Systems development for the collection of both air and ground signals to include conducting a limited objective, quick reaction capable-like experiment of the emerging Caldera Event technology on a currently deployed mission aircraft in the PACOM area of responsibility"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.245"
                                            },
                                            "Text": {
                                                "val": "• Will continue Design Studies\n• Will continue Engineering Analysis\n• Will continue Non-Recurring Engineering (NRE) and other efforts associated with the integration and modification of the RC-135 primary mission equipment\n• Will continue Specialized Mission Systems development for the collection of both air and ground signals to include assessing the mission impact analysis of the Caldera Event technology demonstrated in FY 2015"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.975"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.975"
                                            },
                                            "Text": {
                                                "val": "Will initiate new contracts to:\n• Continue Engineering Analysis\n• Continue Non-Recurring Engineering (NRE) and other efforts associated with the integration and modification of the RC-135 primary mission equipment\n• Continue Specialized Mission Systems development for the collection of both air and ground signals."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: DARP01"
                                    },
                                    "Title": {
                                        "val": "Modification of Inservice Aircraft"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "163.346"
                                        },
                                        "CurrentYear": {
                                            "val": "165.715"
                                        },
                                        "BudgetYearOne": {
                                            "val": "211.438"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "211.438"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "201.237"
                                        },
                                        "BudgetYearThree": {
                                            "val": "184.779"
                                        },
                                        "BudgetYearFour": {
                                            "val": "188.189"
                                        },
                                        "BudgetYearFive": {
                                            "val": "191.658"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA06: DARP01"
                                    },
                                    "Title": {
                                        "val": "Aircraft Spares and Repair Parts"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "57.119"
                                        },
                                        "CurrentYear": {
                                            "val": "51.958"
                                        },
                                        "BudgetYearOne": {
                                            "val": "47.734"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "47.734"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.396"
                                        },
                                        "BudgetYearThree": {
                                            "val": "49.927"
                                        },
                                        "BudgetYearFour": {
                                            "val": "50.848"
                                        },
                                        "BudgetYearFive": {
                                            "val": "51.785"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA04: 846070"
                                    },
                                    "Title": {
                                        "val": "Defense Airborne Recce Projects (DARP) RC-135"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24.710"
                                        },
                                        "CurrentYear": {
                                            "val": "25.072"
                                        },
                                        "BudgetYearOne": {
                                            "val": "25.287"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.287"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "25.739"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.191"
                                        },
                                        "BudgetYearFour": {
                                            "val": "26.653"
                                        },
                                        "BudgetYearFive": {
                                            "val": "27.132"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E: BA07: PE 0304260F"
                                    },
                                    "Title": {
                                        "val": "RC-135 Airborne SIGINT Enterprise Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.007"
                                        },
                                        "CurrentYear": {
                                            "val": "41.846"
                                        },
                                        "BudgetYearOne": {
                                            "val": "39.756"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "39.756"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "59.535"
                                        },
                                        "BudgetYearThree": {
                                            "val": "50.938"
                                        },
                                        "BudgetYearFour": {
                                            "val": "40.984"
                                        },
                                        "BudgetYearFive": {
                                            "val": "42.509"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The RC-135 RIVET JOINT, COBRA BALL, and COMBAT SENT configured aircraft are maintained and kept technologically relevant through a baseline or incremental upgrade acquisition strategy.  Technology upgrades and quick reaction capability (QRC) developments are acquired through the 645th Aeronautical Systems Group (AESG) in accordance with the BIG SAFARI Program Management Directive (PMD) and Class Justification and Approval (J&A) document for acquisition of supplies and services using an \"other than full and open competition\" criteria.  The supplies and services procured by 645 AESG satisfy National Security requirements (FAR 6.302-6) through the use of their standing J&A or address Unusual and Compelling Urgency requirements (FAR 6.302-2) through an individually prepared J&A supported by the BIG SAFARI Life Cycle Management Plan (LCMP) across the full spectrum of system life cycle management from developmental engineering to system retirement (\"cradle to grave\") support.  Due to the ever changing threat and rapidly evolving electromagnetic combat environment encountered during our prolonged commitment to Overseas Contingency Operations (OCO) and the global war on terrorism, the acquisition program manager has the authority to redirect funding as necessary to meet current stated and emerging Combatant Commander (CCMD) and\/or Intelligence Community (IC) requirements to better meet the war fighting objectives."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "RC-135 Program Manager has determined that programmed management administration (PMA) cost will be funded with RIVET JOINT APAF appropriation and included in the DARP01 P-Doc, Mod 4263."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "All activity is based around the Programmed Depot Maintenance (PDM) airframe and missions systems schedule which includes multiple contracts and organizations with overlapping and continuous periods of performance.  Due to the rapidly changing threat environment encountered during our prolonged commitment to Overseas Contingency Operations (OCO), the acquisition program manager has the authority to redirect funding as necessary to meet current stated and emerging CCMD and\/or IC requirements."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Aircraft Modifications"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L-3 Com"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Greenville, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "14.116"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.245"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "20.975"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "20.975"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "RIVET JOINT Baseline 11 Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RIVET JOINT Baseline 12 Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RIVET JOINT Baseline 12 Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RIVET JOINT Baseline 13 Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RIVET JOINT Baseline 13 Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COMBAT SENT Baseline 5 Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COMBAT SENT Baseline 6 Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COMBAT SENT Baseline 6 Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COBRA BALL Baseline 5 Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COBRA BALL Baseline 6 Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COBRA BALL Baseline 6 Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ground Systems Baseline 11 Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ground Systems Baseline 12 Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ground Systems Baseline 13 Development, Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}