{
    "id": "6a11c732eae2184571d928c04af12b5c7a6a786f",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA3_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603005A"
        },
        "ProgramElementTitle": {
            "val": "Combat Vehicle and Automotive Advanced Technology"
        },
        "R1LineNumber": {
            "val": "33"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "143.606"
            },
            "CurrentYear": {
                "val": "135.571"
            },
            "BudgetYearOne": {
                "val": "122.132"
            },
            "BudgetYearOneBase": {
                "val": "122.132"
            },
            "BudgetYearTwo": {
                "val": "126.724"
            },
            "BudgetYearThree": {
                "val": "126.189"
            },
            "BudgetYearFour": {
                "val": "130.573"
            },
            "BudgetYearFive": {
                "val": "133.397"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures, integrates and demonstrates combat and tactical vehicle automotive technologies that enable a lighter, more mobile and more survivable force. This PE executes the Army's Combat Vehicle Prototyping (CVP) program to mature, integrate and demonstrate ground vehicle leap ahead technologies in support of future combat vehicles. Project 221 matures, integrates and demonstrates protection and survivability technologies such as active protection systems (APS), advanced vehicle armors, blast mitigation and occupant safety devices to address both current and emerging advanced threats to ground vehicles. Project 441 matures and demonstrates advanced ground vehicle power and mobility technologies such as powertrains, power generation and storage, water and fuel logistics, and running gear subsystems for military ground vehicles to enable a more efficient, mobile and deployable force. Project 497 matures, integrates, and demonstrates vehicle electronics hardware (computers, sensors, communications systems, displays, and vehicle command\/control\/driving mechanisms) and software that result in increased crew efficiencies, vehicle performance, reduced size, weight, and power (SWaP) burdens and vehicle maintenance costs. Project 515 matures and demonstrates unmanned ground vehicle (UGV) technologies with a focus on sensors, perception hardware and software, and robotic control algorithms that enable UGV systems to maneuver on- and off-road at speeds which meet mission requirements with minimal human intervention.  \n \nWork in this PE is coordinated with, PE 0602105A (Materials), 0602120A (Sensors and Electronic Survivability, Robotics Technology), 0602601A (Combat Vehicle and Automotive Technology), 0602618A (Ballistics Technology), 0602624A (Weapons and Munitions Technology), 0602705A (Electronics and Electronic Devices), 0602784 (Military Engineering Technology), 0603001A (Warfighter Advanced Technology), 0603004A (Weapons and Munitions Advanced Technology), 0603005 (Combat Vehicle and Automotive Advanced Technology), 0603125A (Combating Terrorism Technology Development), 0603270A (Electronic Warfare Technology), 0603313A (Missile and Rocket Advanced Technology), 0603734 (Military Engineering Advanced Technology), 0604115A (Technology Maturation Initiatives), and 0708045A (Manufacturing Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n \nWork in this PE is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, Michigan."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "147.485"
                },
                "CurrentYear": {
                    "val": "113.071"
                },
                "BudgetYearOne": {
                    "val": "118.252"
                },
                "BudgetYearOneBase": {
                    "val": "118.252"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "143.606"
                },
                "CurrentYear": {
                    "val": "135.571"
                },
                "BudgetYearOne": {
                    "val": "122.132"
                },
                "BudgetYearOneBase": {
                    "val": "122.132"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.879"
                },
                "CurrentYear": {
                    "val": "22.500"
                },
                "BudgetYearOne": {
                    "val": "3.880"
                },
                "BudgetYearOneBase": {
                    "val": "3.880"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "22.500"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.565"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.314"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.880"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.880"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "221"
                    },
                    "ProjectTitle": {
                        "val": "Combat Veh Survivablty"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "51.694"
                        },
                        "CurrentYear": {
                            "val": "55.476"
                        },
                        "BudgetYearOne": {
                            "val": "63.269"
                        },
                        "BudgetYearOneBase": {
                            "val": "63.269"
                        },
                        "BudgetYearTwo": {
                            "val": "64.465"
                        },
                        "BudgetYearThree": {
                            "val": "63.389"
                        },
                        "BudgetYearFour": {
                            "val": "64.133"
                        },
                        "BudgetYearFive": {
                            "val": "64.059"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, integrates and demonstrates protection and survivability technologies such as active protection systems (APS), advanced vehicle armors, blast mitigation and occupant safety devices to address both current and emerging advanced threats to ground vehicles. This project integrates complimentary survivability technologies to enable advanced protection suites, providing greater survivability and protection against emerging threats. This project executes the Army's APS program to mature and demonstrate APS technologies in order to increase protection against current and emerging advanced threats while maintaining or reducing vehicle weight by reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection and active countermeasures. This project develops an APS Common Architecture that defines the component interface standards and component specifications enabling adaptable APS solutions that can be integrated across Army vehicle platforms as required. \n\nWork in this project supports the Army Science and Technology Ground Maneuver Portfolio. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this project is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, Michigan in collaboration with the Army Research Laboratory (ARL), Adelphi and Aberdeen Proving Grounds, MD, Armament Research, Development and Engineering Center (ARDEC), Picatinny, NJ, Aviation and Missile Research, Development and Engineering Center (AMRDEC), Huntsville, AL and Communications-Electronics Research, Development and Engineering Center (CERDEC), Aberdeen Proving Grounds, MD and Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vision Protection:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and integrates devices to protect occupant's eyes, vehicle cameras and electro-optic fire control systems against anti-sensor laser devices as well as reduces the sensor's optical signature. Anti-sensor laser devices can deny vision either temporarily by flooding the sensor with too much light (jamming) or permanently by damaging the sensor. These jamming or damaging effects can slow our battle tempo, disrupt fire control solutions, or prevent vehicles from completing their mission. This effort focuses on demonstrating the effectiveness of optical systems that protect sensors and Warfighter vision from pulsed, continuous wave and future laser threats to maintain fire control capability and situational awareness. Coordinated work is also being performed in Program Elements (PEs) 0602120A, 0602705A, 0602712A, and 0602786A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.120"
                                            },
                                            "Text": {
                                                "val": "Continued vulnerability studies to determine the energy levels required to make pixels, columns and the entire focal plane of an electro-optical (day-camera) ineffective. Matured concepts for integrating protection materials into the optical path of electro-optical (day-camera) sensors, and evaluated the effects of sensor exposure to pulsed-laser threats on the survivability of the sensors to continue the fire control mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.959"
                                            },
                                            "Text": {
                                                "val": "Mature optical power-limiting materials to improve protection of camera sensors from laser energy. Evaluate the power-limiting materials protection capability against low-powered continuous wave and short-pulsed laser threats. Integrate the power-limiting material onto a current fire-control sensor and determine the improved survivability of the sensor against near term laser threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will begin vulnerability evaluation of current systems against ultra-short pulse laser threats; will evaluate high energy laser threats to determine their threat parameters for testing sensors against the threats; using the threat parameters will improve the experiment and performance validation methodology for sensors and protection concepts against high energy laser threat weapons; and will fabricate components of the ultra-short pulse laser protection concepts that will be integrated into current systems for performance demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armor Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, fabricates, integrates and evaluates advanced ground vehicle armor systems such as emerging base armor, appliqué armor, multifunctional armor systems (embedded antennas and health monitoring devices); matures scalable \/ modular \/ common armor system integration design standards; creates armor system test & evaluation standards; refines armor modeling and simulation system engineering process. This effort is done in coordination with efforts in PEs 0602105A, 0602601A, 0602618A, and 0708045A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.952"
                                            },
                                            "Text": {
                                                "val": "Evaluated the performance differences between different transparent armor solutions and determined if additional testing is required to ensure consistent performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Armor Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, fabricates, integrates and evaluates advanced ground vehicle armor systems such as advanced passive kinetic energy armor, explosive reactive armor, electromagnetic armor, and adaptive armor. The goal is to optimize armor system technologies and integration methodologies to reduce overall armor system weight; create and mature scalable \/ modular \/ common armor system integration standards for the advanced armor technologies; create armor system test & evaluation standards for advanced armor technologies and leverages the standards for armor component and armor system maturation; refines armor modeling and simulation system engineering process to incorporate advances in armor technologies. This effort is done in coordination with efforts in PEs 0602105A, 0602601A, 0602618A, and 0708045A."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.673"
                                            },
                                            "Text": {
                                                "val": "Begin armor integration approaches to help achieve an overall ground vehicle armor subsystem weight reduction of 10-15%. Demonstrate advanced passive and explosive reactive armor technologies and design approaches for defeat of kinetic energy threats, chemical energy threats, and improvised explosive devices. Demonstrations include environmental testing followed by ballistic testing of advanced armor components. Mature advanced passive armor system design for integration of the armor technology components and attachment schemes. Mature advanced explosive reactive armor system design for integration of the armor component technologies. Mature weight optimization methods for holistic vehicle lightweighting that supports and complements the vehicle armor systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.679"
                                            },
                                            "Text": {
                                                "val": "Will complete environmental and ballistic performance testing of the advanced passive (B-kit) and explosive reactive armor (C-kit) technologies; will complete the demonstration of advanced passive (B-kit) and explosive reactive armor (C-kit) attachment schemes; will leverage the demonstration results to define the design approach for follow-on integration and testing of the B-kits and C-kits."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Occupant Centric Protection (OCP) Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and validates design philosophies, guidelines, military standards, handbooks, etc. that embody a focused, systems engineering approach to occupant-centric protection in vehicle design. This is accomplished using tools such as modeling and simulation (M&S), full vehicle and subsystem demonstrators, evaluations and component optimizations. This effort addresses and validates the products from requirements generation through design and build to incorporate occupant-centric philosophies. This effort is done in coordination with efforts in PEs 0602601A and 0602618A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.315"
                                            },
                                            "Text": {
                                                "val": "Continued integration and demonstration of occupant protection components such as seats, restraints and energy absorbing materials into subsystem demonstrators and OCP vehicle demonstrators. Continued analysis of performance of OCP subsystems and demonstrators; began subsystem and integrated OCP vehicle live-fire testing to simulate under-body blast events and identified and documented a rigorous analytical approach to balance protection with mobility\/weight goals; continued development and refinement of occupant-centric standards, guidelines and procedures\/processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.957"
                                            },
                                            "Text": {
                                                "val": "Mature passive and active levels of occupant-centric protection technologies for combat vehicle survivability. Optimize combat vehicle survivability demonstrator designs using modeling and simulation to include the integration of a lightweight structure design, and occupant protection component technologies. Conduct optimization to balance weight, mobility and performance goals. Verify occupant-centric design guidelines and procedures\/processes. Evaluate the performance of the initial Warrior Injury Assessment Manikin Project (WIAMan) test device in a simulated test environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.934"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.934"
                                            },
                                            "Text": {
                                                "val": "Will validate the design of advanced flooring, advanced seating, lightweight hulls and structures, and active blast technologies that minimize weight impact while maximizing performance capability provided through modeling and simulation and component technology performance testing in both the laboratory and in blast tests; will use knowledge gained through testing of the initial WIAMan test device to mature and fabricate a next generation WIAMan test device; conduct WIAMan device testing based on the test certification procedures developed in PE 0602601A to inform updates to the WIAMan test capability requirements documentation and materiel solution design specifications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast Mitigation:"
                                    },
                                    "Description": {
                                        "val": "This effort fabricates and matures advanced survivability and protection components, tools and subsystems for enhanced protection against vehicle mines, improvised explosive devices (IEDs) and other underbody blast threats, and vehicle collision and rollover events that result from blast events. This effort also integrates and improves occupant protection technologies such as seats and restraints. This effort creates the laboratory capability needed to enable expeditious performance evaluation through M&S, experimentation and instrumented test of blast-mitigating technologies in such areas as active and passive exterior\/hull\/cab\/kits, interior energy absorbing capabilities for seats, floors, restraints, and sensors for active blast mitigating technologies. This effort is done in coordination with efforts in PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.799"
                                            },
                                            "Text": {
                                                "val": "Integrated advanced passive and active technologies such as active blast countermeasures, energy absorbing materials and floor designs to mitigate the effects of underbody blast threats; conducted impact and blast tests to evaluate the integration methods for exterior and interior blast mitigation technologies onto components, and sub-systems; characterized performance to build greater knowledge for occupant-centric blast mitigation design guidelines\/standards, M&S tools, test procedures, laboratory processes, experimentation capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.312"
                                            },
                                            "Text": {
                                                "val": "Mature and integrate the next generation of seats, restraints, and flooring technologies to mitigate underbody blast effects to the occupant in Combat Vehicle Prototyping (CVP) program concepts. Demonstrate the CVP concepts' performance using modeling and simulation along with sub-system level blast tests. Validate integration methods for blast mitigation technologies onto a combat vehicle platform. Exploit technologies to increase neutralization effectiveness rates against anti-tank mines while maintaining host platform mobility and reliability characteristics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.633"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.633"
                                            },
                                            "Text": {
                                                "val": "Will complete the integration analysis of advanced seats and restraints, advanced flooring, lightweight hulls, and active blast technologies to identify the optimized integrated design approach; will integrate the optimized technologies into the subsystem demonstrator design and leverage the design approach to maximize performance while minimizing subsystem weight; will conduct modeling and simulation on the subsystem design to verify performance prior to subsystem fabrication; will improve technologies to increase neutralization effectiveness rates against anti-tank mines based on the exploitation previously conducted."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Fire Protection:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates technologies to minimize vehicle and crew vulnerabilities to fires in current and future military ground vehicles. Supporting technologies include M&S, sensor systems, software, chemical agents, fire-resistant materials and hardware components. This effort is done in coordination with efforts in PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.063"
                                            },
                                            "Text": {
                                                "val": "Conducted system-level evaluation of common crew Automated Fire Extinguishing System (AFES) technologies and utilized the analysis to develop component specifications for common crew AFES; continued to investigate integration opportunities of common crew AFES to enable AFES commonality across vehicle fleet; and demonstrated technologies to mitigate injuries and improve damage mitigation due to thermal events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.643"
                                            },
                                            "Text": {
                                                "val": "Improve designs and technologies to minimize vehicle and crew vulnerabilities to fires. Evaluate next generation materials, components and system level technologies to address emerging military ground vehicle thermal threats. Validate AFES designs using M&S and testing to improve integration for current and new vehicle configurations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.903"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.903"
                                            },
                                            "Text": {
                                                "val": "Will evaluate fire protection technologies through modeling and simulation and laboratory testing; will complete validation of AFES designs and a common fire extinguisher; will begin concept evaluation of crew compartment protection through the use of advanced fire protection technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hit Avoidance Architecture:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the Army's APS Common Architecture that defines the component interface standards and component specifications enabling adaptable APS solutions that can be integrated into multiple Army vehicle platforms. This effort matures an evaluation test-bed to enable maturation of the APS Common Architecture. This effort helps inform requirements of fielding APS including to: develop safety release criteria, identify vehicle integration constraints and engage potential operators to determine how hit avoidance will impact techniques, tactics and procedures. This effort is done in coordination with efforts in PEs 0602601A, 0602618A, 0603004A, 0603270A, and 0603313A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "Continued APS Common Architecture maturation to include an APS common controller. Integrated and fabricated software and hardware for the common controller, enabling integration of active protection components that accommodated varying performance and vehicle needs. Began integration with Hit Avoidance Technologies and conducted hardware-in-the-loop analyses to validate common controller meets APS interface requirements. Conducted soft-kill countermeasure environmental and live-fire assessments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hit Avoidance Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates hard-kill (physical countermeasure) and soft-kill (non-kinetic countermeasure such as electronic jamming or spoofing) APS components and integrated systems to verify the APS Common Architecture and reduce integrating risk on current systems. In demonstrating hard-kill and soft kill-active protection technologies, requirements and specifications will be matured for future integration onto tactical and combat vehicle platforms. This effort is coordinated with efforts in PEs 0602601A, 0602618A, 0603004A, 0603270A, 0603313A, and 0604115A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.945"
                                            },
                                            "Text": {
                                                "val": "Matured and integrated the soft-kill countermeasure with the APS Common Architecture and modular APS common controller to demonstrate soft-kill defeat of anti-tank guided missiles on a combat vehicle. Verified the soft-kill countermeasure is compliant with the APS Common Architecture interface standards. Matured and integrated a hard-kill active protection system demonstrator using the APS Common Architecture and APS common controller and hard-kill tracking sensors and countermeasures that are matured and compliant with the architecture interfaces and protocols. Enhanced hard-kill and soft-kill simulation and hardware-in-the-loop evaluation capability to exercise and test software and hardware components to inform requirements and determine trade space for hit avoidance technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.932"
                                            },
                                            "Text": {
                                                "val": "Continue maturation of the modular APS common architecture, and maturation of the modular APS common controller. Continue software and hardware maturation for the APS common controller, enabling integration of active protection components that accommodate varying performance and vehicle needs. Enhance soft-kill and hard-kill simulation and laboratory capability to exercise and test software and hardware components against design requirements and determine trade space for APS configurations. Continue to mature a modular architecture APS configuration with soft-kill and hard-kill capabilities by integrating sensors and countermeasures that are matured and compliant with the APS common architecture interfaces and protocols. Conduct virtual and physical demonstrations of a modular architecture APS soft-kill configuration defeat capability against anti-tank guided missiles at the subsystem level."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.924"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.924"
                                            },
                                            "Text": {
                                                "val": "Will continue the design and build of the soft-kill  and hard-kill modular APS common controller; will complete integration of a soft-kill APS configuration on a demonstrator platform to conduct performance and safety testing of the soft-kill demonstrator against anti-tank guided missiles in various environmental conditions; will conduct hard-kill sensor and countermeasure component testing to validate component performance; will complete integrated hard-kill and soft-kill APS configuration laboratory simulation and component hardware-in-the-loop testing to verify component and system-level performance; will conduct integrated subsystem virtual and physical testing to evaluate integrated system performance; will begin the design of the hard-kill and soft-kill APS configuration to be integrated onto a demonstrator."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System Design Optimization for Lightweighting:"
                                    },
                                    "Description": {
                                        "val": "This effort will focus on optimization of platform design to reduce weight in both traditional and novel methods. This effort will demonstrate best practices in cost-conscious, multi-material design for components to reduce ground vehicle weight, as well as demonstrate holistic weight reduction with informed system and component-level design decisions. This will be accomplished by using and evaluating design tools, advanced materials, manufacturing processes and assembly technologies to design lightweight systems, develop lightweight components and enhance the ability to use novel approaches for lightweighting. This effort leverages lessons learned from prior and ongoing individual component efforts within industry, academia and DoD. This effort is done in coordination with efforts in PEs 0602601A, 0602618A, 0603005A, and 0708045A."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.196"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.196"
                                            },
                                            "Text": {
                                                "val": "Will use the Computer Aided-Design for Fabrication of Advanced Materials (CADFAM) tools to develop new or re-engineer existing components such as floors, engine housing, turret  with geometric and loading constraints out of advanced materials (e.g. composites) in order to save weight while maintaining or increasing performance. Will mature non-structural lightweight techniques and implement into a lightweighting process; will begin to apply to components to optimize their design for lightweighting."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "441"
                    },
                    "ProjectTitle": {
                        "val": "Combat Vehicle Mobilty"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.681"
                        },
                        "CurrentYear": {
                            "val": "43.381"
                        },
                        "BudgetYearOne": {
                            "val": "39.067"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.067"
                        },
                        "BudgetYearTwo": {
                            "val": "38.613"
                        },
                        "BudgetYearThree": {
                            "val": "39.105"
                        },
                        "BudgetYearFour": {
                            "val": "42.328"
                        },
                        "BudgetYearFive": {
                            "val": "44.566"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates advanced mobility and onboard electrical power technologies for combat and tactical vehicles to enable lightweight, agile, deployable, fuel efficient and survivable ground vehicles. Technologies include advanced propulsion, engines, transmissions, power, and electrical components and subsystems. This project will also mature and demonstrate advanced mechanical and electrical power generation systems to increase available onboard electrical power to enable future capabilities such as next generation communications and networking, improvised explosive device (IED) jamming systems and next generation sensor devices can be supported on combat and tactical vehicles. This project also matures and demonstrates water and fuel logistics technologies.\n\nWork in this project supports the Army Science and Technology Ground Maneuver Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI, in conjunction with Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Onboard Vehicle Electric Power Component Development:"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on meeting the Army's demand for more onboard vehicle electric power to enable technologies such as advanced survivability systems, situational awareness systems and the Army network. This effort matures, integrates and demonstrates onboard vehicle power (OBVP) components to include electrical power generation machines and associated power converters  such as high temperature inverters and converters, advanced control algorithms, and high efficiency power conversion (mechanical to electrical) components. Additionally, it matures and integrates advanced electric machines such as Integrated Starter Generator (ISG) and their controls for mild hybrid (system that integrates electric machines to assist internal combustions engines for propulsion) electric propulsion and high power electric generation. Coordinated work is also being conducted under Program Element (PE) 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.278"
                                            },
                                            "Text": {
                                                "val": "Evaluated combat vehicle performance with integrated OBVP technologies that verify they provide adequate onboard electrical power to enable future communications, networking, IED jamming and sensors; implemented OBVP and hybrid component control approaches to minimize vehicle performance impacts while generating significant electrical power."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.401"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate OBVP technologies to include inverters and generators for high temperature operation capability, power quality and the ability to provide more compact, power dense electrical power generation. Demonstrate power technologies to enable application of advanced technologies to vehicles including electromagnetic armor, communications and other technologies enhancing combat vehicle lethality, survivability and situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.701"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.701"
                                            },
                                            "Text": {
                                                "val": "Will fabricate and evaluate at a subsystem level, the integrated starter generator (ISG), inverter power conversion box and control strategy for an advanced OBVP system that provides 10 times more electrical power onboard combat vehicles than is available today. Will begin to integrate the components into a system integration laboratory (SIL) for system optimization testing and initial performance and reliability evaluation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Running Gear:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates running gear components and advanced suspension technologies to increase vehicle mobility and durability in response to increased ground vehicle platform weights. Components and subsystems include new elastomer compounds, lightweight, survivable track systems and road wheels, advanced compensating track tensioners, advanced damping suspension technologies, Electronic Stability Control (ESC) systems, and preview sensing technologies linked to advanced suspension designs. Coordinated work is also being conducted under PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.672"
                                            },
                                            "Text": {
                                                "val": "Fabricated, installed and tested an external suspension system for a 60-70 ton combat application to evaluate system durability and reliability as well as vehicle performance characteristics; molded high capacity, lightweight track compounds for heavy (60-70 ton) combat vehicle systems and performed vehicle testing to demonstrate the durability and rolling resistance reductions of these compounds; modeled suspension control architectures for system control of vehicle dynamics, ride and handling."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.004"
                                            },
                                            "Text": {
                                                "val": "Improve elastomer materials and road wheels to demonstrate improved combat vehicle track system durability. Continue fabrication, integration and optimization of external suspension unit system for 60-70 ton combat vehicle application. Mature suspension control architectures for system control of vehicle dynamics, ride height and handling. Characterize combat vehicle external suspension unit functionality, durability and system performance relative to performance metrics. Execute track and suspension maturation efforts in support of the Combat Vehicle Prototyping program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.576"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.576"
                                            },
                                            "Text": {
                                                "val": "Will integrate improved elastomer components and lessons learned from previous track system evaluations to create an advanced track system design for a medium combat vehicle application that reduces system weight while increasing durability. Will design and build an external suspension unit based on results of previous system characterizations to increase durability, provide ride height control and improve ride quality performance for medium combat vehicles. Will begin the integration of advanced track and suspension for a medium combat vehicle running gear solution to provide superior off-road performance at a reduced weight and improved durability to currently fielded solutions"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Vehicle Subsystem Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort contributes to the Army's ground platform risk reduction efforts which seek to address technical and integration challenges in the areas of mobility, survivability, and vehicle architecture and systems integration. The primary focus of this activity is to mature and demonstrate a series of subsystem demonstrators building off of previous investment in ground combat acquisition and technology programs with the purpose of maturing key technologies to refine and inform future platform requirements and reduce risks in critical ground combat vehicle technology areas. Specifically, this effort focuses on maturing and demonstrating ground combat vehicle mobility technologies such as powertrain subsystems and systems integration technologies such as vehicle structures and concept demonstrators. This effort seeks to optimize platform efficiency and growth potential to ensure the combat fleet is able to accept new technologies as they are developed to bring advanced capability for the Warfighter. This effort is executed in coordination with PEs 0602601A, 0602618A, 0603004A, and 0603125A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.671"
                                            },
                                            "Text": {
                                                "val": "Matured, integrated and evaluated emerging ground vehicle subsystem and component technologies for mobility, survivability and systems integration such as advanced transmission, flooring and vehicle structures to establish subsystem and component performance baselines. Analyzed the influence of emerging ground vehicle subsystem technologies on future integrated combat vehicle designs and concepts. Conducted modeling, analysis and trade studies for next-generation ground vehicle subsystems. Assessed developmental and existing critical technology areas such as mobility, survivability and vehicle structures for optimal platform configuration. Conducted laboratory assessment of multiple vehicle powertrain subsystems and configurations such as engines and transmissions including both conventional and hybrid powertrain approaches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.031"
                                            },
                                            "Text": {
                                                "val": "Mature the design of a unique high power density, low heat rejection, fuel efficient opposed piston engine concept through the use of advanced lightweight materials and optimization of in-cylinder combustion performance and efficiency to inform future combat vehicle concept development and analyses and its future powertrain subsystem demonstrator. Optimize engine fuel efficiency and increase commonality of engine components to reduce engine logistical and life cycle costs. Develop novel future combat vehicle concepts for the Combat Vehicle Prototyping (CVP) program leveraging leap-ahead technologies and technology concepts. Conduct capability analyses and trade studies on the integration of vehicle mobility and occupant protection technologies into the CVP concepts, in order to optimize the platform configuration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Text": {
                                                "val": "Will continue to mature novel future combat vehicle concepts leveraging advanced technologies and technology concepts to include requirements excursions to mature innovative combat vehicle design approaches. Will continue to conduct capability analyses and trade studies on the integration of vehicle mobility and occupant protection technologies into combat vehicle concepts, in order to evaluate and optimize concept platform configurations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Storage Systems Development:"
                                    },
                                    "Description": {
                                        "val": "The goal of this work is to mature energy storage systems to both enable silent watch capability and increased survivability through power brick energy storage components for pulse power electromagnetic armor. This is accomplished through the maturation and demonstration of advanced ground vehicle energy storage devices such as advanced chemistry batteries, high energy density capacitors and power brick batteries for pulse power. This effort leverages commercial industry battery development efforts to reduce battery volume and weight while improving their energy and power densities. This effort also matures and optimizes a common specification for battery management systems to improve the battery state of charge indicator accuracy and battery state of health information to reduce the frequency of battery replacement and optimize starting, lighting, and ignition functions. Coordinated work is also being conducted under PEs 0602601A and 0602705A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.627"
                                            },
                                            "Text": {
                                                "val": "Optimized the improved second generation power brick battery for pulse power electro-magnetic armor system to evaluate power brick battery performance and ensure it meets military specifications; leveraged power brick battery design and testing to create concepts for modular, standardized new high energy, high voltage advanced batteries for mobility applications; and generated common performance specifications for power brick and standardized high voltage battery systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.926"
                                            },
                                            "Text": {
                                                "val": "Mature standardize low voltage battery systems to improve fuel efficiency and support vehicle lightweighting. Mature control electronics and battery management system for advanced, standardized, military specific batteries to improve durability and reliability. Optimize advanced, standardized, military specific battery system for increased energy density and reliability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.050"
                                            },
                                            "Text": {
                                                "val": "Will leverage the cell-level durability and performance testing in PE 0602601A to mature the advanced Lithium-ion battery system-level design to meet military vehicle form factor (6T) in order to improve energy storage capacity while reducing battery system weight on platforms.  Will leverage ongoing battery cell level development to begin battery module (system-level) integration and evaluation focusing on interconnects, packaging design and control strategies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pulse Power:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates high energy, compact pulse power components, subsystems and systems that enable significantly improved survivability and lethality applications components to include Direct Current (DC) to DC chargers, high energy batteries, pulse chargers, high density capacitors, solid state-switches, control systems and electromagnetic armor panels. Coordinated work is also being conducted under PEs 0602601A, 0602618A, and 0602705A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a second generation power brick and mission module based electromagnetic armor module. Demonstrated multi-hit defeat with fast re-charge time capabilities in a lab environment with an electrical surrogate load. Conducted follow-on ballistic testing of the electromagnetic armor module to demonstrate multi-hit defeat capabilities enabled by the integrated power brick and mission module."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.823"
                                            },
                                            "Text": {
                                                "val": "Integrate energy storage and high-voltage power electronic components into a power system to support electromagnetic armor development weight reduction goals of 10% to 15%. Demonstrate and validate pulse power system and electromagnetic armor module in relevant environments. Begin integrated demonstration of pulse power and electromagnetic armor systems, including durability and environmental testing, Validate ballistic performance of the integrated pulse power and electro-magnetic armor system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.632"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.632"
                                            },
                                            "Text": {
                                                "val": "Will complete testing of the integrated pulse power and electromagnetic armor system. Will complete durability and environmental evaluations of the integrated system to demonstrate overall performance in relevant environments. Will complete verification of the ballistic performance of the system. Will complete electromagnetic interference testing to evaluate the ability of the system to operate with other vehicle equipment. Will conduct testing of the pulse power recharge capability and ballistic multi-hit performance of the system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Primary Power Systems:"
                                    },
                                    "Description": {
                                        "val": "This effort exploits, matures, and demonstrates Auxiliary Power Unit (APU) technologies such as a small modular\/scalable engine-based APUs, a fuel cell reformer system to convert JP-8 to hydrogen, a sulfur tolerant JP-8 fuel cell APU, and novel engine-based APUs for military ground vehicles and unmanned ground systems. This effort also establishes interface control documents for simplified integration of current and future APUs, improves reliability to reduce logistic burdens, as well as reduces acoustic signature for silent operation. Additionally, this effort exploits JP-8 fuel cell and engine APUs to optimize prime power in unmanned ground systems. Coordinated work is also being conducted under PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.646"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a JP-8 fueled small power system integrated onto an unmanned ground system. Integrated and demonstrated acoustic improvements of high power rotary engines for APU use. Performed testing on high power small engines for rotary APU use. Demonstrated the improvements of an integrated APU and Battery system to meet engine off power needs, such as power demands for silent watch, vehicle starting and communications and surveillance equipment. Integrated a fuel cell power system onto a mobile platform to demonstrate silent mobility."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.096"
                                            },
                                            "Text": {
                                                "val": "Mature power dense, heavy fuel engine, such as JP-8, rotary engine and electrical generator technologies to significantly increase under armor power generation capability for combat vehicles. Integrate and optimize rotary engine-based auxiliary power unit system for increased fuel efficiency and improve packaging of rotary engine, electrical generator and other components to decrease acoustic signature."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Propulsion and Thermal Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures high power density engines and transmission systems needed to offset increasing combat vehicle weights (armor), increased electrical power generation needs (onboard communications, surveillance and exportable power), improved fuel economy (fuel cost & range), enhanced mobility (survivability), and reduced cooling system burden (size, heat dissipation). This effort also matures thermal management including heat energy recovery, propulsion and cabin thermal management sub-systems to utilize waste heat energy and meet objective power and mobility requirements on combat and tactical vehicles. Lastly, this effort maximizes efficiencies within propulsion and thermal systems to reduce thermal burden on the vehicle while providing the same or greater performance capability. This effort is executed in coordination with PE 0604115A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.607"
                                            },
                                            "Text": {
                                                "val": "Matured and modeled an advanced powertrain system utilizing a highly efficient transmission and engine and incorporating advanced algorithms and control strategies to enhance energy efficiencies and performance capabilities for future combat vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Mature combat vehicle mechanical automatic transmission design and increase transmission efficiency by targeting the optimal efficiency through all vehicle operating ranges. Optimize powertrain system mobility and steering performance by delivering increased engine power to the vehicle track system while reducing heat rejection. Validate model of advanced powertrain system. Mature transmission quality, reliability and durability to reduce lifecycle costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.808"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.808"
                                            },
                                            "Text": {
                                                "val": "Will conclude single-cylinder engine component optimization of a unique high power density, low heat rejection, fuel efficient opposed piston engine that will dramatically improve the power density and reduce fuel consumption for combat vehicles. Will begin maturation of multi-cylinder engine components by exploiting the single-cylinder engine component optimization. Will mature advanced engine control strategies to optimize fuel efficiency and enable precise control of the new combat engine.  Will fabricate proof of concept hardware and conduct component level testing of a combat vehicle mechanical automatic transmission that will increase propulsion system efficiency by targeting the optimal efficiency through all vehicle operating ranges. Will mature the control strategy for the combat vehicle transmission that will optimize the gearing ratios for desired torque parameters and ensure transmission ride quality, reliability and durability to reduce powertrain lifecycle costs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Projection:"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on reducing the logistics footprint, improving fuel efficiency, and ensuring mobility by maturing and demonstrating technologies in areas such as water purification, generation, quality monitoring, storage and distribution and wastewater treatment and reuse; petroleum quality monitoring, filtration, storage and distribution, hydraulic fluids; alternative fuels and fuel additives; lubricants, oil, powertrain fluids and coolants. This effort is done in coordination with efforts in PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.680"
                                            },
                                            "Text": {
                                                "val": "Conducted demonstrations of waste water treatment and recycling technologies in a field environment. Demonstrated expanded in-line water quality and process monitoring capability to address pathogens and toxins such as giardia, cryptosporidium, and pesticides. Characterized selected alternative fuels and fuel additives to improve performance and diversify energy sources; evaluated candidate long life coolants designed to reduce the overall logistics burden and meet emerging requirements of military ground systems; and evaluated fluid distribution composite hose technologies to improve logistical burdens of deploying fuel and water pipeline systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Perform modeling and analysis of waste water treatment and recycling technologies to assess the scalability of technologies and optimize system designs. Evaluate and qualify synthetic fuels made from non-petroleum sources against performance requirements for use in military ground systems. Mature and demonstrate fuel sensor technologies and a portable fuel analyzer for contaminate detection. Validate performance of gear oils and hydraulic fluids using a new test methodology and performance based specification, demonstrating increased vehicle fuel efficiency with limited equipment\/hardware modifications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate optimized waste water treatment and recycling technologies to support sustainability logistics basing. Will continue to validate physical property characteristics and demonstrate performance of select synthetic fuel blends made from non-petroleum sources to determine suitability for military ground systems. Will assess performance of gear oils used in limited slip differentials and transfer cases, and will mature and demonstrate hydraulic fluid formulations to increase vehicle fuel efficiency and reduce maintenance burden."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "497"
                    },
                    "ProjectTitle": {
                        "val": "Combat Vehicle Electro"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.926"
                        },
                        "CurrentYear": {
                            "val": "6.660"
                        },
                        "BudgetYearOne": {
                            "val": "7.118"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.118"
                        },
                        "BudgetYearTwo": {
                            "val": "7.153"
                        },
                        "BudgetYearThree": {
                            "val": "7.202"
                        },
                        "BudgetYearFour": {
                            "val": "7.345"
                        },
                        "BudgetYearFive": {
                            "val": "7.492"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, integrates, and demonstrates vehicle electronics hardware such as computers, sensors, communications systems, displays, and vehicle command\/control\/driving mechanisms as well as vehicle software to enhance crew performance, increase vehicle fuel efficiency, reduced Size, Weight, and Power (SWaP) burdens and reduce vehicle maintenance costs. This project also advances open system architectures (power and data) for military ground vehicles to enable common interfaces, standards and hardware implementations. The overall vehicle system architecture is known as the Vehicle Integration for C4ISR\/EW Interoperability (VICTORY), which is a long term technology effort that provides an open architecture that will allow platforms to accept future technologies without the need for significant re-design as new technologies are developed and integrated. Additionally this project matures autonomy architectures that enable the ease of integration of autonomous subsystem technologies into future and existing tactical and combat vehicle architectures. Technical challenges include: software and algorithm development for increased levels of automation for both manned and unmanned systems, secure vehicle data networks, interoperability of intra-vehicle systems, and implementation of advanced user interfaces. Overcoming these technical challenges enables improved and increased span of collaborative vehicle operations, efficient workload management, commander's decision aids, embedded simulation for battlefield visualization and fully integrated virtual test\/evaluation. \n\nWork in this project supports the Army Science and Technology Ground Maneuver Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vehicle Electronics Integration Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, demonstrates and implements next generation military ground vehicle electronics and electrical power open architectures for future ground combat and tactical vehicle systems. Mature and demonstrate technologies to include: next generation video\/data networking and computing equipment, Silicon Carbide (SiC) high voltage power electronics and low voltage smart power distribution. Technologies will reduce currently fielded vehicle overall SWaP concerns for vehicle electronics. This effort is coordinated with efforts in Program Element (PE) 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.503"
                                            },
                                            "Text": {
                                                "val": "Further matured and began implementation of next generation military ground vehicle electronics and electrical power open architectures; conducted market\/trade analysis and integrated applicable high and low voltage vehicle power components, command, control, communications, and combat vehicle computing hardware and software necessary for full architecture system functionality into a reconfigurable combat vehicle cab simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.508"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate vehicle electronics architecture to facilitate rapid integration of card-based communication equipment into combat and tactical systems. Continue all maturation and integration activities of the next generation power and data architecture and corresponding system design in a System Integration Laboratory (SiL). Verify and validate the next generation power and data architecture through testing traced to power, network and SIL designs and requirements. Enhance the data transport mechanism for VICTORY, leveraging the next generation power and data architecture and incorporating electronics and electrical power open architecture requirements for future combat vehicles. Exploit the existing VICTORY data architecture to demonstrate future combat vehicle functions and components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.532"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.532"
                                            },
                                            "Text": {
                                                "val": "Will provide an integrated vehicle electronics architectural depiction of the Vehicle Electronics & Architecture (VEA) Mobile Demonstrator that incorporates the use of open power, data, and network interface standards. Will exploit the VEA Research System Integration Laboratory (SIL) technology demonstration findings to optimize performance specifications for open power, data, and network interface requirements, standards, and architectural design patterns for future tactical and combat vehicles. Will continue to exploit VICTORY (Vehicular Integration for C4ISR\/EW Interoperability) data architecture to mature data interface standards for future combat vehicle functions and components. Will provide one-wire architectural depictions, vehicle security engineering  improvements, and power design concepts for Radio Frequency (RF) Convergence SIL demonstrator to improve C4ISR modularity, maintainability, and mission pack configurability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Electronics Architecture and Standards:"
                                    },
                                    "Description": {
                                        "val": "This effort matures technologies and standards for existing and future combat and tactical ground vehicles. Open commercial standards will be evaluated and modified for use in military ground vehicles and possible inclusion in the Army's open, non-proprietary intra-vehicle data network e.g., VICTORY.  This effort will also evaluate standards and components for suitability of integration into vehicle platforms. This effort also supplements the design of electronic architectures to support the efficient integration of electronic components into vehicle systems through the use of open standards. Additionally, this effort matures and expands the VICTORY effort to interface with the Modular Active Protection System (APS) Architecture. This effort is coordinated with PEs 0602601A and 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.423"
                                            },
                                            "Text": {
                                                "val": "Completed update of VICTORY SIL to version 1.6 and begin update of VICTORY SIL to VICTORY standard version 1.7 to demonstrate component compliance testing to latest VICTORY release. Matured and demonstrated current VICTORY interfaces (1.6 vs. 1.7) to support next generation open vehicle architectures in preparation for a data and computing architecture demonstration in Fiscal Year (FY) 2016."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.152"
                                            },
                                            "Text": {
                                                "val": "Continue to mature and validate the VICTORY specification through demonstration in the VICTORY SIL. Complete the VICTORY SIL update to standard version 1.7, which adds capabilities for Logistics and Training systems and demonstrate component compliance to standard version 1.7. Begin the VICTORY SIL update to VICTORY standard version 1.8, providing the capability to demonstrate component compliance to the VICTORY standard version 1.8, which adds capabilities for weapons and sensor systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.174"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.174"
                                            },
                                            "Text": {
                                                "val": "Will continue to optimize the VICTORY specification by exploiting VICTORY SIL technology demonstration results for application in vehicle system level demonstration that matures and demonstrates implementations of electronic, data, and power standards that enable better interoperability and fault tolerance technology. Will continue to mature and demonstrate integration of Modular Active Protection System (MAPS) using standard interfaces to improve MAPS interoperability with the other vehicle electronic subsystems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Vehicle Architecture:"
                                    },
                                    "Description": {
                                        "val": "This project matures, integrates and demonstrates an improved, optimized autonomy-enabled distribution architecture that eases integration of new and emerging technologies across the full spectrum of operational and tactical supply movement operations. This project addresses systems integration challenges by providing the appropriate fault tolerant architecture design artifacts that will allow ease of integration for autonomy enablement kits, autonomy enablement software, and end-to-end sustainment and tactical ground resupply capability through use of open systems interfaces.  This effort is coordinated with efforts in PEs 0602120A, and 0602601A."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.412"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.412"
                                            },
                                            "Text": {
                                                "val": "Will exploit and optimize the Autonomous Mobility Applique System (AMAS) fault-tolerant architecture to gain better understanding of system of system impacts and system level requirements for an end-to-end autonomous vehicle architecture design implementation. Will provide and refine a reference autonomous vehicle architecture, and initial integration & demonstration of behavior algorithm software modules within the end-to-end autonomous vehicle architecture."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "515"
                    },
                    "ProjectTitle": {
                        "val": "Robotic Ground Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.805"
                        },
                        "CurrentYear": {
                            "val": "7.554"
                        },
                        "BudgetYearOne": {
                            "val": "12.678"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.678"
                        },
                        "BudgetYearTwo": {
                            "val": "16.493"
                        },
                        "BudgetYearThree": {
                            "val": "16.493"
                        },
                        "BudgetYearFour": {
                            "val": "16.767"
                        },
                        "BudgetYearFive": {
                            "val": "17.280"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates technologies to enable Unmanned Ground Vehicles (UGV) including sensor technologies, perception hardware and software, and control technologies that allow the Soldier to perform mission tasks more efficiently. Challenges addressed include: obstacle avoidance, overcoming perception limitations, intelligent situational behaviors, command and control by Soldier operators, frequency of human intervention, operations in adverse weather, and autonomy enabled vehicles protecting themselves and their surroundings from intruders. Mature technologies are incorporated onto existing, Army-owned UGV technology demonstrators so that performance of the enabling technologies can be evaluated.  \n\nThe approach builds upon, complements, and does not duplicate previous and ongoing investments conducted under the Joint Robotics Program Office.\n\nWork in this project supports the Army Science and Technology Ground Maneuver Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI, in collaboration with the Army Research Laboratory (ARL), Adelphi and Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned Ground Systems Technology:"
                                    },
                                    "Description": {
                                        "val": "This project matures, integrates and demonstrates advanced robotic and autonomous technologies for the tactical and combat vehicle fleets. Unmanned ground systems technologies can be employed to overcome critical Army challenges to include automated resupply and sustainment, improved tactical intelligence, and reduced physical and cognitive burden. Challenges can be met by utilizing relevant technologies such as maneuver and tactical behavior algorithms, autonomy kits, sensor and weapons integration, advanced navigation and planning, vehicle self-protection, object and local environment manipulation, local situational awareness, advanced perception, vehicle and pedestrian safety, and robotic command and control. This effort is coordinated with efforts in Program Elements (PEs) 0602120A, 0602601A, 0602784A, 0603001A, and 0603734A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.805"
                                            },
                                            "Text": {
                                                "val": "Matured and integrated autonomy-enabling technologies to include: drive-by-wire systems, vehicle active safety technologies, mission packages, and related software, algorithms and control interfaces. Validated emerging safety methodologies and tactics, techniques and procedures. Matured and integrated higher level intelligent behaviors to increase Soldier safety, operational efficiency, effectiveness, and manned\/unmanned teaming. Further integrated components and systems compliant with interoperability standards onto manned\/unmanned platforms to increase re-use and reduce costs of current\/future systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.554"
                                            },
                                            "Text": {
                                                "val": "Mature, integrate and demonstrate advanced scalable autonomous technologies onto tactical vehicles to automate driving tasks and reduce logistics support requirements. Mature and integrate software and behavior algorithms to enable autonomous convoy and autonomous vehicle loading\/unloading operations to improve the effectiveness of unit resupply and sustainment operations. Mature and demonstrate platform autonomy in increasingly complex environments and mission applications ranging from urban terrain to cross country maneuvers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.678"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.678"
                                            },
                                            "Text": {
                                                "val": "Will continue to mature and integrate state-of-the-art autonomous technologies such as Light Detection and Ranging (LIDAR), Global Positioning System (GPS), and cameras into advanced autonomy-enabled tactical vehicles and material handling equipment (MHE) to demonstrate the reduction of the logistics support and manpower requirements. Will mature and verify scalable autonomous software and behavior algorithms agnostic of the platform and autonomous vehicle loading\/unloading operations to improve the effectiveness of unit resupply and sustainment operations. Will mature and demonstrate modeling & simulation (M&S) tools to support the design, development, testing, and evaluation of autonomous vehicles in tactical terrain and weather conditions. Will demonstrate hardware-in-the-loop \/ software–in-the-loop integrations of physics-based simulations of initial development increment of autonomous vehicle technologies. Will mature and demonstrate initial increment prototype hardware and software capability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "533"
                    },
                    "ProjectTitle": {
                        "val": "Ground Vehicle Demonstrations"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.500"
                        },
                        "CurrentYear": {
                            "val": "22.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These are Congressional Interest Items"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "17.500"
                                        },
                                        "Text": {
                                            "val": "Continued to mature transparent armor with improved resistance to delamination from heating elements and thermal loading. Developed advanced membrane technologies to support gray water treatment and reverse osmosis pretreatment. Demonstrated integrated Warfighter's needs discovered during the Autonomous Mobility Applique' System (AMAS) Joint Capabilities Technology Demonstration (JCTD) Operational Evaluation. Developed conceptual and detailed designs for modular chassis connection methods. Designed and integrated a tablet-based system with enhanced situational awareness and a collaborate planning capability into two vehicle platforms, and conducted a demonstration of the ability of the platforms to enable a nine-man squad to operate in two separate vehicles with no loss of tempo. Developed and optimized the methodology to support the modification of the North Atlantic Treaty Organization Reference Mobility Model to be used for unmanned vehicles. Optimized a vehicle paint layering system to maximize corrosion resistance, chip and abrasion resistance, and durability while improving environmental and emissions compliance. Developed an improved vehicle coating formulation to provide a chemical agent resistant coating system with increased flexibility and improved adhesion."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "22.500"
                                        },
                                        "Text": {
                                            "val": "Program increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "53D"
                    },
                    "ProjectTitle": {
                        "val": "NAC Demonstration Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These are Congressional Interest Items"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Alternative Energy Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20.000"
                                        },
                                        "Text": {
                                            "val": "Developed a high efficiency 30 kiloWatt import\/export power inverter that is small and lighter than currently existing inverters. Developed an integrated automotive fuel cell and hydrogen storage system onto an existing military ground vehicle to demonstrate long range silent operation as well as power available at a Forward Operating Base. Developed a roll-up\/roll-away vehicle based alternating current power system to demonstrate the capability to assemble a vehicle based power supply for austere contingency bases. Matured a common military electronic controller to ensure it meets military environmental requirements. Developed and integrated a multi-fuel engine controller on a commercial engine to demonstrate automotive performance gains in fuel consumption and consistency in engine torque. Developed an electrically driven compressor module to run off 28Volts of direct current, providing on demand variable speed to increase efficiency over current engine driven compressors. Improved the autonomous convoy modeling, simulation, and analysis capability, and the ability to assess the impact of autonomy on operational energy."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}