{
    "id": "6c038137fa74e9fc1a5442a0bcbce31a559c2832",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602271N"
        },
        "ProgramElementTitle": {
            "val": "Electromagnetic Systems Applied Research"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "102.750"
            },
            "CurrentYear": {
                "val": "114.644"
            },
            "BudgetYearOne": {
                "val": "118.941"
            },
            "BudgetYearOneBase": {
                "val": "118.941"
            },
            "BudgetYearTwo": {
                "val": "132.104"
            },
            "BudgetYearThree": {
                "val": "124.886"
            },
            "BudgetYearFour": {
                "val": "125.284"
            },
            "BudgetYearFive": {
                "val": "120.756"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan, approved by the S&T Corporate Board (20 January 2015).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThe Electromagnetic Systems Applied Research Program addresses technology needs associated with Naval platforms for new capabilities in EO\/IR Sensors, Surveillance, Electronic Warfare, Navigation, Solid State Electronics, Vacuum Electronics Power Amplifiers, and Nanoelectronics. The program supports development of technologies to enable capabilities in Missile Defense, Directed Energy, Platform Protection, Time Critical Strike, and Information Distribution. This program directly supports the Department of Defense Joint Warfighter Plan and the Defense Technology Area Plans. Activities and efforts within this Program have attributes that focus on enhancing the affordability of warfighting systems. The program also provides for technology efforts to maintain proactive connectivity and collaboration between Department of the Navy (DON) Science and Technology (S&T) and Joint, Navy, and Marine Corps commands worldwide.  \n\nAlso included in this PE is the Netted Emulation of Multi-Element Signatures against Integrated Sensors (NEMESIS) Innovative Naval Prototype (INP).  NEMESIS technology addresses the need to generate the appearance of a realistic naval force to multiple adversarial surveillance and targeting sensors simultaneously. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "107.663"
                },
                "CurrentYear": {
                    "val": "115.051"
                },
                "BudgetYearOne": {
                    "val": "113.651"
                },
                "BudgetYearOneBase": {
                    "val": "113.651"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "102.750"
                },
                "CurrentYear": {
                    "val": "114.644"
                },
                "BudgetYearOne": {
                    "val": "118.941"
                },
                "BudgetYearOneBase": {
                    "val": "118.941"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.913"
                },
                "CurrentYear": {
                    "val": "-0.407"
                },
                "BudgetYearOne": {
                    "val": "5.290"
                },
                "BudgetYearOneBase": {
                    "val": "5.290"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.407"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.350"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.563"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.774"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.774"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.516"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.516"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Electromagnetic Systems Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "102.750"
                        },
                        "CurrentYear": {
                            "val": "114.644"
                        },
                        "BudgetYearOne": {
                            "val": "118.941"
                        },
                        "BudgetYearOneBase": {
                            "val": "118.941"
                        },
                        "BudgetYearTwo": {
                            "val": "132.104"
                        },
                        "BudgetYearThree": {
                            "val": "124.886"
                        },
                        "BudgetYearFour": {
                            "val": "125.284"
                        },
                        "BudgetYearFive": {
                            "val": "120.756"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses technology opportunities associated with Naval platforms for new capabilities in EO\/IR Sensors, Surveillance, Electronic Warfare, Navigation, Solid State Electronics, Vacuum Electronics Power Amplifiers, and Nanoelectronics.  The project supports development of technologies to enable capabilities in Missile Defense, Directed Energy, Platform Protection, Time Critical Strike, and Information Distribution.  This project directly supports the Department of Defense Joint Warfighter Plan and the Defense Technology Area Plans.  Activities and efforts within this program have attributes that focus on enhancing the affordability of warfighting systems.  The program also provides for technology efforts to maintain proactive connectivity and collaboration between Department of the Navy (DON) Science and Technology (S&T) and Joint, Navy, and Marine Corps commands worldwide.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ELECTRONIC WARFARE TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop technologies that enable the development of affordable, effective and robust Electronic Warfare (EW) systems across the entire electromagnetic spectrum (EMS) that will increase the operational effectiveness and survivability of U.S. Naval units.  Emphasis is placed on passive sensors and active and passive countermeasure (CM) systems that exploit and counter a broad range of electromagnetic threats.  The focus is on maintaining near perfect, real-time knowledge of the enemy; countering the threat of missiles against deployed Naval forces; precision identification and location of threat emitters; and development of technologies that have broad application across multiple disciplines within the EW mission area.  This activity also includes developments to protect these technologies from external interference, and modeling and simulation required to support the development of these technologies.  Also included is technology development in support of the Integrated Distributed Electronic Warfare System (IDEWS) concept.  \n\nThe objectives reported in prior years under this R-2 Activity have been consolidated into the current objectives described below.\n\nThe current objectives are:\n\n- EW RF Technology: Develop and demonstrate technologies in the Radio Frequency (RF) spectrum (covering frequencies from kilohertz to terahertz) that include developments in detection, signal processing and passive\/active techniques for wideband Electronic Attack (EA), Electronic Protection (EP) and the Electronic Support (ES) mission areas. \n\n- EW EO\/IR Technology: Develop and demonstrate technologies in the Electro-Optic and Infrared (EO\/IR) spectral domain (extending from the ultraviolet to the far infrared spectral bands) that include advances in multispectral sensors, multiband sources, beam forming\/steering, and signal processing and transmission. \n\n- EW Integrated and Networked Technology: Develop and demonstrate technologies that will enable an increased situational awareness and response across the electromagnetic spectrum (EMS) with broad spatial coverage using all available EW assets to provide coordinated, adaptive and networked EW sensing, protection and attack.\n\n- Advanced EW Enabling Technologies (Formerly Titled: Electronic Warfare (EW) Roadmap): Develop classified advanced electronic warfare technology in support of current and predicted capability requirements.\n\n- Electromagnetic Maneuver Warfare Command & Control (EMC2) (FY16-FY20): Enable a battle group to work cooperatively in the EM Spectrum (EMS) to optimize Electronic Warfare (EW), Information Operations (IO), Communications (Comms) and Radar performance.  EMC2 will build upon the Resource Allocation Manager (RAM) that was previously developed for single multifunction systems under the InTop program to optimize spectrum and functional use across a platform and an entire battle group.\n\nIncrease in funding from FY 2015 to FY 2016 is due to added new INP Electromagnetic Maneuver Warfare Command & Control. (EMC2)\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "61.138"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EW RF Technology:\n- Continued development of a monolithic optical chip set capable of multi-function radio-frequency signal processing for EW applications. \n- Continued development of technology to improve transmit\/receive isolation by properly controlling surface currents with engineered materials.\n- Continued development of photonic techniques for broadband electronic surveillance systems. \n- Continued development of innovative high data-rate protected communications to circumvent malicious cyber-attack (Project Calliope). \n- Continued development of a millimeter wave Rotman Lens-based electronic attack transmitter. \n- Continued technology development in transmit-to-receive isolation technologies and techniques, relevant to the spectral range of 1 to 110 GHz.\n- Completed technology development in the areas of wideband cueing receiver concepts.  \n- Completed development in critical receiver components that operate across the entire 1-110 GHz spectral range.  \n- Completed technology development in high power critical EA system components that operate across the entire 1-110 GHz spectral range.  \n- Completed development in transmitter systems (consisting of power amplifier(s), matching network, and radiating element) capable of achieving 4-10 kW or greater Effective Radiated Power (ERP) for small decoy applications or capable of being combined to achieve 100 kW or greater ERP for large platform applications across the entire 18-45 GHz frequency range.  \n- Completed development of a process to determine direction of arrival based on multipath distortion of the received emission. \n- Completed development of all-optical techniques for signal processing to provide multifunction RF capability. \n- Completed development of a  mmW Rotman Lens-based EA transmitter. \n- Completed development of a countermeasures technique using a new novel approach. \n- Completed research into determining the vulnerability of modern communications systems.\n- Initiated the development of Sub-System Demonstrators (SSDs) leveraging wideband RF components and sub-systems from prior DoD investments to demonstrate advanced ES and EA capabilities covering a broad range of RF frequencies in support of Navy and Marine Corps mission areas.  \n- Initiated development of Infrared Gradient Index optics and associated SWaP advantages for multispectral imagers in a prototype system. \n\nEW EO\/IR Technology:\n- Continued development of semiconductor-based, multi-wavelength integrated laser sources spanning multiple bands of the ultraviolet, visible, near IR, mid-wave IR, and long-wave IR.  \n- Completed development of multi-wavelength integrated laser sources with optical fibers\/waveguides as the lasing media.  \n- Completed development of non-mechanical beam steering technologies to allow coherent energy to span multiple bands of the EO\/IR spectrum.  \n\nEW Integrated and Networked Technology:\n- Continued development of a Bayesian statistical framework paired with a novel stochastic algorithm to support EW probability of raid annihilation analysis.\n- Initiated technologies that develop new methods to represent real-time dynamic spectrum knowledge, sense and learn signal characteristics and behaviors, and to reason about threat systems and the environment to form EA strategies on-the-fly.  \n- Initiated technologies that develop extremely high-volume processing capabilities for reconfigurable EW systems.\n- Initiated development of fast signal classification of coherent radar signals for use in chanelized digital transceiver systems to support rapid countermeasure response. \n\nAdvanced EW Enabling Technologies (Formerly Titled: Electronic Warfare (EW) Roadmap): \n- Continued development of classified, advanced, electronic warfare technology in support of current and predicted capability requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "71.024"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EW RF Technology:\n- Continue all efforts of FY 2015 less those noted as completed above.\n- Complete the development of photonic techniques for broadband electronic surveillance systems.\n- Complete the development of innovative high date-rate protected communications to circumvent malicious cyber-attack (Project Calliope) \n\nEW EO\/IR Technology:\n- Continue all efforts of FY 2015 less those noted as completed above.\n- Complete development of semiconductor-based, multi-wavelength integrated laser sources spanning multiple bands of the ultraviolet, visible, near IR, mid-wave IR, and long-wave IR.\n\nEW Integrated and Networked Technology:\n- Continue all efforts of FY 2015.\n- Complete development of a Bayesian statistical framework paired with a novel stochastic algorithm to support EW probability of raid annihilation analysis.\n\nAdvanced EW Enabling Technologies (Formerly Titled: Electronic Warfare (EW) Roadmap):\n- Continue all efforts of FY 2015. \n\nElectromagnetic Maneuver Warfare Command & Control (EMC2):\n- Initiate Wideband Airborne Multifunction System design \n- Initiate Low Band RF Intelligent Distributed Resource (LowRIDR) SubSystem build\n- Initiate Electromagnetic Warfare Command and Control system design"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "70.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "70.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EW RF Technology\n- Continue all efforts of FY 2016 less those noted completed above.\n\nEW EO\/IR Technology:\n- Continue all efforts of FY 2016 less those noted completed above.\n- Initiate the development of SSDs leveraging multiband EO\/IR components and sub-systems from prior DoD investments to demonstrate advanced ES and EA capabilities covering a broad range of EO\/IR wavelengths in support of Navy and Marine Corps mission areas.\n\nEW Integrated and Networked Technology\n- Continue all efforts of FY 2016 less those noted completed above.\n- Complete development of fast signal classification of coherent radar signals for use in chanelized digital transceiver systems to support rapid countermeasure response. \n\nElectromagnetic Maneuver Warfare Command & Control (EMC2):\n- Continue all efforts of FY 2016."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EO\/IR SENSOR TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this thrust is to develop technologies that enable the development of affordable, wide area, persistent surveillance optical architectures, day\/night\/adverse weather, adaptable, multi-mission sensor technology comprised of optical sources, detectors, and signal processing components for search, detect, track, classify, identify (ID), intent determination, and targeting applications and includes developments to protect these technologies from external interference.  Also included are modeling and simulation required to support the development of these technologies.  Efforts will also include the development of optical RF components, infrared technologies including lasers and focal plane arrays using narrow bandgap semiconductors. The current specific objectives are:\n\na) Optically Based Terahertz (THz) and Millimeter Wave (MMW) Distributed Aperture Systems: \nDevelop optically based terahertz (THz) and millimeter wave distributed aperture systems for imaging through clouds, fog, haze and dust on air platforms.\n\nb) Wide Area Optical Architectures: Develop wide area optical architectures for persistent surveillance for severely size constrained airborne applications.\n\nc) Hyperspectral sensors and processing:\nDevelop visible, shortwave IR, mid-wave IR, and long-wave IR hyperspectral sensors, along with processing algorithms to detect anomalies and targets.\n\nd) Coherent Laser Radar (LADAR):\nDevelop and improve components for LADAR applications including fiber lasers, coherent focal planes, and advanced processing.\n\ne) Autonomous and Networked sensing: \nDevelop algorithms and processing that supports autonomous sensing for UAV platforms and that supports networked sensing over multiple sensors and\/or sensor platforms.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.340"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optically Based Terahertz (THz)and Millimeter Wave Distributed Aperture Systems: \n- Continued the development of range-gated image reconstruction using optical phase conjugation. \n- Continued development of a robust imaging capability to provide situational awareness in brownout conditions during takeoff\/landing operations in desert environments. \n- Continued miniaturization and modularization of MMW imaging system components for small platform systems. \n- Continued progressing the integration of spectrally agile multi-band sensors into integrated system for use in persistent and time critical surveillance. \n- Continued progressing the processing architecture for data analysis and fusion of multi-spectral images. \n- Continued development of range-gated image reconstruction using optical phase conjugation. \n \nWide Area Optical Architectures: \n- Continued development of mid and long wave IR focal plane arrays using graded-bandgap, Wtype-II, superlattices with much higher detectivity than state-of-the-art Mercury Cadmium Telluride (HgCdTe,MCT) FPAs. \n- Continued design of read-out integrated circuits for temporally adaptive focal plane arrays. \n- Continued development of spectrally agile visible, near-infrared, short-wave infrared and midwave infrared imaging technology. \n- Continued development of super-resolution techniques in Wide Field of View Mid-Wave Infrared (WFOV MWIR) sensors. \n- Initiated effort to develop components, study and demonstrate optical links that allow quantum key distribution (QKD) through free space using modulating retro-reflectors (MRRs). \n\nHyperspectral sensors and processing: \n- Continued integration of hyperspectral instruments onto test platforms. \n- Continued processing of hyperspectral data from a maritime environment. \n- Continued effort to develop mid-wave infrared focal plane arrays using plasmonically coupled antimonide based majority carrier barrier device structures on advanced digital readouts for ultra low size, weight, and power night-time wide area surveillance. \n \nCoherent Laser Radar (LADAR):\n- Continued development of fiber lasers and coherent focal plane arrays suitable for LADAR applications. \n- Continued effort to develop fiber-based long wave infrared agile, narrow-band and broadband laser sources for sensing and counter measure applications. \n- Completed fabrication and modeling of silicon photonic chips for one dimensional beam steering.\n \nAutonomous and Networked sensing: \n- Continued development of algorithms and processing that supports autonomous sensing for UAV platforms \n- Continued development of algorithms and processing that supports networked sensing over multiple sensors and\/or sensor platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.913"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optically Based Terahertz (THz) and Millimeter Wave Distributed Aperture Systems: \n- Continue all efforts of FY 2015.\n- Complete the development of range-gated image reconstruction using optical phase conjugation. (FY16)\n\nWide Area Optical Architectures: \n- Continue all efforts of FY 2015, unless noted as completed above.\n\nHyperspectral sensors and processing: \n- Continue all efforts of FY 2015. \n- Complete effort to develop mid-wave infrared focal plane arrays using plasmonically coupled antimonide based majority carrier barrier device structures on advanced digital readouts for ultra low size, weight, and power night-time wide area surveillance.\n\nCoherent Laser Radar (LADAR): \n- Continue all efforts of FY 2015 less those noted as completed above. \n- Complete effort to develop fiber-based long wave infrared agile, narrow-band and broadband laser sources for sensing and counter measure applications.\n\nAutonomous and Networked sensing: \n- Continue all efforts of FY 2015."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.314"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.314"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optically Based Terahertz (THz)and Millimeter Wave Distributed Aperture Systems: \n- Complete development of a robust imaging capability to provide situational awareness in brownout conditions during takeoff\/landing operations in desert environments. \n- Complete miniaturization and modularization of MMW imaging system components for small platform systems. \n- Complete progressing the integration of spectrally agile multi-band sensors into integrated system for use in persistent and time critical surveillance. \n- Complete progressing the processing architecture for data analysis and fusion of multi-spectral images.\n\nWide Area Optical Architectures:\n- Continue all efforts of FY 2016 less those noted as complete above.\n\nHyperspectral sensors and processing: \n- Continue all efforts of FY 2016 less those noted as complete above.\n\nCoherent Laser Radar (LADAR): \n- Continue all efforts of FY 2016 less those noted as complete above.\n\nAutonomous and Networked sensing: \n- Continue all effort of FY 2016.\n- Initiate development of multi-mode (spectral, polarization, temporal) imaging sensors for detecting low observable targets and for imaging through degraded visual environments.\n- Initiate development of extremely sensitive mmW detector technology."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVIGATION TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop technologies that enable the development of affordable, effective and robust Position, Navigation and Timing (PNT) capabilities using the GPS, non-GPS navigation devices, and atomic clocks.  This project will increase the operational effectiveness of U.S. Naval units. Emphasis is placed on GPS Anti-Jam (AJ) Technology; Precision Time and Time Transfer Technology; and Non-GPS Navigation Technology (Inertial aviation system, bathymetry, gravity and magnetic navigation). The focus is on the mitigation of GPS electronic threats, the development of atomic clocks that possess unique long-term stability and precision, and the development of compact, low-cost Inertial Navigation Systems (INS). The current specific objectives are:\n\na) GPS AJ Antennas and Receivers: \nDevelop anti-jam and anti-spoofer antennas and antenna electronics for Navy platforms for the purpose of providing precision navigation capabilities in the presence of emerging electronic threats.\n\nb) Precision Time and Time Transfer Technology: \nDevelop tactical grade atomic clocks that possess unique, long-term stability and precision for the purpose of providing GPS-independent precision time, and the capability of transferring precision time via radio frequency links precision time.\n\nc) Non-GPS Navigation Technology: \nDevelop inertial\/bathymetric\/gravity navigation system for the purpose of providing an alternative means of providing precision navigation for those Naval platforms which may not have GPS navigation capabilities and\/or loss of GPS signals.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity.\n\nThe increase from FY 2016 to FY 2017 is due to increased funding for the Navigation and Precision Timekeeping initiative."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.776"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers: \n- Continued Precise at-Sea Ship System for Indoor Outdoor Navigation (PASSION) project. \n- Continued development of Military User Equipment Integrated Fault Analysis effort. \n- Continued and completed Anti-tamper Investigation Support. \n- Continued and completed System for enhanced electronic protection, electronic support and precision navigation. \n- Continued Cognitive Modernized GPS User Equipment (MGUE) with Chaotic Timing Signals for GPS Denied Environments project. \n- Complete GPS Moderized Integrated Spoofer Tracking (MIST). \n\nPrecision Time and Time Transfer Technology: \n- Continued Evolved Global Navigation Satellite System (GNSS) Signal Monitoring Receiver Element project. \n- Continued developing Advanced-Development of a Miniature Atomic Clock. \n- Continued analysis of Code Distortion in Modernized GPS Signals on GPS Timing Receiver. \n- Continued development of Compact and Versatile Passively CEP (carrier envelope phase) Stabilized Optical Clock system. \n- Initiated Robust Ultra-Precise Time Transfer Technology project. \n\nNon-GPS Navigation Technology: \n- Continued Optically Transduced Inertial Navigation System (INS) Sensor Suite (OPTIMUSS) project. \n- Continued development of the Three-Axis Resonant Fiber Optic-based Inertial Navigation System with the accuracy of 10 milli(m)-degrees per hour and the angle random walk (ARW) of 10 milli (m)-degrees per root hour. \n- Continued development of Micro-Electro-Mechanical System (MEMS) Gyro effort. \n- Completed development of Portable Precision Celestial Navigation System. \n- Completed Alternative Image-based Navigation project.\n- Continued Embedded Sonar Aided Inertial Navigation Technology (SAINT) project. \n- Continued MEMS Inertial Navigation System Phase II project. \n- Initiated Absolute Reference Grade Cold Atom and Super Conducting Navigation project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.451"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers: \n- Continue all efforts of FY 2015 less those noted as completed above. \n- Complete Cognitive MGUE with Chaotic Timing Signals for GPS Denied Environments.\n- Complete Precise at-Sea Ship System for Indoor Outdoor Navigation (PASSION) project. \n\nPrecision Time and Time Transfer Technology: \n- Continue all efforts of FY 2015. \n- Initiate Precision Optical Clock Technology Development\n\nNon-GPS Navigation Technology: \n- Continue all efforts of FY 2015 less those noted as completed above. \n- Complete Embedded Sonar Aided Inertial Navigation Technology (SAINT) project. \n- Initiate Cold Atom INS Sensor Technology Development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.281"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.281"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers: \n- Complete development of Military User Equipment Integrated Fault Analysis effort. \n- Initiate at multi-constellation GPS receiver effort for high anti-jam and anti-spoof with wideband frontend.\n- Initiate research in application of advanced processing methods for robust GPS operation in challenged environments.\n\nPrecision Time and Time Transfer Technology:\n- Continue all efforts of FY 2016. \n- Continued analysis of Code Distortion in Modernized GPS Signals on GPS Timing Receiver.\n- Continued developing Advanced-Development of a Miniature Atomic Clock. \n- Complete development of Compact and Versatile Passively CEP (carrier envelope phase) Stabilized Optical Clock system. \n- Complete Evolved Global Navigation Satellite System (GNSS) Signal Monitoring Receiver Element project. \n- Initiate Optical Clock development efforts for compact, deployable next generation clock technology to greatly surpass current Rubidium and Cesium standards, providing the ultimate in time holdover in GPS denied environments.\n- Initiate RF and Optical time transfer effort for terrestrial, surface, and airborne platforms.\n\nNon-GPS Navigation Technology:\n- Continue all efforts of FY 2016. \n- Complete Optically Transduced Inertial Navigation System (INS) Sensor Suite (OPTIMUSS) project. \n- Complete development of Micro-Electro-Mechanical System (MEMS) Gyro effort. \n- Complete MEMS Inertial Navigation System Phase II project. \n- Initiate hybrid velocity measuring sonar system for compact underwater and surface platforms.\n- Initiate development of a thermal or cold atom beam 3 axis navigator.\n- Initiate investigation of compact indexed inertial for airborne, weapon, or UUV platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOLID STATE ELECTRONICS"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop higher performance components and subsystems for all classes of military RF systems that are based on solid state physics phenomena and are enabled by improved understanding of these phenomena, new circuit design concepts and devices, and improvements in the properties of electronic materials.  An important subclass are the very high frequency (VHF), ultra-high frequency (UHF), microwave (MW), and millimeter wave (MMW) power amplifiers for Navy all-weather radar, surveillance, reconnaissance, electronic attack, communications, and smart weapon systems.  Another subclass are the analog and high speed, mixed signal components that connect the electromagnetic signal environment into and out of digitally realized, specific function systems.  These improved components are based on both silicon (Si) and compound semiconductors (especially the wide bandgap materials and narrow bandgap materials), low and high temperature superconductors, novel nanometer scale structures and materials.  Components addressed by this activity emphasize the MMW and submillimeter wave (SMMW) regions with an increasing emphasis on devices capable of operating in the range from 50 gigahertz (GHz) to 10 terahertz (THz).  The functionality of the technology developed cannot be obtained through Commercial-Off-the-Shelf (COTS) as a result of the simultaneous requirements placed on power, frequency, linearity, operational and instantaneous bandwidth, weight, and size.  Effort will involve understanding the properties of engineered semiconductors as they apply to quantum information science and technology. \n\nThis activity also includes Anti-Tamper development of innovative techniques and technologies to deter the reverse engineering and exploitation of our military's critical technology and critical program information in order to impede technology transfer and alteration of system capability and prevent the development of countermeasures to U.S. systems. The current specific objectives are:\n\na) Solid State Transistors and Devices: Develop solid state transistors and devices for high frequency analog and digital operation.\n\nb) High Efficiency, Highly Linear Amplifiers: Develop high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications.\n\nc) Superconducting Electronics: Develop components for RF systems utilizing superconducting and other technologies which are designed to deliver software defined, wide band, many simultaneous signal functionality over a wide range of frequencies, in increasingly field-ready packaging and demonstrate the ability of these components to be combined into chains to deliver superior functionality in conventional system contexts, including, but not limited to, SATCOM, Electronic Warfare (EW), signal intelligence (SIGINT), and communications.\n\nd) Control, Reception, Transmission, and Processing of Signals: Develop electronics and photonics technology that provides for the control, reception, transmission and processing of signals.\n\ne) Novel Nanometer Scale Logic\/Memory Devices and Related Circuits and Architectures: Develop novel nanometer scale (feature size at or below 10nm) logic\/memory devices and related circuits and architectures to deliver ultra-low power, light weight and high performance computational capability for autonomous vehicles and individual warfighters.\n\nf) Anti-Tamper: Develope innovative techniques and technologies to deter the reverse engineering and exploitation of our military's critical technology and critical program information in order to impede technology transfer and alteration of system capability and prevent the development of countermeasures to U.S. systems. \n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity.\n\nThe increase from FY 2016 to FY 2017 is due to increased funding for the Electromagnetic Applied Research initiative."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.187"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Solid State Transistors and Devices:\n- Continued effort to develop and exploit reduced dimensionality transistors. \n- Continued effort to develop a high performance graphene base hot electron transistor. \n- Continued development of an integrated, tunable, frequency selective and low noise integrated module. \n- Continued effort to develop W-band high-power Gallium Nitride (GaN) Metal Insulator Semiconductor (MIS) transistors. \n- Continued MMW field plate GaN High Electron Mobility Transistor (HEMT) development. \n- Continued progressing mixed-signal GaN Monolithic Microwave Integrated Circuit (MMIC) technology development. \n- Continued investigations into ultra-low noise, Group III-Nitride, transistor structures for RF and mm-wave receivers and transmitters. \n- Continued group III-Nitride transistor development for 1 THz circuits. \n- Continued development of discrete, channelized, Gallium Nitride Transistors for linear and low noise transmit and receive amplifiers. \n- Continued development of high power density mm-wave transistor technology. \n- Continued effort to develop ultra-scaled AlN\/GaN transistors to enable superior RF amplifier performance in G-band applications. \n- Complete effort to develop advanced graphene field-effect transistor (FET) technology for higher transistor cut-off frequency and lower power consumption in low-noise receivers. \n- Initiated heterogeneous 2D transistor development.\n \nHigh Efficiency, Highly Linear Amplifiers: \n- Continued effort to develop transmit and receive components using reduced dimensionality transistors. \n- Continued development of MMW AlGaN\/GaN wide bandgap HEMT. \n- Continued development of AlGaN HEMT broadband amplifiers for electronic warfare decoys with increased power and efficiency than achieved with conventional solid state amplifiers. \n- Continued high-efficiency microwave GaN HEMT amplifier development. \n- Continued work on GaN MMW components at >44 GHz to allow for EHF SATCOM insertion and other MMW applications spanning to 95GHz. \n- Continued expansion of scope of the GaN MMW device program.\n- Continued and demonstrate Low-Noise, High Dynamic Range Receiver Chain for Simultaneous Transmit and Receive (STAR) Applications. \n- Continued component development in support of multifunctional electronic warfare. \n- Continued transition of GaN high-efficiency microwave HEMT amplifiers to radar and communications applications. \n- Continued development of MMW high efficiency amplifiers for satellite communications and compact high efficiency MMW sources for active denial systems. \n- Continued development of high-efficiency broadband GaN HEMT amplifiers for electronic warfare applications. \n- Continued Sub-MMW GaN Device technology for communications, target identification and high speed data processing. \n- Continued development of GaN Monolithic Microwave Integrated Circuit (MMIC) Amplifier Technology for operation greater than (>)100 GHz.\n- Continued development of high efficiency GaN amplifier MMICs for 50-100 GHz operation. \n- Continued low-noise, high dynamic range Group-III Nitride amplifier development for W-band receivers. \n- Continued development of group III-Nitride amplifiers for terahertz amplification. \n- Continued development of high power density, high output power, solid state mm-wave amplifiers.\n\nSuperconducting Electronics: \n- Continued effort to develop reprogrammable superconducting digital filters capable of limiting Instantaneous Bandwidth (IBW) of output data stream from Analog-to-Digital Converter (ADC) to user defined choices and doing this with >10X lower processing latency and energy cost than possible in room temperature circuits. \n- Continued effort to design of Analog-to-Digital Converters (ADC) to enhance minimum detectable signal sensitivity levels by 10 dB. \n- Continued development of effort to improve superconducting analog to digital converter performance by more than 2 bits as well as 2x in sample rate. \n- Continued research on components needed to achieve improved interference immunity. \n- Completed development of first packaged prototype of 1 cm squared HF-UHF antenna for space limited platforms such as UAVs.\n- Completed development of mixed superconducting\/semiconducting output circuits that allow energy efficient data transfer to room temperature at >10 Gbps per line and precision amplification of signals returned to the superconducting domain.  These technologies are critical to the delivery of maximum system functionality from superconducting electronics and enable transmitter interference mitigation in wideband receivers. \n- Initiated heterogeneous component technology development to enable performance enhancement of analog-digital converters and ultra-wideband receivers and transmitters. \n   \nControl, Reception, Transmission, and Processing of Signals: \n- Continued efforts to develop compact, high performance switch, filter, and high isolation device technologies for agile, broadband signal processing in cluttered environments. \n- Continued development of Gallium Nitride-based low-noise components for Interference Immune Navy Satcom receivers. \n- Continued investigations into low-noise, high dynamic range group-III Nitride receiver components for W-band and higher signal detection. \n- Continued development of group III-Nitride terahertz receive technologies. \n- Continued work on multi-THz real-time signal processing using combination of high speed electronic, photonic, and metamaterial techniques. \n- Continued research into affordable digital array, interfacing technologies using low power, mixed signal approaches, wafer scale antennas, and analog photonic transmission techniques. \n- Continued research into compact, broadband filter and channelizer components targeting multi-octave operation in the range from VHF to W-band. \n- Continued effort to develop micro-miniature ferroelectrically active tunable acoustic wave devices for fast reconfiguration of circuits and systems operating at microwave through sub-millimeter-wave frequencies. \n- Initiated RF electronics and photonics development to implement wideband Simultaneous Transmit and Receive sensing and communications apertures on disadvantaged platforms.  \n\nNovel Nanometer Scale Logic\/Memory Devices and Related Circuits and Architectures:\n- Continued developing new research in graphene synthesis and device concepts. \n- Continued work on graphene based devices and circuits for low power flexible electronics. \n- Continued research on graphene-organic hybrid materials interfaces and device structures. \n- Initiated large-scale hexagonal boron nitride (hBN) synthesis as substrate for graphene and other 2D materials.\n\nAnti-Tamper: \n- Continued efforts to develop physically unclonable functions and high density 3D packaging technologies. \n- Continued efforts to develop destruct mechanisms that do not cause collateral damage. \n- Continued efforts to develop advanced sensors and coatings."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.923"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Solid State Transistors and Devices: \n- Continue all efforts of FY 2015 less those noted as completed above.\n- Complete effort to develop ultra-scaled AlN\/GaN transistors to enable superior RF amplifier performance in G-band applications. \n- Initiate development of ultra-efficient mm-wave transistors. \n\nHigh Efficiency, Highly Linear Amplifiers: \n- Continue all efforts of FY 2015.\n- Initiate research into harmonic mm-wave amplifiers \n\nSuperconducting Electronics: \n- Continue all efforts of FY 2015 less those noted as completed above. \n\nControl, Reception, Transmission, and Processing of Signals: \n- Continue all efforts of FY 2015.\n- Complete effort to develop micro-miniature ferroelectrically active tunable acoustic wave devices for fast reconfiguration of circuits and systems operating at microwave through sub-millimeter-wave frequencies.  \n\nNovel Nanometer Scale Logic\/Memory Devices and Related Circuits and Architectures: \n- Continue all efforts of FY 2015. \n\nAnti-Tamper: \n- Continue all efforts of FY 2015."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.856"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.856"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Solid State Transistors and Devices: \n- Continue all efforts of FY 2016 less those noted as completed above.  \n- Initiate development of highly linear source electric field engineered HEMT devices. \n- Initiate development of ultra-efficient nitrogen-polar mm-wave transistors. \n- Initiate Electromagnetic Applied Research initiative.\n\nHigh Efficiency, Highly Linear Amplifiers: \n- Continue all efforts of FY 2016 less those noted as completed above.   \n- Complete and demonstrate Low-Noise, High Dynamic Range Receiver Chain for Simultaneous Transmit and Receive (STAR) Applications.  \n- Initiate high output impedance RF amplifier development for photonically-enabled STAR architectures.  \n\nSuperconducting Electronics: \n- Continue all efforts of FY 2016 less those noted as completed above. \n- Initiate realization of RF mixed signal components predicted to have significantly improved performance using newly available switching devices. \n\nControl, Reception, Transmission, and Processing of Signals: \n- Continue all efforts of FY 2016 less those noted as completed above. \n- Initiate development of high RF impedance electro-optic modulators for photonically-enabled STAR architectures. \n\nNovel Nanometer Scale Logic\/Memory Devices and Related Circuits and Architectures: \n- Continue all efforts of FY 2016. \n\nAnti-Tamper: \n- Continue all efforts of FY 2016 less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURVEILLANCE TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop advanced sensor and sensor processing systems for continuous, high volume, theater-wide air and surface surveillance, battle group surveillance, real time reconnaissance and ship defense.  Major technology goals include long-range target detection and discrimination, target identification (ID) and fire control quality target tracking in adverse weather, background clutter and electronic countermeasure environments and includes modeling and simulation required to support the development of these technologies.  \n\nThe current specific objectives are:\n\na) Radar Architectures, Sensors, and Software which Address Ballistic Missile and Littoral Requirement Shortfalls: Develop radar architectures, sensors, and software which address Ballistic Missile and Littoral requirement shortfalls including: sensitivity; clutter rejection; and flexible energy management.\n\nb) Algorithms, Sensor Hardware, and Signal Processing Techniques for Automated Radar Based Contact Mensuration and Feature Extraction: Develop algorithms, sensor hardware, and signal processing techniques for automated radar based contact mensuration and feature extraction in support of asymmetric threat classification and persistent surveillance and to address naval radar performance shortfalls caused by: man-made jamming and Electronic Counter Measures (ECM), unfavorable maritime conditions, and atmospheric and ionosphere propagation effects.\n\nc) Software and Hardware for a Multi-Platform, Multi-Sensor Surveillance System: Develop software, and hardware for a multi-platform, multi-sensor surveillance system for extended situational awareness of the battlespace.\n\nd) Small UAV Collision Avoidance\/Autonomy Technology: Develop small UAV collision avoidance\/autonomy technology.\n\ne) Long Range Radio Frequency (RF) Identification (ID): Develop, hardware, software, algorithms, and RF techniques to extend identification capabilities in support of Intelligence Surveillance and Reconnaissance (ISR).\n\nFunding decrease from FY16 to FY17 is a result of the completion of algorithm, sensor, and signal activities.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this\nactivity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Radar Architectures, Sensors, and Software which Address Ballistic Missile and Littoral Requirement Shortfalls: \n- Continued Advanced Common Radar Architecture and mode development. \n- Initiated High Power, High Duty Factor, X-band Amplifier\n\nAlgorithms, Sensor Hardware, and Signal Processing Techniques for Automated Radar Based Contact Mensuration And Feature Extraction: \n- Continued demonstrations of advanced Non-Cooperative Target Recognition (NCTR) algorithms in congested harbor environments. \n- Continued development of a process to detect hostile camouflaged or hidden targets in shadows and diverse backgrounds of militarily challenged environments. \n- Continued investigation of means of optimally combining mensuration, classification, and noncooperative target recognition of surface craft. \n- Continued development of a technology architecture for the Persistent Autonomous Surveillance System. \n- Continued development of automated controls for an airborne persistent multi-node sensor network. \n- Continued progressing development of algorithms and signal processing for Electronic Protection in airborne radars. \n- Continued progressing development of software and algorithms for multi-platform radar controls. \n- Continued development of a technique to measure motion with a multi-aperture synthetic aperture radar. \n- Continued development of amplitude control of radar transmit waveforms. \n- Continued development of design and full-wave characterization of phased-array systems using the domain decomposition-finite element method. \n \nSoftware and Hardware for a Multi-Platform, Multi-Sensor Surveillance System: \n- Continued development of signal processing techniques to improve situational awareness and autonomous detection of hostile fire events in a dynamic urban clutter environment. \n- Completed development of technologies for a distributed, coherent surveillance network embedded in the background electromagnetic environment of a broadband wireless communication network.  \n- Completed distributed network research on waveforms funded in prior year via 0601153N.\n- Initiated modeling and simulation of shipboard and airborne RF networked sensors to characterize their performance in a challenge environment.\n- Initiated field measurement to characterize coherent and non-coherent position, navigation, timing and communications requirements. \n\nSmall UAV Collision Avoidance\/Autonomy Technology:\n- Continued development of research technologies and analytical algorithms for an effective and highly reliable collision avoidance system.\n \nLong Range Radio Frequency (RF) Identification (ID): \n- Continued studies for Long Range RFID techniques and initial hardware designees."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Radar Architectures, Sensors, and Software which Address Ballistic Missile and Littoral Requirement Shortfalls: \n- Continue all efforts of FY 2015 less those noted as complete above.\n\nAlgorithms, Sensor Hardware, and Signal Processing Techniques for Automated Radar Based Contact Mensuration And Feature Extraction:\n- Continue all efforts of FY 2015.\n- Complete development of a technique to measure motion with a multi-aperture synthetic aperture radar.\n- Complete development of amplitude control of radar transmit waveforms. \n- Complete development of design and full-wave characterization of phased-array systems using the domain decomposition-finite element method. \n\nSoftware and Hardware for a Multi-Platform, Multi-Sensor Surveillance System:\n- Continue all efforts of FY 2015 less those noted as complete above. \n\nSmall UAV Collision Avoidance\/Autonomy Technology:\n- Continue all efforts of FY 2015.\n\nLong Range Radio Frequency (RF) Identification (ID):\n- Continue all efforts of FY 2015."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.749"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.749"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Radar Architectures, Sensors, and Software which Address Ballistic Missile and Littoral Requirement Shortfalls: \n- Continue all efforts of FY 2016 less those noted as complete above.\n\nAlgorithms, Sensor Hardware, and Signal Processing Techniques for Automated Radar Based Contact Mensuration And Feature Extraction:\n- Continue all efforts of FY 2016 less those noted as complete above.\n\nSoftware and Hardware for a Multi-Platform, Multi-Sensor Surveillance System:\n- Continue all efforts of FY 2016 less those noted as complete above.\n\nSmall UAV Collision Avoidance\/Autonomy Technology:\n- Continue all efforts of FY 2016 less those noted as complete above.\n\nLong Range Radio Frequency (RF) Identification (ID):\n- Continue all efforts of FY 2016 less those noted as complete above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "VACUUM ELECTRONICS POWER AMPLIFIERS"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop millimeter wave (MMW) and sub-MMW power amplifiers for use in Naval all-weather radar, surveillance, reconnaissance, electronic attack, and communications systems.  The technology developed cannot, for the most part, be obtained through commercial off the shelf (COTS) as a result of the simultaneous requirements placed on power, frequency, bandwidth, weight, and size.  Responding to strong interests from the various user communities, efforts are focused on the development of technologies for high-data-rate communications, electronic warfare and high-power radar applications at MMW and upper-MMW regime.  The emphasis is placed on achieving high power at high frequency in a compact form factor.  Technologies include utilization of spatially distributed electron beams in amplifiers, such as sheet electron beams and multiple-beams, and creation of simulation based design methodologies based on physics-based and geometry driven design codes.\n\nThe current specific objectives are:\n\na) High Power Millimeter and Upper Millimeter Wave Amplifiers: Develop science and technology for high power millimeter and upper millimeter wave amplifiers including high current density diamond cathodes, sheet and multiple electron beam formation and mode suppression techniques in overmoded structures.\n\nb) Lithographic Fabrication Techniques: Develop lithographic fabrication techniques for upper-millimeter wave amplifiers.\n\nc) Accurate and Computationally Effective Device-Specific Multi-Dimensional Models for Electron Beams: Develop accurate and computationally effective device-specific multi-dimensional models for electron beam generation, large-signal and stability analysis to simulate device performance and improve the device characteristics.\n\nFunding decrease from FY16 to FY17 is a result of the completion of amplifier activities.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.197"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "High Power Millimeter and Upper Millimeter Wave Amplifiers: \n- Completed effort to develop a Density Modulated Electron Source.\n- Completed electromagnetic modeling and cold testing of beam-wave interaction structures for W-band amplifiers having octave bandwidth.\n- Initiated effort to develop and experimentally demonstrate a new class of miniature, broad-band-width millimeter wave (MMW) amplifiers having five times the power-to-weight ratio of existing state-of-the-art broadband MMW amplifiers. \n\nLithographic Fabrication Techniques: \n- Continued effort to develop 220 GHz millimeter-wave amplifiers employing electromagnetic structures that are microfabricated using lithographic techniques. \n- Continued effort to produce a high-power (>100 W) millimeter-wave vacuum electronic amplifier at G-band using microfabrication techniques developed at NRL in conjunction with a new type of high-gain interaction circuit. \n- Initiated effort to develop new 3-D microfabrication techniques for upper millimeter-wave to terahertz electromagnetic (EM) circuits in complex geometries not possible by conventional methods, enabling unprecedented design freedom for high power active and passive devices. \n\nAccurate and Computationally Effective Device-Specific Multi-Dimensional Models for Electron Beams:\n- Continued effort to develop a cascaded multiple-beam traveling wave amplifier, which is expected to provide unprecedented linear output power at millimeter wave frequencies (~30-40 GHz)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.464"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "High Power Millimeter and upper Millimeter Wave Amplifiers\n- Continue all efforts of FY 2015, unless noted as completed above.\n\nLithographic Fabrication Techniques: \n- Continue all efforts of FY 2015, unless noted as completed above.\n- Complete effort to produce a high-power (>100 W) millimeter-wave vacuum electronic amplifier at G-band using microfabrication techniques developed at NRL in conjunction with a new type of high-gain interaction circuit.\n\nAccurate and Computationally Effective Device-Specific Multi-Dimensional Models for Electron Beams:\n- Complete effort to develop a cascaded multiple-beam traveling wave amplifier, which is expected to provide unprecedented linear output power at millimeter wave frequencies (~30-40 GHz)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.747"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.747"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "High Power Millimeter and upper Millimeter Wave Amplifiers\n- Continue all efforts of FY 2016, unless noted as completed above. \n\nLithographic Fabrication Techniques\n- Continue all efforts of FY 2016, unless noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NETTED EMULATION OF MULTI-ELEMENT SIGNATURES AGAINST INTEGRATED SENSORS (NEMESIS) INNOVATIVE NAVAL PROTOTYPE (INP)"
                                    },
                                    "Description": {
                                        "val": "The objective is to develop a System of Systems (SoS) able to coordinate distribute EW resources against many adversary surveillance and targeting sensors simultaneously. It will benefit the warfighter by providing platform protection across the battlespace against many sensors, creating seamless cross-domain countermeasure coordination, and enabling rapid advanced technology\/capability insertion to counter emerging threats. \n\na) Develop reconfigurable and modular EW payloads, Distributed Decoy and Jammer Swarms (DDJS), effective multi-spectral countermeasures (CM), and Multiple Input\/Multiple Output Sensor\/CM (MIMO S\/CM) for platform protection across operational domains.\n\nThe increase from FY16 to FY17 in the Nemesis program is due to hardware procurement and conducting field experiments of Nemesis technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.716"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of the NEMESIS EW payloads and their integration into platforms. \n- Continued research supporting distributed control, coordination and networking of NEMESIS payloads and platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.725"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.725"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This PE supports the development of technologies that address technology needs associated with Naval platforms for new capabilities in EO\/IR Sensors, Surveillance, Electronic Warfare, Navigation, Solid State Electronics, Vacuum Electronics Power Amplifiers, and Nanoelectronics. The program supports development of technologies to enable capabilities in Missile Defense, Directed Energy, Platform Protection, Time Critical Strike, and Information Distribution. Each PE Activity has unique goals and metrics, some of which include classified quantitative measurements.  Overall metric goals are focused on achieving sufficient improvement in component or system capability such that the 6.2 applied research projects meet the need of, or produce a demand for, inclusion in advanced technology that may lead to incorporation into acquisition programs or industry products available to acquisition programs.\n\nSpecific examples of metrics under this PE include:\n\n- Provide a secure, over the horizon, on-the- move capability to communicate with higher headquarters at a data rate of 256-512 Kbps at a cost of $75,000.\n- Provide an array configuration suitable for installation on aircraft that will support Tactical Common Data Link (TCDL) data rates of 10.7 and 45 Mbps at greater than 150 nautical mile range.\n- Develop prototype Ku band phased array apertures in a form factor suitable for installation on the CVN-78."
                        }
                    }
                }
            ]
        }
    }
}