{
    "id": "707117a0968dad206750e42027b3766b6fa61df8",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA3_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603606A"
        },
        "ProgramElementTitle": {
            "val": "Landmine Warfare and Barrier Advanced Technology"
        },
        "R1LineNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "12.795"
            },
            "CurrentYear": {
                "val": "13.966"
            },
            "BudgetYearOne": {
                "val": "17.451"
            },
            "BudgetYearOneBase": {
                "val": "17.451"
            },
            "BudgetYearTwo": {
                "val": "18.659"
            },
            "BudgetYearThree": {
                "val": "18.644"
            },
            "BudgetYearFour": {
                "val": "18.972"
            },
            "BudgetYearFive": {
                "val": "19.352"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates sensor components, subsystems and neutralization technologies that can be used by dismounted forces as well as ground and air platforms to detect, identify and mitigate the effects of landmines, improvised explosive devices, minefields, and other explosive hazards\/threats. This PE also conducts modeling and simulation activities to assess the effectiveness of detection and neutralization concepts. Project 608 supports the maturation and demonstration of enabling component and subsystems for counter explosive hazards and countermine technologies in the areas of countermine and barrier development and Project 683 funds efforts on area denial sensors.  \n\nWork in this PE is fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602622A (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602712A (Countermine Systems), PE 0602784A (Military Engineering Technology), PE 0603004 (Weapons and Munitions Advances Technologies), PE 0603270 (Electronic Warfare Technology) and PE 0603710A (Night Vision Advanced Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.070"
                },
                "CurrentYear": {
                    "val": "13.993"
                },
                "BudgetYearOne": {
                    "val": "17.451"
                },
                "BudgetYearOneBase": {
                    "val": "17.451"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.795"
                },
                "CurrentYear": {
                    "val": "13.966"
                },
                "BudgetYearOne": {
                    "val": "17.451"
                },
                "BudgetYearOneBase": {
                    "val": "17.451"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.275"
                },
                "CurrentYear": {
                    "val": "-0.027"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.275"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.027"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "608"
                    },
                    "ProjectTitle": {
                        "val": "Countermine & Bar Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.795"
                        },
                        "CurrentYear": {
                            "val": "11.981"
                        },
                        "BudgetYearOne": {
                            "val": "15.465"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.465"
                        },
                        "BudgetYearTwo": {
                            "val": "16.674"
                        },
                        "BudgetYearThree": {
                            "val": "16.658"
                        },
                        "BudgetYearFour": {
                            "val": "16.986"
                        },
                        "BudgetYearFive": {
                            "val": "17.326"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates counter explosive hazard technologies for finding and neutralizing surface and buried threats in varying vegetation, soil, weather and diurnal conditions. Activities include remote\/standoff detection of individual explosive hazards and minefields and neutralization of explosive threats, landmines and minefields in both mounted and dismounted applications. This project also evaluates airborne explosive hazard detection sensors and fabricates them for lightweight plug-and-play use, on manned and Unmanned Aerial Systems (UASs) in mission specific applications. Efforts are supported by modeling and simulation assessments to define potential system effectiveness.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nThis Project supports Army science and technology efforts in the Ground Maneuver, Soldier, Air and Command, Control, Communications and Intelligence portfolios. \n\nWork in this Project is performed by the Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Ft. Belvoir, VA. Minefield neutralization efforts are closely coordinated with Navy\/US Marine Corps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Vehicle Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This project improves detection of low metal\/low contrast explosive threats buried in the road, such as Improvised Explosive Devices (IEDs) and antitank landmines. Currently, Ground Penetrating Radar (GPR) systems for detection of explosive threats in an electronic warfare environment are limited by radar receiver technology and detection latency. Improving the signal to noise ratio and acquisition rates reduces susceptibility of the systems to electromagnetic interference and improves the interoperability with electronic countermeasures, while continuing to improve detection rates and reduce false alarms. This project improves detection of explosive hazards when emplaced along the sides of roads. It also matures technologies to increase standoff detection and defeat distances, both in roads and off routes, enabling faster rates of advance and safer operations for early entry and route clearance missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.781"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a digital GPR array in a militarily relevant environment and evaluated detection performance against buried threat devices with and without presence of electronic countermeasures; integrated ground vehicle based, forward looking Electro-Optical\/Infrared (EO\/IR) sensor on a military vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.981"
                                            },
                                            "Text": {
                                                "val": "Mature target detection algorithms for digital GPR array for identification of explosive hazards in roads and for precision marking; mature forward looking EO\/IR sensor suite with optimized spatial and spectral resolutions, multi-step target detection algorithms and automated decision making tools to provide integrated capabilities; integrate EO\/IR and GPR sensors data and analysis architectures to fuse target nominations from the standoff and localization sensors into a Graphical User Interface (GUI); demonstrate Light Detection and Ranging (LIDAR) sensor to image and identify side attack targets and threats and baseline target detection algorithms to detect road side explosive hazards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.465"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.465"
                                            },
                                            "Text": {
                                                "val": "Will integrate optimized forward looking EO\/IR sensor suite with multi-step target detection algorithms and automated decision making tools to provide a robust vehicle mounted technology demonstrator; finalize forward looking EO\/IR to down looking GPR sensor cueing architectures and software to fuse target nominations from the standoff and localization sensors into a GUI; integrate LIDAR sensor to image and identify side attack targets and threats onto vehicle testbed; and optimize target detection algorithms to detect road side explosive hazards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This effort matures, fabricates and evaluates lab demonstrators based on two different technologies to improve dismounted forces' capability to detect IEDs and landmines. This effort develops an illumination capability and modifies target detection algorithms for integration into current demonstrator digital goggles. This helmet mounted capability will aid the dismounted forces as they execute route clearance missions by improving detection of command initiation wires, trip wires and indicators of IED emplacement such as disturbed earth. A next generation handheld explosive hazard detector technology will also be developed and matured with improved IED detection capabilities and Size, Weight, and Power (SWaP) characteristics. The next generation handheld detector technology may be inserted into the current AN\/PSS-14 Mine Detector as an upgrade or may be a new handheld detector."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.014"
                                            },
                                            "Text": {
                                                "val": "Demonstrated advanced handheld ground penetrating radar antenna and improved wideband metal detection coils and collected data in field conditions for development of improved target detection algorithms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "683"
                    },
                    "ProjectTitle": {
                        "val": "Area Denial Sensors"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.985"
                        },
                        "BudgetYearOne": {
                            "val": "1.986"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.986"
                        },
                        "BudgetYearTwo": {
                            "val": "1.985"
                        },
                        "BudgetYearThree": {
                            "val": "1.986"
                        },
                        "BudgetYearFour": {
                            "val": "1.986"
                        },
                        "BudgetYearFive": {
                            "val": "2.026"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates surveillance, command, and control technology components for alternative area protection systems that minimize the risk of injury or loss to non-combatants from exposure to anti-personnel landmines (APLs). The technology includes distributed personnel surveillance systems and command and control systems to be used with man-in-the-loop Overwatch fires. This project uses modeling and simulation to evaluate new concepts and doctrine. This project also fabricates components and system architectures, and it conducts evaluations in field settings.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nThis Project supports Army science and technology efforts in the Command, Control, Communications and Intelligence portfolios. \n\nWork in this Project is performed by the Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Area Denial Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates networked sensor and sensor fusion technology efforts to provide detection, identification, and classification for remotely delivered sensor systems and area denial munitions. Key technologies to be matured and demonstrated to meet requirements for man-in-the-loop command and control include deployable multi-mode sensors, fused sensor information, and local area network communications."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.985"
                                            },
                                            "Text": {
                                                "val": "Mature deployable multi-mode sensor architecture that can be integrated into remote delivery munitions, focusing on harsh shock environments; mature sensor fusion technologies to provide operator management of many remotely employed multi-mode sensor nodes to provide situational awareness and area denial effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.986"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.986"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate a hand emplaced sensor system that captures relevant threat signatures to increase probability of detection and decrease false alarms; will optimize sensor fusion technologies to provide operator management of multiple remotely employed sensor nodes to provide situational awareness and area denial effects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}