{
    "id": "71b10c000eb396bd69b0fde750e0889c08301be6",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603270F"
        },
        "ProgramElementTitle": {
            "val": "Electronic Combat Technology"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "45.548"
            },
            "CurrentYear": {
                "val": "46.946"
            },
            "BudgetYearOne": {
                "val": "58.250"
            },
            "BudgetYearOneBase": {
                "val": "58.250"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "60.851"
            },
            "BudgetYearThree": {
                "val": "64.445"
            },
            "BudgetYearFour": {
                "val": "61.607"
            },
            "BudgetYearFive": {
                "val": "60.800"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates technologies to support Air Force electronic combat warfighting capabilities.  The program focuses on developing components, subsystems, and technologies with potential aerospace combat, special operations, and airlift electronic combat applications in four project areas.  It develops and demonstrates technologies for integrating electronic combat sensors and systems into a fused and seamless whole.  It integrates and focuses research efforts in EW and cyber warfare to rapidly demonstrate a capability for rapid fielding.  It also develops and demonstrates advanced technologies for radio-frequency electronic combat suites and advanced warning and countermeasure technologies to defeat electro-optical, infrared, and laser threats to aerospace platforms.  This program has been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.\n\nStarting in FY 2017 to improve reporting to Congress, Project 634335, Cyber Concepts was created to capture all cyber activity that was previously performed under Project 633720, EW Quick Reaction Capabilities. \n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "47.508"
                },
                "CurrentYear": {
                    "val": "47.032"
                },
                "BudgetYearOne": {
                    "val": "54.250"
                },
                "BudgetYearOneBase": {
                    "val": "54.250"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "45.548"
                },
                "CurrentYear": {
                    "val": "46.946"
                },
                "BudgetYearOne": {
                    "val": "58.250"
                },
                "BudgetYearOneBase": {
                    "val": "58.250"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.960"
                },
                "CurrentYear": {
                    "val": "-0.086"
                },
                "BudgetYearOne": {
                    "val": "4.000"
                },
                "BudgetYearOneBase": {
                    "val": "4.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.086"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.886"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.074"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2017 due to increase DoD emphasis on advanced sensors technology."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "633720"
                    },
                    "ProjectTitle": {
                        "val": "EW Quick Reaction Capabilities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.632"
                        },
                        "CurrentYear": {
                            "val": "27.119"
                        },
                        "BudgetYearOne": {
                            "val": "30.912"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.912"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "28.107"
                        },
                        "BudgetYearThree": {
                            "val": "29.975"
                        },
                        "BudgetYearFour": {
                            "val": "30.598"
                        },
                        "BudgetYearFive": {
                            "val": "31.282"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project establishes a capability to rapidly assess, develop and demonstrate new electronic warfare concepts, techniques, and capabilities as well as the required navigation technologies and capabilities in the context of systemic electronic warfare (EW) effects (EW-threat interactions) in a congested\/contested electromagnetic spectrum (EMS), system-of-systems (SoS) environment of the future. It develops disruptive EW and countermeasures concepts specifically selected for high-impact, game-changing effects; evaluates them in high fidelity virtual and hardware evaluation settings; and demonstrates them in an operationally relevant environment. It establishes and maintains an all-source, physics-based, threat-to-countermeasures EW systems engineering methodology. It develops a core analytic function, supported by simulation-based wargaming and interactive engineering modeling capabilities to evaluate advanced countermeasures concepts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Disruptive EW and Countermeasure Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop disruptive EW and countermeasure concepts specifically selected for rapidly fieldable, high-impact effects and demonstrate them in an operational environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.457"
                                            },
                                            "Text": {
                                                "val": "Focused research on investigating the use of directed energy and cyber effects for EW use against Radio Frequency (RF) threats. Determined trade space and conducted experiments of these disruptive technologies against surrogate integrated air defense systems and other RF threats. Explored multi-spectral approaches to defend against these threat systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.069"
                                            },
                                            "Text": {
                                                "val": "Leverage developments in directed energy and cyber techniques to effectively simulate electronic attack against a modeled integrated air defense network to determine deficiencies in the attack capability.  Focus research methods to mitigate the determined deficiencies in attack methodology and develop alternative strategies for employment to enable successful suppression of integrated air defense systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.790"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.790"
                                            },
                                            "Text": {
                                                "val": "Continue to develop capability to use RF electronic attack (EA) techniques to deliver cyber effects.  Directly support the cyber efforts in Project 634335, Cyber Concepts, to model cyber effects on an integrated air defense system and simulate their utility.  Develop, integrate and demonstrate required navigation technologies required for distributed EA concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat-to-Countermeasure System of Systems (SoS) Methods"
                                    },
                                    "Description": {
                                        "val": "Establish and maintain an all-source, physics-based, design-level, red-blue, comparative, threat-to-countermeasure SoS techniques methodology. This systems engineering-based EW approach will inform programmatic planning, quantify desirable research areas with realistic SoS metrics, and foster improved understanding of future concept contributions to EW warfighting capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.020"
                                            },
                                            "Text": {
                                                "val": "Improved in-house system of systems analysis capabilities in order to develop new techniques to address multispectral EW threats. Conducted initial systems engineering research on new technology initiatives in order to provide physics based, metric-driven projects that will address threats to countermeasure systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.032"
                                            },
                                            "Text": {
                                                "val": "Demonstrate improvements in Systems of Systems (SoS) analysis capability through virtual simulation mechanisms.  Use metrics to show the value added proposition of multi-spectral techniques to address the threat to countermeasure system performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Continue to use System Engineering analysis techniques to identify the requirements for SoS operations in anti-access\/area-denial (A2\/AD) environments.  Specifically work toward showing how EW techniques and capabilities can be modeled and show support of mission operations (such as ISR or strike) in A2\/AD scenarios. Continue to develop, integrate and demonstrate required navigation technologies required for SoS operations in A2\/AD environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Evaluation of Advanced Countermeasure Concepts"
                                    },
                                    "Description": {
                                        "val": "Develop a core analytic function, supported by simulation-based wargaming and engineering modeling capabilities for evaluation, development, and demonstration of advanced EW, cyber, directed energy (DE) and integrated\/systemic, non-kinetic concepts to include special capability programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.155"
                                            },
                                            "Text": {
                                                "val": "Enhanced in-house analysis and assessment capability to include current threat arrays and allow the analysis of distributed EW techniques against these systems. These included hardware-in-the-loop (HWIL) and software-in-the-loop (SWIL) enhancements for EW, electro-optical (EO) \/ infrared (IR) countermeasures, avionics vulnerability, and positioning, navigation, and timing (PNT)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.018"
                                            },
                                            "Text": {
                                                "val": "Demonstrate reconfigurable closed-loop HWIL assessment capability for discovering and evaluating advanced EW techniques, including diverse distributed concepts.  The development of advanced techniques will ensure aircraft survivability against future threats with highly agile and adaptable waveform structures.   Demonstrate in-house analysis and assessment technologies for countering A2\/AD scenarios."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.122"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.122"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the navigation work in this effort originally was performed in Program 0603203F, Advanced Aerospace Sensors, Project 63655A, Advanced Aerospace Sensors Technology, under the effort Integrated Navigation Technologies.\n\nFor FY2017 and beyond, the advanced cyber technology work accomplished under this effort will be reported in Project 634335, Cyber Concepts, under the efforts, Avionics Cyber Vulnerabilities and Avionics Cyber Protections.\n\nDevelop adaptable threat emulation capability to simulate modern and expected threats for future conflicts.  Use these simulations to assess blue force hardware against these future red force systems.\nContinue development, integration and demonstration of required navigation technologies required for operations against modern threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63431G"
                    },
                    "ProjectTitle": {
                        "val": "RF Warning & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.774"
                        },
                        "CurrentYear": {
                            "val": "15.774"
                        },
                        "BudgetYearOne": {
                            "val": "19.671"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.671"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "20.284"
                        },
                        "BudgetYearThree": {
                            "val": "21.237"
                        },
                        "BudgetYearFour": {
                            "val": "17.539"
                        },
                        "BudgetYearFive": {
                            "val": "15.850"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced technologies for radio-frequency electronic combat suites, including the required navigation technologies and capabilities, to enhance the survivability of aerospace vehicles and to provide crew situational awareness.  The research addresses technologies for missile\/threat warning, radio-frequency receivers, electronic combat pre-processors, advanced sorting\/pre-processing algorithms, and expert software for applications on existing and future electronic combat systems.  The research also focuses on the development and demonstration of subsystems and components for generating on-board\/off-board radio-frequency countermeasure techniques.  This includes the development of electronic countermeasures techniques, as well as advanced electronic countermeasures technologies such as antennas, power amplifiers, and preamplifiers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Attack"
                                    },
                                    "Description": {
                                        "val": "Develop aerospace platform jamming technologies and techniques to counter advanced radio-frequency (RF) threats associated with current and future aerospace weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.774"
                                            },
                                            "Text": {
                                                "val": "Developed and conducted laboratory simulation experiments of adaptable EA technique concepts. Developed software prototype algorithms for cognitive jammer system concepts as well as protection of avionics systems to cyberattacks. Continued to develop and demonstrate in laboratory environment advanced Electronic Protection (EP) concepts to defeat next generation RF threats with a major emphasis on penetrating contested, anti-access\/area-denial scenarios."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.774"
                                            },
                                            "Text": {
                                                "val": "Leverage advances in cognitive machine learning to autonomously employ adaptable EA techniques against modern adaptive programmable threats.  Develop techniques to ascertain the efficacy of advanced EA methods employed against modern threats to close the loop allowing optimization of the EA technique."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.671"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.671"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the navigation work in this effort originally was performed in Program 0603203F, Advanced Aerospace Sensors, Project 63655A, Advanced Aerospace Sensors Technology, under the effort Integrated Navigation Technologies.\n\nContinue research into innovative EA techniques including use of distributed assets against integrated air defense networks and adaptable techniques for use against any threats.  Utilize over the air observables to alter technique parameters to more effectively address modern adaptive threats.  Develop, integrate and demonstrate required navigation technologies required for distributed EA concepts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "634335"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Concepts"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.635"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.635"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.534"
                        },
                        "BudgetYearThree": {
                            "val": "8.376"
                        },
                        "BudgetYearFour": {
                            "val": "8.517"
                        },
                        "BudgetYearFive": {
                            "val": "8.616"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates fundamental methods to discover cyber susceptibilities, assess avionics systems, formulate mitigation strategies, and investigate use of tools and technologies to automate this process.  It is designed to advance the science of avionics cyber vulnerabilities by understanding the fundamental nature of avionics vulnerabilities including: how they come about, how they can be discovered, how they can be quantified and categorized, how they can be exploited, and how they can be removed\/mitigated\/protected.\n\nProject 634335, Cyber Concepts is new for FY 2017. Work from this effort was previously performed under Project 633720, EW Quick Reaction Capabilities, in this program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Avionics Cyber Vulnerabilities"
                                    },
                                    "Description": {
                                        "val": "Develop methods, techniques, and technical tools to enable, assist, and improve the efficiency of assessments and vulnerability discovery processes.  Use developed tools and techniques to assess avionics boxes, systems, busses, and components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.464"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.464"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed in Project 633720, EW Quick Reaction Capabilities, under the effort Evaluation of Advanced Countermeasure Concepts.\n\nDevelop reverse engineering tools to specifically investigate vulnerabilities in embedded software and analysis tools to help ensure the embedded computer systems do not contain accessible vulnerabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Avionics Cyber Protections"
                                    },
                                    "Description": {
                                        "val": "Develop advanced automated analysis tools and protection techniques to prevent exploitation of cyber susceptibilities in avionics systems.  This strategy would include discovery and mitigation of likely attack vectors, remediation of susceptibilities, and safeguards to assure the integrity of embedded software."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.171"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.171"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed in Project 633720, EW Quick Reaction Capabilities, under the effort Evaluation of Advanced Countermeasure Concepts.\n\nInvestigate development of embedded system protection concepts for ARM-based processors (e.g., real-time attestation, code and data checking, control flow integrity)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63691X"
                    },
                    "ProjectTitle": {
                        "val": "EO\/IR Warning & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.142"
                        },
                        "CurrentYear": {
                            "val": "4.053"
                        },
                        "BudgetYearOne": {
                            "val": "5.032"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.032"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.926"
                        },
                        "BudgetYearThree": {
                            "val": "4.857"
                        },
                        "BudgetYearFour": {
                            "val": "4.953"
                        },
                        "BudgetYearFive": {
                            "val": "5.052"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates the advanced warning and countermeasure technologies required to negate electro-optical \/ infrared, (EO\/IR) and laser threats to aerospace platforms.  Develop off-board (decoys and expendables) and on-board countermeasure technologies  for aircraft self-protection to provide robust, affordable solutions for protection against infrared missiles with autonomous seekers, multi-spectral threats, laser-guided weapons, and EO\/IR tracking systems used to direct EO\/IR and radar-guided missiles."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Electro-Optical (EO)\/Infrared (IR) Warning and Countermeasure Technologies"
                                    },
                                    "Description": {
                                        "val": "Analyze the vulnerabilities of current IR missile systems and future imaging IR sensors. Develop advanced countermeasure system technologies to exploit vulnerabilities for use against IR and EO guided missile threats. Develop advanced optical and infrared sensor systems for airborne and space situational awareness and threat warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.142"
                                            },
                                            "Text": {
                                                "val": "Developed advanced EO\/IR concepts for protection from postulated future threats, including definition of component and subsystem requirements. Concepts addressed contested, anti-access\/area-denial threats. Conducted laboratory experiments of surrogate multi-mode EO\/IR sensors, processors, and track algorithms and continued to perform advanced proactive infrared countermeasure (PIRCM) search, detect, and countermeasure research."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.053"
                                            },
                                            "Text": {
                                                "val": "Continue the characterization and exploitation of advanced threat IR guided missiles and EO\/IR fire-control systems and sensors.  Develop high-fidelity surrogates, scene generation and modeling and simulation for testing and countermeasure development and verification\/correlation to hardware in the loop results.  Define the requirements for novel countermeasure effects against advanced IR and multispectral threats. Conduct tests with advanced, next generation missile warning, hostile fire indication (HFI) and laser warning technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.032"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.032"
                                            },
                                            "Text": {
                                                "val": "Develop advanced capability to defeat imaging optical sensors across the EO spectrum from ultra-violet (UV) to long-wave infrared wavelengths. Investigate low size, weight, power, and cost systems for smaller\/expendable platforms to enhance their survivability in active threat areas using the modeling and HWIL simulation capability established through this funding area."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}