{
    "id": "741fa95a8ec56beefce71c9ce6a1a7635167e364",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA1_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601103A"
        },
        "ProgramElementTitle": {
            "val": "University Research Initiatives"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "79.122"
            },
            "CurrentYear": {
                "val": "72.603"
            },
            "BudgetYearOne": {
                "val": "69.166"
            },
            "BudgetYearOneBase": {
                "val": "69.166"
            },
            "BudgetYearTwo": {
                "val": "69.339"
            },
            "BudgetYearThree": {
                "val": "70.730"
            },
            "BudgetYearFour": {
                "val": "71.205"
            },
            "BudgetYearFive": {
                "val": "72.701"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports the Multidisciplinary University Research Initiative (MURI), the Defense University Research Instrumentation Program (DURIP), the Presidential Early Career Awards for Scientists and Engineers (PECASE)\nprogram, and the Army's efforts in the Minerva Research Initiative (MRI).  The MURI program funds university based basic research in a wide range of scientific and engineering disciplines pertinent to maintaining land combat technology superiority.  Army MURI efforts involve teams of researchers investigating high-priority, transformational topics that intersect more than one traditional technical discipline (e.g., Intelligent Luminescence for Communication, Display, and Identification).  For many complex problems, this multidisciplinary approach serves to accelerate research progress and expedite transition of results to application.  The DURIP provides funds to acquire major research equipment to augment current, or devise new, research capabilities in support of Army transformational research.  The PECASE program funds single-investigator research efforts performed by outstanding academic scientists and engineers early in their independent research careers.  The MRI is a university-based social science research program.\n\nWork in this PE provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.   \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.   \n \nWork on this PE is performed by the Army Research Laboratory (ARL) located in Research Triangle Park, NC."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "89.776"
                },
                "CurrentYear": {
                    "val": "72.603"
                },
                "BudgetYearOne": {
                    "val": "72.741"
                },
                "BudgetYearOneBase": {
                    "val": "72.741"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "79.122"
                },
                "CurrentYear": {
                    "val": "72.603"
                },
                "BudgetYearOne": {
                    "val": "69.166"
                },
                "BudgetYearOneBase": {
                    "val": "69.166"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-10.654"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.575"
                },
                "BudgetYearOneBase": {
                    "val": "-3.575"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-8.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.654"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.575"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.575"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015: Congressional increase for University Research Initiatives - totaled $20M. Army reprogrammed $8M of the congressional increase to PE 0601102, Project T14 for proper execution of congressional intent - (i.e., for Single Investigator)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "D55"
                    },
                    "ProjectTitle": {
                        "val": "University Research Initiative"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "64.700"
                        },
                        "CurrentYear": {
                            "val": "69.573"
                        },
                        "BudgetYearOne": {
                            "val": "66.090"
                        },
                        "BudgetYearOneBase": {
                            "val": "66.090"
                        },
                        "BudgetYearTwo": {
                            "val": "66.209"
                        },
                        "BudgetYearThree": {
                            "val": "67.543"
                        },
                        "BudgetYearFour": {
                            "val": "67.955"
                        },
                        "BudgetYearFive": {
                            "val": "69.386"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the Multidisciplinary University Research Initiative (MURI), the Defense University Research Instrumentation Program (DURIP) and the Presidential Early Career Awards for Scientists and Engineers (PECASE) program.  The MURI program funds university based basic research in a wide range of scientific and engineering disciplines pertinent to maintaining land combat technology superiority.  Army MURI efforts involve teams of researchers investigating high-priority, transformational topics that intersect more than one traditional technical discipline (e.g. Intelligent Luminescence for Communication, Display, and Identification).  For many complex problems, this multidisciplinary approach serves to accelerate research progress and expedite transition of results to application.  The DURIP provides funds to acquire major research equipment to augment current, or devise new, research capabilities in support of Army transformational research.  The PECASE program funds single-investigator research efforts performed by outstanding academic scientists and engineers early in their independent research careers.\n\nWork in this project provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.   \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.   \n \nWork on this project is performed by the Army Research Laboratory (ARL) located in Research Triangle Park, NC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multidisciplinary University Research Initiative (MURI)"
                                    },
                                    "Description": {
                                        "val": "MURI programs are typically 5 years in length at a cost of $1.25 million per year."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.660"
                                            },
                                            "Text": {
                                                "val": "Provided support for MURI awards made in prior years and started eight new Fiscal Year (FY) 2015 (FY15) MURI awards critical to supporting the future force.  Effective transition mechanisms included collaboration among principal investigators, participation by 6.2\/6.3 program managers in MURI program reviews, and communication of the MURI research results to the ARL, Research Development and Engineering Centers (RDECs), Engineer Research and Development Center (ERDC), Medical Research and Materiel Command (MRMC), Army Research Institute for the Behavioral and Social Sciences (ARI) and industry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "53.136"
                                            },
                                            "Text": {
                                                "val": "Provide support for MURI awards made in prior years and start six to eight new FY16 MURI awards critical to supporting the future force.  Effective transition mechanisms include collaboration among principal investigators, participation by 6.2\/6.3 program managers in MURI program reviews, and communication of the MURI research results to the ARL, RDECs, ERDC, MRMC, ARI and industry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "53.134"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "53.134"
                                            },
                                            "Text": {
                                                "val": "Will provide support for MURI awards made in prior years, and will start six to eight new FY17 MURI awards critical to supporting the future force.  Effective transition mechanisms will include collaboration among principal investigators, participation by applied research and advanced technology development program managers in MURI program reviews, and communication of the MURI research results to the ARL, RDECs, ERDC, MRMC, ARI and industry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Presidential Early Career Awards for Scientists and Engineers (PECASE)"
                                    },
                                    "Description": {
                                        "val": "Supports PECASE investigators started in prior years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.329"
                                            },
                                            "Text": {
                                                "val": "Continued support for prior year awardees and selection of four new awards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.478"
                                            },
                                            "Text": {
                                                "val": "Continue support for prior year awardees and select four new awards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.546"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.546"
                                            },
                                            "Text": {
                                                "val": "Will continue support for prior year awardees and select four new awards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense University Research Instrumentation Program (DURIP)"
                                    },
                                    "Description": {
                                        "val": "Supports basic research through competitive grants for research instrumentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.711"
                                            },
                                            "Text": {
                                                "val": "Awarded competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.959"
                                            },
                                            "Text": {
                                                "val": "Award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.410"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.410"
                                            },
                                            "Text": {
                                                "val": "Will award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D58"
                    },
                    "ProjectTitle": {
                        "val": "URI ACTIVITIES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for University Research Initiatives."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "12.000"
                                        },
                                        "Text": {
                                            "val": "Congressional increase for University Research Initiatives - totaled $20M. Army reprogrammed $8M of the congressional increase to PE 0601102, Project T14 for proper execution of congressional intent (i.e., for Single Investigator)."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "V72"
                    },
                    "ProjectTitle": {
                        "val": "Minerva"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.422"
                        },
                        "CurrentYear": {
                            "val": "3.030"
                        },
                        "BudgetYearOne": {
                            "val": "3.076"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.076"
                        },
                        "BudgetYearTwo": {
                            "val": "3.130"
                        },
                        "BudgetYearThree": {
                            "val": "3.187"
                        },
                        "BudgetYearFour": {
                            "val": "3.250"
                        },
                        "BudgetYearFive": {
                            "val": "3.315"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the Minerva Research Initiative (MRI), a university-based social science research program initiated by the Secretary of Defense in Fiscal Year (FY) 2009.  It focuses on areas in the social sciences that are of strategic importance to national security policy which have not been substantially pursued in the past.  The Minerva research effort will be performed to understand the internal military-political dynamics of repressive regimes, the vulnerabilities of regimes and institutions to various kinds of disruption and instability, the nature of crowd dynamics, group violence, community belief structures, the potential to influence public opinion and attitudes in diverse cultures, cultural effects on network security and military operations, the influence of technology on military capabilities of potential adversaries and allies, and other intersections of social-cultural issues with military activities and national security.  Predictive models and other analysis tools will be developed.  Leveraging the expertise in the social sciences within the academic community is needed to provide understanding of the roots of terrorist organizations and the challenges and opportunities for military operations in a culturally diverse environment.  Better understanding at a fundamental level and new computational tools will provide a beneficial impact on war fighting capabilities at the national policy, military strategy, operational, and tactical levels, and will enhance the capabilities of intelligence activities at all levels.  All research results are open source.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "The Minerva Research Initiative (MRI)"
                                    },
                                    "Description": {
                                        "val": "The MRI is a university-based social science research program initiated by the Secretary of Defense.  It focuses on areas in the social sciences of strategic importance to national security policy.  It seeks to increase the Department's intellectual capital in the social sciences and improve its ability to address future challenges and build bridges between the Department and the social science community.  Minerva will bring together universities, research institutions, and individual scholars and support multidisciplinary and cross-institutional projects addressing specific topic areas determined by the Department."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.422"
                                            },
                                            "Text": {
                                                "val": "Tested theories on the direct and indirect effects of characteristics of natural resources on violence and state stability, which have provided predictive models of the relationship between natural resources and conflict, and provided options for anticipating and mitigating the acceleration of violence around the globe; and performed social scientific surveys with neuroscientific brain imaging revealing the role of moral values in social mobilization which in the long term provides effective strategies and policies in reducing organized violence and preventing its contagion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.030"
                                            },
                                            "Text": {
                                                "val": "Design and validate new quantitative models to identify the antecedents of civil unrest and violence, to generate new predictive models of the relationship between social systems, natural systems, and sociopolitical instability worldwide, enabling enhanced Army capacity to detect emerging political instabilities; and develop integrated geo-coded databases and time series data sets from existing archives to serve as experimental test beds for developing and validating predictive theories to identify potential hotspots for violence and instability that will aid in Army development of strategies for early intervention and reduction of sociopolitical violence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.076"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.076"
                                            },
                                            "Text": {
                                                "val": "Will develop and validate new computational models that represent how failures in telecommunications, energy, transportation, and economic, systems propagate into civil and governmental systems, thus putting nations and regions at risk of conflict and sociopolitical instability,  Will build and validate new models for interdependence between natural resources and state power structures.  This work will provide insight regarding national and regional risk of conflict, sociopolitical instability, and threat of violence resulting from studied failures allowing for the development of appropriate mitigation and intervention strategies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}