{
    "id": "744c320f60734301f5de42bf025ff99fbdd3569f",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA3_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603002A"
        },
        "ProgramElementTitle": {
            "val": "Medical Advanced Technology"
        },
        "R1LineNumber": {
            "val": "30"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "104.997"
            },
            "CurrentYear": {
                "val": "108.584"
            },
            "BudgetYearOne": {
                "val": "68.365"
            },
            "BudgetYearOneBase": {
                "val": "68.365"
            },
            "BudgetYearTwo": {
                "val": "70.847"
            },
            "BudgetYearThree": {
                "val": "71.919"
            },
            "BudgetYearFour": {
                "val": "73.341"
            },
            "BudgetYearFive": {
                "val": "74.463"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2017 the Clinical and Rehabilitative Medicine efforts will move from Project 840 to Project ET5. Starting in FY17 Project FH4 funding and research will move to Project MM3."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) maturates and demonstrates advanced medical technologies including drugs, vaccines, medical diagnostic devises, measures for identification and vector control, and developing medical practices and procedures to effectively protect and improve the survivability of United States Forces across the entire spectrum of military operations. Tri-Service coordination and cooperative efforts are focused in four principal medical areas: Combat Casualty Care, Military Operational Medicine, Militarily Relevant Infectious Diseases, and Clinical and Rehabilitative Medicine. \n \nPromising medical technologies are refined and validated through extensive testing, which is closely monitored by the U.S. Food and Drug Administration (FDA) and Environmental Protection Agency (EPA), as part of their processes for licensing and\/or approving new medical products. The FDA requires medical products to undergo extensive preclinical testing in animals and\/or other models to obtain preliminary effectiveness and safety information before they can be tested in human clinical trials. Clinical trials are conducted in three phases to prove the safety of a drug, vaccine, or device for the targeted disease or medical condition, starting in Phase 1 with a small number of healthy volunteers. Following Phase 1, Phase 2 clinical trials will provide expanded safety data and evaluate the effectiveness of a drug, vaccine, or medical device in a larger population of patients having the targeted disease or medical condition. Each successive phase includes larger numbers of human subjects and requires FDA cognizance prior to proceeding. Work conducted in this PE primarily focuses on late stages of technology maturation activities required to conduct Phase 1 and 2 clinical trials. Some high-risk technologies may require additional maturation with FDA guidance prior to initiating these clinical trials. Such things as proof of product stability and purity are necessary to meet FDA standards before entering later stages of testing and prior to transitioning into a formal acquisition program where large Phase 3 pivotal trials will be conducted for licensure. Activities in this PE may include completion of preclinical animal studies and Phase 1 and 2 clinical studies involving human subjects according to FDA and EPA requirements. Promising medical technologies that are not regulated by the FDA are modeled, prototyped, and tested in relevant environments.\n\nBlast research and research into maturing field rations in this PE are fully coordinated with the United States Army Natick Soldier Research, Development, and Engineering Center. This coordination enables improved body armor design and rations for Soldiers. Additionally, the activities funded in this PE are externally peer reviewed and fully coordinated with all Services as well as other agencies through the Joint Technology Coordinating Groups of the Armed Services Biomedical Research Evaluation and Management (ASBREM) Community of Interest (COI).  The ASBREM COI, formed under the authority of the Assistant Secretary of Defense for Research and Engineering, serves to facilitate coordination and prevent unnecessary duplication of effort within the Department of Defense's biomedical research and development community, as well as its associated enabling research areas.\n\nProject 810 matures and demonstrates FDA-regulated medical countermeasures such as drugs, vaccines, and diagnostic systems to naturally occurring infectious diseases and wound infections of military importance, as identified by worldwide medical surveillance and military threat analysis.  The project also supports testing of personal protective measures such as repellents and insecticides regulated by the EPA. This project is being coordinated with the Defense Health Program.\n\nProject 840 validates studies on safety and effectiveness of drugs, biologics (medical products derived from living organisms), medical devices, and medical procedures intended to minimize immediate and long-term effects from battlefield injuries; advanced technology development and clinical studies for treatment of ocular and visual system traumatic injury; and restoration of function and appearance by regenerating skin, muscle, nerve and vascular and bone tissue in battle-injured casualties. Additionally, this project develops and realistically tests improved occupant protection systems through medical research to characterize mechanisms of injuries sustained by occupants of ground-combat vehicles subjected to underbody blast events, determine human tolerance limits to underbody blast forces, and develop tools to predict injuries to ground-combat vehicle occupants exposed to underbody blast forces. Starting in FY17 the funding for the Clinical and Rehabilitative Medicine Research Program moves from project 840 to project ET5.\n\nProject ET5 starts in FY17 and the funding for the Clinical and Rehabilitative Medicine Research Program moves from project 840 to project ET5. Project ET5 conducts validation studies on safety and effectiveness of drugs, biologics, medical devices, procedures, and rehabilitative strategies intended to minimize long-term effects from battlefield injuries. This project supports advancing technology supporting clinical and rehabilitative solutions to restore function of ocular and visual system post injury; and advancing regenerative techniques to restore the function and appearance of damaged tissues by regenerating skin, muscle, nerve, vascular and bone in battle-injured casualties. \n\nProject FH4 maturates, validates, and supports enhanced Force Health Protection of Soldiers against threats in military operations and training. Health-monitoring tools are matured to rapidly identify deployment stressors that affect the health of Joint Forces. These databases and systems enhance the DoDs ability to monitor and protect against adverse changes in health, especially mental health effects caused by changes in brain function. Force Health Protection work is conducted in close coordination with the Department of Veterans Affairs. The program is maturing the development of global health monitoring (e.g., development of neuropsychological evaluation methodologies), validating clinical signs and symptoms correlating to medical records, diagnosed diseases, and mortality rates. The key databases supporting this program are the Millennium Cohort Study and the Total Army Injury and Health Outcomes Database. These databases allow for the examination of interactions of psychological stress and other deployment and occupational stressors that affect Warfighter health behaviors. Starting in FY17 the FH4 funding and research will be merged into project MM3.\n\nProject MM3 supports the Medical and Survivability technology areas with laboratory validation studies and field demonstrations of biomedical products designed to counteract myriad environmental and physiological stressors, as well as materiel hazards encountered in training and operational environments to protect, sustain, and enhance Soldier performance. The key efforts are to demonstrate and transition technologies, as well as validate tools associated with Soldier survivability, injury assessment and prediction, assessments for post-concussive syndrome, and enhancing performance during continuous operations. The three main thrust areas are (1) Physiological Health and Environmental Protection, (2) Injury Prevention and Reduction, and (3) Psychological Health and Resilience. This project contains no duplication with any effort within the Military Departments and includes direct participation by other Services. Starting in FY17 the FH4 funding and research will be merged into project MM3.\n\nWork funded in this project PE is fully coordinated with efforts undertaken in PE 0602787A and the Defense Health Program.     \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n\nWork in this PE is performed by Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; United States Army Medical Research Institute of Infectious Diseases, Ft Detrick, MD; United States Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; United States Army Institute of Surgical Research, Joint Base San Antonio, TX; United States Army Aeromedical Research Laboratory (USAARL), Ft Rucker, AL; the Naval Medical Research Center (NMRC), Silver Spring, MD; United States Army Dental Trauma Research Detachment (USADTRD), Joint Base San Antonio, TX."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "106.264"
                },
                "CurrentYear": {
                    "val": "69.584"
                },
                "BudgetYearOne": {
                    "val": "68.365"
                },
                "BudgetYearOneBase": {
                    "val": "68.365"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "104.997"
                },
                "CurrentYear": {
                    "val": "108.584"
                },
                "BudgetYearOne": {
                    "val": "68.365"
                },
                "BudgetYearOneBase": {
                    "val": "68.365"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.267"
                },
                "CurrentYear": {
                    "val": "39.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "39.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.686"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.953"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "810"
                    },
                    "ProjectTitle": {
                        "val": "Ind Base Id Vacc&Drug"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.882"
                        },
                        "CurrentYear": {
                            "val": "18.719"
                        },
                        "BudgetYearOne": {
                            "val": "16.762"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.762"
                        },
                        "BudgetYearTwo": {
                            "val": "17.842"
                        },
                        "BudgetYearThree": {
                            "val": "18.004"
                        },
                        "BudgetYearFour": {
                            "val": "18.359"
                        },
                        "BudgetYearFive": {
                            "val": "18.607"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2017 the Drugs to Prevent\/Treat Parasitic Diseases and Vaccines for Prevention of Malaria research areas are merged into Advanced Technology on drugs and vaccines against parasitic diseases."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project maturates and demonstrates U.S. Food and Drug Administration (FDA)-regulated medical countermeasures such as drugs, vaccines, and diagnostic (identification of the nature and cause of a particular disease) systems to naturally occurring infectious diseases that are threats to deployed United States military forces. The focus of the program is on prevention, diagnosis, and treatment of diseases that can adversely impact military mobilization, deployment, and operational effectiveness. Prior to licensure of a new drug or vaccine to treat or prevent disease, the FDA requires testing in human subjects. Studies are conducted stepwise: first to prove the product is safe in humans, second to demonstrate the desired effectiveness and optimal dosage (amount to be administered) in a small study, and third to demonstrate effectiveness in large, diverse human populations. All test results are submitted to the FDA for evaluation to ultimately obtain approval (licensure) for medical use. This project supports the studies for safety and effectiveness testing on small study groups after which they transition to the next phase of development for completion of expanded safety and initial studies for effectiveness in larger populations. If success is achieved for a product in this project, the effort will transition into Advanced Development. The project also supports testing of personal protective measures that can reduce disease transmission from arthropods to include products such as repellents and insecticides, which are regulated by the Environmental Protection Agency (EPA). \n \nResearch conducted in this project focuses on the following four areas: \n(1) Prevention\/Treatment of Parasitic (organism living in or on another organism) Diseases\n(2) Bacterial Disease Threats (diseases caused by bacteria)\n(3) Viral Disease Threats (diseases caused by viruses)\n(4) Diagnostic Systems and Vector Identification and Control \n \nResearch is conducted in compliance with FDA regulations for medical products for human use and EPA regulations for insect-control products that impact humans or the environment (e.g., repellents and insecticides).\n\nWork is managed by Walter Reed Army Institute of Research (WRAIR) and the United States Army Medical Institute of Infectious Disease (USAMRIID) and coordinated with the Naval Medical Research Center (NMRC).  The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments.    \n\nPromising medical countermeasures identified in this project are further matured under Program Element 0603807A, Project 808.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.    \n  \nWork in this project is performed by the Walter Reed Army Institute of Research, Silver Spring, MD, and its overseas laboratories; USAMRIID, Fort Detrick, MD; and the NMRC, Silver Spring, MD, and its overseas laboratories. Significant work is conducted under a cooperative agreement with the Henry M. Jackson Foundation, Bethesda, MD.\n\nEfforts in this project support the Soldier portfolio and the principal area of Military Relevant Infectious Diseases."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Drugs to Prevent\/Treat Parasitic Diseases"
                                    },
                                    "Description": {
                                        "val": "This effort selects promising anti-parasitic drug candidates for treating malaria and leishmaniasis (a disease transmitted by sand flies) for testing in humans, prepares data packages required for FDA approval of testing in humans, and conducts that testing. Studies have shown that the malaria parasite can become resistant to existing drugs, which makes it necessary to continually research new and more effective treatments. In FY17 this research area and the Vaccines for Prevention of Malaria research area are merged into one task area titled Advanced Technology Research on drugs and vaccines against parasitic diseases."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.172"
                                            },
                                            "Text": {
                                                "val": "Advanced new generation drugs with improved therapeutic index (largest dose producing no toxic symptoms) through small animal model testing. Performed clinical testing for safety and effectiveness of new selected candidate drugs and drug combinations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.958"
                                            },
                                            "Text": {
                                                "val": "The down-selected compounds from Triazine group showing positive results in small animal testing in FY15 are used in clinical testing for safety and effectiveness in human volunteers. Conduct clinical testing to assess metabolism (break-down within human body) of 8-aminoquinoline class drugs (i.e. primaquine) to improve drug safety and effectiveness for treatment and prevention of relapsing malarias (persons getting sick second time after drug treatment). Transition best therapeutic (treatment or drug promoting disease healing) and preventive drug candidates to advanced development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vaccines for Prevention of Malaria"
                                    },
                                    "Description": {
                                        "val": "This effort selects candidate vaccines for various types of malaria, including the severe form of malaria (Plasmodium falciparum) and the less severe but relapsing form (Plasmodium vivax), prepares technical data packages required for FDA approval of testing in humans and conducts testing of promising malaria vaccine candidates in humans. A malaria vaccine would minimize the progression and impact of drug resistance and poor Warfighter compliance with taking preventive anti-malarial drugs. In FY17 this research area and the Drugs to Prevent\/Treat Parasitic Diseases research area are merged into one task area titled Advanced Technology Research on drugs and vaccines against parasitic diseases."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.014"
                                            },
                                            "Text": {
                                                "val": "Continued to conduct human safety and effectiveness clinical trials of new formulations of vaccine candidates supporting transition into Advanced Development. Conducted human clinical studies to assess how long malarial vaccination sustains protection levels. Down selected lead P. falciparum vaccine candidates for transition into Advanced Development"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.503"
                                            },
                                            "Text": {
                                                "val": "Continue conducting human safety and effectiveness clinical trials of new formulations of vaccine candidates including weakened (so they do not cause disease) malaria sporozoites (infective stage of the parasite) in human volunteers to assess their safety and effectiveness. Down-select the best vaccine candidate for transition to advanced development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Technology Research on drugs and vaccines against parasitic diseases"
                                    },
                                    "Description": {
                                        "val": "This effort selects promising anti-parasitic drug candidates for treating malaria and leishmaniasis for testing in humans, prepares data packages required for FDA approval of testing in humans. Studies have shown that the malaria parasite can become resistant to existing drugs, which makes it necessary to continually develop new and more effective and safe treatments. This effort selects candidate vaccines for various types of malaria, including the severe form of malaria (Plasmodium falciparum) and the less severe but relapsing form (Plasmodium vivax), prepares technical data packages required for FDA approval of testing in humans and conducts testing of promising malaria vaccine candidates in humans. A malaria vaccine would minimize the progression and impact of drug resistance and poor Warfighter compliance with taking preventive anti-malarial drugs. In FY17 the Vaccines for Prevention of Malaria research area and the Drugs to Prevent\/Treat Parasitic Diseases research area are merged into one task area titled Advanced Technology Research on drugs and vaccines against parasitic diseases."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.591"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.591"
                                            },
                                            "Text": {
                                                "val": "Will down-select a lead compound from Triazine group which will be used in clinical testing for safety and effectiveness (protection against controlled human malaria infection) in human volunteers. Will conduct clinical testing of eight-aminoquinoline class drugs (i.e. primaquine) to assess the break-down within human body in order to improve drug safety and effectiveness for treatment and prevention of relapsing malarias (persons getting sick second time after drug treatment). Will conduct trials in human volunteers with recombinant DNA and viral vector based vaccine candidates to assess their safety and effectiveness. Will test new particle based platform (self-assembling protein nanoparticle based vaccine) in humans to improve performance of selected vaccine candidates. Will down-select the best vaccine candidate for transition to advanced development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Disease Threats"
                                    },
                                    "Description": {
                                        "val": "This effort selects promising candidate vaccines against each of the three main bacterial causes of diarrheas (E. coli, Campylobacter, and Shigella; significant threat during initial deployments) for testing in human subjects. Data packages are prepared, as required for FDA approval, and testing is conducted in human subjects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.812"
                                            },
                                            "Text": {
                                                "val": "Conducted expanded vaccine candidate safety and effectiveness human clinical trials with two diarrheal pathogens, Shigella, and EnteroToxigenic E. coli (ETEC). Transitioned best successful down-selected vaccine candidates to Advanced Development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.518"
                                            },
                                            "Text": {
                                                "val": "Prepare data packages to present to the FDA for approval for human testing of vaccine candidates for bacterial diarrheal agents. Conduct extended safety and effectiveness studies by using different escalating doses of down selected vaccine candidates against each of the three diarrheal agents (Shigella, ETEC and Campylobacter) in human volunteers. Transition the best Shigella, ETEC & Campylobacter vaccine candidates, respectively, to Advanced Development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.880"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.880"
                                            },
                                            "Text": {
                                                "val": "Will complete clinical trials with monovalent (one type) additional vaccine candidates identified in FY16 to present to the FDA for approval for human testing of vaccine candidates for bacterial diarrheal agents. Will conduct extended safety\/efficacy\/dosing study in humans by using different escalating doses of candidate vaccines against Shigella, and ETEC. This will also allow understanding protection mechanisms of these vaccine candidates. Will transition the new Shigella, and ETEC vaccine candidates to Advanced Development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Disease Threats"
                                    },
                                    "Description": {
                                        "val": "This effort progresses the most promising vaccine candidates against dengue fever (a severe debilitating disease caused by a virus and transmitted by a mosquito), and hantavirus (severe viral infection that causes internal bleeding and is contracted from close contact with rodents) and conducts FDA-required nonclinical safety and protection testing (laboratory-based) in animals, prepare FDA investigational new drug technical data packages, and conducts clinical testing of candidate vaccines in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.782"
                                            },
                                            "Text": {
                                                "val": "Completed clinical testing of selected hantavirus and dengue vaccine candidates for safety and initiated expanded clinical studies to test the efficacy of the candidate vaccine in human volunteers. Initiated expanded clinical testing for efficacy studies with multivalent dengue vaccine in US adults with new vaccine lots. Also initiated clinical studies for effectiveness in dengue endemic countries with best down-selected candidates. Refined the final vaccine formulation and delivery into human body. Initiated the development of a human challenge model for all four dengue viruses. Under this model, volunteers vaccinated with a dengue vaccine candidate were deliberately \"challenged\" with attenuated dengue viruses to assess whether or not the candidate vaccine could prevent dengue infection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.116"
                                            },
                                            "Text": {
                                                "val": "Conduct assessments of vaccine effectiveness and safety among human populations immunized with experimental dengue vaccines. Continue development and testing of the experimental dengue human challenge model initiated in FY15. Continue clinical trials with candidate DNA vaccine against hantaviruses and continue to look for a commercial partner and a country where hantaviruses infections regularly occur, to conduct large scale clinical trials (FDA required). Coordinate with the FDA to establish specific guidelines for the licensure of a hantavirus DNA vaccine."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.035"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.035"
                                            },
                                            "Text": {
                                                "val": "Will assess safety and initial immunogenicity (ability to provoke an immune response) of vaccine candidates measured from sera and immune cells obtained from human volunteers enrolled in dengue vaccine trial conducted with commercial partner.  Will assess safety of controlled human dengue infection with newly developed Dengue attenuated viruses that will be used in future clinical trials in lieu of natural infection caused by mosquito bite to assess effectiveness of candidate dengue vaccines. Will assess if antibody responses will be acceptable over a traditional expanded safety, efficacy, and dosing studies in humans. There is currently no animal disease model for Hantavirus causing Hemorrhagic Fever with Renal Syndrome. Could prove difficult to conduct a traditional safety\/efficacy\/dosing study in humans for vaccine assessment due to the marginally low incidence of disease, we will pursue a vaccine efficacy evaluation strategy based on establishing surrogate markers of protection, i.e. antibodies that neutralize the virus(es) against the disease."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostics and Disease Transmission Control"
                                    },
                                    "Description": {
                                        "val": "This effort conducts human subject testing of FDA-regulated field medical diagnostic devices and EPA-approved measures to control arthropods (i.e. insects, ticks & mites)-borne pathogens (infectious agents) that cause diseases such as Q fever, Sand fly fever, and Japanese encephalitis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.102"
                                            },
                                            "Text": {
                                                "val": "Developed Rapid Human Diagnostic Devices (RHDD) in collaboration with industry partners and transitioned to Advanced Development. Tested vector (organisms that transmit disease) surveillance devices in field. Tested new vector control technologies with field applications and select best tools for military operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.624"
                                            },
                                            "Text": {
                                                "val": "Support projects to research and develop RHDDs for priority diseases and pathogens (infectious agents) that are usable at or near the point of need. Develop military relevant assays (i.e. panels differentiating diseases that have similar symptoms) to be transitioned for the next-generation diagnostic system (NGDS) platform. Continue to test new vector control technologies in the field."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.256"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.256"
                                            },
                                            "Text": {
                                                "val": "Will conduct laboratory and field evaluations with commercial partners and outside of the continental United States (OCONUS) laboratories to evaluate rapid diagnostic assays (RHDDs) and Arthropods Vector Rapid Detection Device (AVRDDs) for infectious agents of military importance. The aim is to conduct initial validation studies required to ensure that the commercial assay meets military requirements and has the potential to obtain the requisite regulatory clearances from the FDA to facilitate military use. Will test new generation spatial repellant(s) in the field for efficacy against insect and other arthropod vectors. Will test bite-protection\/resistance capability of repellant treated fabrics."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "814"
                    },
                    "ProjectTitle": {
                        "val": "NEUROFIBROMATOSIS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.000"
                        },
                        "CurrentYear": {
                            "val": "15.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Neurofibromatosis research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Neurofibromatosis Research Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "Neurofibromatosis Research Program"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "Neurofibromatosis Research Program"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "840"
                    },
                    "ProjectTitle": {
                        "val": "Combat Injury Mgmt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.559"
                        },
                        "CurrentYear": {
                            "val": "30.572"
                        },
                        "BudgetYearOne": {
                            "val": "19.131"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.131"
                        },
                        "BudgetYearTwo": {
                            "val": "19.907"
                        },
                        "BudgetYearThree": {
                            "val": "20.263"
                        },
                        "BudgetYearFour": {
                            "val": "20.660"
                        },
                        "BudgetYearFive": {
                            "val": "20.983"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2017 the Clinical and Rehabilitative Medicine funding will move to Project ET5."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures, demonstrates, and validates promising medical technologies and methods to include control of severe bleeding, treatment for traumatic brain injury (TBI), revival and stabilization of trauma patients, acute treatment of extremity (arms and legs) and facial injuries, treatment of severe burn wounds, treatment of single and multiple organ failures due to trauma, and predictive indicators and decision aids for life support systems. Post-evacuation medical research focuses on continued care and rehabilitative medicine for extremity, facial\/maxillary (jaw bone), and ocular (eye) trauma and leveraging recent innovations in regenerative medicine and tissue engineering techniques.  \n\nResearch conducted in this project focuses on the following six areas: \n\n(1) Damage Control Resuscitation \n(2) Combat Trauma Therapies \n(3) Traumatic Brain Injury \n(4) Combat Critical Care Engineering \n(5) Clinical and Rehabilitative Medicine (moves to project ET5 in FY17) \n(6) Underbody Blast Injury Assessment\n \nAll research is conducted in compliance with Food and Drug Administration (FDA) requirements for licensure of medical products for human use.   \n\nPromising efforts identified through applied research conducted under Program Element (PE) 0602787A, Project 874, are further matured under this Project.  Promising results identified under this Project (840) are further matured under PE 0603807A, Project 836.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the United States Army Dental & Trauma Research Detachment (USADTRD) and the United States Army Institute of Surgical Research (USAISR), Joint Base San Antonio, TX; the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; and the Armed Forces Institute of Regenerative Medicine (AFIRM), Fort Detrick, MD. \n\nEfforts in this project support the Soldier Portfolio and the principal areas of Combat Casualty Care and Military Operational Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort supports work required to validate safety and effectiveness of drugs and medical procedures to control bleeding, maintain metabolism (the chemical processes that are required to maintain life) and minimize harmful inflammation after major trauma. Efforts focus on stopping bleeding, preserving tissue function and preventing or minimizing secondary organ failure (including brain and spinal cord injury)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.772"
                                            },
                                            "Text": {
                                                "val": "Continued to evaluate hemostatic (acting to arrest bleeding or hemorrhage) medical products (drugs \/ devices) and techniques to control life threatening bleeding from areas of the body where tourniquets may not be effective such as within the chest and abdomen, and from large soft tissue (e.g. skin and muscle) injuries or injuries to the armpit or groin. Continued to evaluate drugs and biologics (medical products derived from living organisms) to reduce traumatic bleeding caused by inflammation. Conducted preliminary studies to help determine optimal conditions for extending platelet (a cell in blood that helps it clot) storage time and while also maintaining blood-clotting capability. These efforts support continued validation studies of novel blood platelet storage technologies for far-forward use."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.200"
                                            },
                                            "Text": {
                                                "val": "Continue research from FY15 to evaluate hemostatic drugs, biologics, devices and techniques in relevant traumatic bleeding shock models. Extend FY15 work, evaluate promising hemostatic devices designed to stop bleeding in body locations where tourniquets cannot be used; evaluations are done in manikins and normal human volunteers. Evaluate preclinical safety of emerging platelet storage technologies with respect to preserving platelet hemostatic function and preventing an adverse inflammation response."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.183"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.183"
                                            },
                                            "Text": {
                                                "val": "Will evaluate existing drugs, devices, and techniques to stop severe bleeding in relevant hemorrhagic shock models and in humans. Will validate small volume resuscitative therapies, i.e., medicinal products that protect blood-deprived tissues from further damage and restore normal cell function. Smaller volume resuscitative products permit the medic to carry more products in aid bag, which increases availability for use at the point of injury in far forward areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on work required to validate safety and effectiveness of drugs, biologics, and medical procedures intended to minimize immediate and long-term effects from battlefield injuries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.232"
                                            },
                                            "Text": {
                                                "val": "Performed analysis supporting development of a predictive model to estimate dental casualties for Soldiers entering a theater of operations. Continued research to improve repair of large volume muscle loss injuries using stem cell technologies, biological scaffolds (tissue engineered graft), and autologous (individual as both donor and recipient) muscle tissue therapies (use muscle from uninjured area of body to replace lost muscle)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.508"
                                            },
                                            "Text": {
                                                "val": "As follow on to research from FY15, evaluate therapies to reduce fibrosis (development of excessive connective tissue after injury) during recovery from large volume muscle loss injury and improve muscle functionality. Perform small clinical studies to characterize effects of traumatic and burn injuries on vital organ preservation, scarring, and need for pain-relieving drugs. Field an information product on a predictive model to estimate dental casualties for Soldiers entering a theater of operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.467"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.467"
                                            },
                                            "Text": {
                                                "val": "Will pre-clinically validate combined-agent (a bacteria-killing protein in combination with a chemical that disperses bacterial colonies) antibacterial wound treatments in a large animal contaminated facial, mouth wound model. As follow on to the FY16 work, will evaluate therapies that reduce excessive connective tissue formation following traumatic muscle injury to determine their effect on remaining muscle and surgical repair. Will perform clinical studies to determine factors that impede wound healing. Will perform clinical studies to determine the burden of excessive scarring from burn injuries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury (TBI)"
                                    },
                                    "Description": {
                                        "val": "This effort supports work required to validate safety and effectiveness of drugs, biologics, and medical procedures intended to minimize immediate and long-term effects from TBI."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.563"
                                            },
                                            "Text": {
                                                "val": "Continued pivotal clinical study to validate an assay to diagnose presence and severity of TBI at or near point of injury; continued clinical trial of candidate drug for treatment of TBI; and continued work to identify combination therapeutics that mitigate or reduce effects of TBI for advanced development and clinical trials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.062"
                                            },
                                            "Text": {
                                                "val": "Examine promising therapies to protect brain cells following TBI using relevant animal models of penetrating and concussive TBI. Perform studies to establish drug protocols targeting the sub-acute (within the first few days following TBI) and chronic TBI recovery phases. Continue research from FY15 to evaluate effectiveness (therapeutic effect or benefit) of different drug combinations to protect brain cells following TBI."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.192"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.192"
                                            },
                                            "Text": {
                                                "val": "Will begin pre-clinical and early clinical studies of post-TBI hyperthermia (TBI-induced fever). Will begin pre-clinical and early clinical studies of potential neuro-regenerative mechanisms (mechanisms to restore damaged brain tissue). Will validate neuroprotection therapies (therapies to protect brain tissue from further damage following a TBI event) using validated small animal model of polytrauma (multiple traumatic injuries)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Critical Care Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort supports development of diagnostic and therapeutic medical devices, algorithms, software, and data-processing systems for resuscitation, stabilization and life support, and development of improved critical care nursing practices to improve care of severely injured or ill casualties during transport and in theater hospitals and development and evaluation of technologies to treat vital organ failure caused by traumatic injury."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.871"
                                            },
                                            "Text": {
                                                "val": "Translated new arterial waveform (a graph obtained by monitoring the pressure in the arteries produced by the pumping of the heart) features to the development of algorithms for early identification of patients at greatest risk for developing shock. Continued research on ventilation strategies to improve brain status in casualties with TBI. Performed studies to identify means to improve critical care nursing practice in theater hospitals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.692"
                                            },
                                            "Text": {
                                                "val": "Evaluate militarily relevant pre-hospital care technologies used in existing civilian trauma system, including improved patient monitors with decision support algorithms to predict shock, life-saving intervention technologies and evaluation of telehealth direction of remote surgical procedure. Conclude work on ventilation strategies and transition to advanced development. Start clinical studies to support development of combat nursing clinical practice guidelines for en-route care and for management of sepsis (whole-body inflammation caused by an infection) in the burn intensive care unit. Perform translational studies of promising technologies to treat single and multiple organ failure due to trauma."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.289"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.289"
                                            },
                                            "Text": {
                                                "val": "Will use an animal model of survivable lung injury to test effectiveness of various therapeutic approaches. Will validate the FDA-approved Resuscitation Burn Decision Support System for other indications. Will continue work from FY16 to develop clinical practice guidelines for en-route nursing care and for identification and management of sepsis. Will perform clinical studies to determine best practice to prevent pressure ulcer development during evacuation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort supports clinical studies to advance treatment and restoration strategies of traumatically-injured tissues, to include skin, nerve, bone and ocular tissue to ultimately restore function and appearance. Areas of interest for regenerative medicine include healing without scarring, repair of compartment syndrome (muscle and nerve damage following reduced blood flow caused by swelling), replacement skin, and facial reconstruction. In FY17 the Clinical and Rehabilitative Medicine funding will move to project ET5."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.575"
                                            },
                                            "Text": {
                                                "val": "Conducted preclinical studies on drug delivery, diagnostic, tissue repair, and\/or treatment strategies for traumatic eye injury and evaluated the preclinical safety and efficacy of promising strategies to facilitate clinical transition. Further developed novel drug delivery, diagnostic, reconstructive, and regenerative strategies including novel biological materials and cell-based therapies for clinical transition; utilized and refined cell-based therapies (including stem cells) and tissue scaffolds to restore soft and bone tissue form and function; performed preclinical safety and efficacy studies; built upon promising approaches from FY2014 by continuing the clinical evaluation of candidate strategies for burn, scarless wound healing, bone and soft tissue repair, and strategies to repair the tissues of the extremities, craniomaxillofacial (head, neck, face and jaw), genital and abdominal body regions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.554"
                                            },
                                            "Text": {
                                                "val": "Execute preclinical studies of drug delivery, diagnostic, tissue repair, and\/or treatment strategies for traumatic eye injury and assess the preclinical safety and efficacy of promising strategies to facilitate clinical translation. Further advance novel drug delivery, diagnostic, reconstructive, and regenerative strategies including novel biological materials and cell-based therapies (i.e. stem cells) toward clinical translation; utilize and refine the combination of cell-based therapies and tissue scaffolds to restore soft and bone tissue form and function; enhance promising approaches from FY2015 by advancing to preclinical safety and efficacy studies to enable clinical evaluation of candidate strategies for burn, scarless wound healing, bone and soft tissue repair, and strategies to repair the tissues of the extremities, craniomaxillofacial, genital and abdominal regions. Evaluate improved monitoring technologies for tissue rejection during hand and face transplant procedures for advancement into clinical trials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Administrative Activities for Prior Year Clinical Trials"
                                    },
                                    "Description": {
                                        "val": "Contract law requires the government to fulfill its responsibilities for the life of the Congressional Special Interest (CSI) award as stated in the terms and conditions. Each award may have an execution and award management tail of up to 5 years post-award, which usually occurs 18 months after the start of the fiscal year. This effort concludes at the end of FY16."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.546"
                                            },
                                            "Text": {
                                                "val": "Continued funding for scientific expertise, legal, contracting, research protections, regulatory affairs, and resource support personnel to manage active projects in FY2015 to be closed out over the POM."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.556"
                                            },
                                            "Text": {
                                                "val": "Continue funding for scientific expertise, legal, contracting, research protections, regulatory affairs, and resource support personnel to manage active projects in FY2016 to be closed out over the Program Objective Memorandum (POM)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "945"
                    },
                    "ProjectTitle": {
                        "val": "BREAST CANCER STAMP PROCEEDS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.536"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project receives funds as proceeds from the sale of Breast Cancer Stamps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Breast Cancer Stamp Proceeds"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.536"
                                            },
                                            "Text": {
                                                "val": "Breast Cancer Stamp Proceeds"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "97T"
                    },
                    "ProjectTitle": {
                        "val": "NEUROTOXIN EXPOSURE TREATMENT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.000"
                        },
                        "CurrentYear": {
                            "val": "16.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Neurotoxin Exposure Treatment."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Peer-Reviewed Neurotoxin Exposure Treatment Parkinsons Research Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "16.000"
                                        },
                                        "Text": {
                                            "val": "Neurotoxin Exposure Treatment Parkinsons Research Program"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "16.000"
                                        },
                                        "Text": {
                                            "val": "Neurotoxin Exposure Treatment Parkinsons Research Program"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ET5"
                    },
                    "ProjectTitle": {
                        "val": "Adv Tech Dev in Clinical & Rehabilitative Medicine"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "11.656"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.656"
                        },
                        "BudgetYearTwo": {
                            "val": "11.731"
                        },
                        "BudgetYearThree": {
                            "val": "11.923"
                        },
                        "BudgetYearFour": {
                            "val": "12.162"
                        },
                        "BudgetYearFive": {
                            "val": "12.403"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2017 the Clinical and Rehabilitative Medicine funding will move from Project 840 to Project ET5."
                        },
                        "ProjectMissionDescription": {
                            "val": "Project ET5 conducts validation studies on safety and effectiveness of drugs, biologics (medical products derived from living organisms), medical devices, and medical procedures intended to minimize long-term effects from battlefield injuries; advanced technology development and clinical studies for treatment of ocular and visual system traumatic injury; and restoration of function and appearance by regenerating skin, muscle, nerve, vascular and bone tissue in battle-injured casualties. \n \nResearch conducted in this project focuses on Clinical and Rehabilitative Medicine\n\nAll research is conducted in compliance with Food and Drug Administration (FDA) requirements for licensure of medical products for human use.\n\nPromising efforts identified through applied research conducted under Program Element (PE) 0602787, Project ET4, are further matured under this Project.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the United States Army Institute of Surgical Research (USAISR), Joint Base San Antonio, TX; the Armed Forces Institute of Regenerative Medicine (AFIRM), and Multiple Institutions across the United States."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort supports clinical studies to advance treatment and restoration strategies of traumatically-injured tissues, to include skin, nerve, bone and ocular (eye) tissue to ultimately restore function and appearance. Areas of interest for regenerative medicine include healing without scarring, repair of compartment syndrome (muscle and nerve damage following reduced blood flow caused by swelling), replacement skin, facial reconstruction and vision restoration."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.656"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.656"
                                            },
                                            "Text": {
                                                "val": "Will execute preclinical studies of drug delivery, diagnostic, tissue repair, and\/or treatment strategies for traumatic eye injury and assess the preclinical safety and efficacy of promising strategies to facilitate clinical translation. Will conduct early human clinical trials to ensure the safety of an ocular bandage. Will further advance novel drug delivery, diagnostic, reconstructive, and regenerative strategies including the combination of novel biological materials and cell-based therapies (e.g. stem cells) to restore soft (e.g. skin, muscle, nerve, vascular) and bone tissue form and function toward clinical translation; will enhance promising approaches from FY 2016 by performing preclinical safety and efficacy evaluation of candidate strategies for burns, scarless wound healing, bone and soft tissue repair for application to the eyes, extremities, face, genitalia and abdominal body regions. Will continue to advance improved monitoring technologies for tissue rejection during hand and face transplant procedures and improved vascular technologies that reduce the requirement for vein harvest."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FH4"
                    },
                    "ProjectTitle": {
                        "val": "Force Health Protection - Adv Tech Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.626"
                        },
                        "CurrentYear": {
                            "val": "1.268"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Starting in Fiscal Year (FY) 2017 the FH4 funding and research will be merged into Project MM3."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project maturates, demonstrates, and supports enhanced Force Health Protection of Soldiers against threats in military operations and training. Health-monitoring tools are matured to rapidly identify deployment stressors that affect the health of Joint Forces. The key databases supporting this program are the Millennium Cohort Study and the Total Army Injury and Health Outcomes Database. These databases and systems enhance the Department of Defense (DoD) ability to monitor and protect against adverse changes in health, especially psychological\/ mental health effects caused by changes in brain function. Force Health Protection work is conducted in close coordination with the Department of Veterans Affairs. The program is maturing the development of holistic health monitoring (e.g., development of neuropsychological evaluation methods) and validating subclinical signs and symptoms correlating to medical records, diagnosed diseases, and mortality rates across a Soldier's career. These databases allow for the examination of interactions of psychological (mental) stress and other deployment and occupational stressors that affect Warfighter health behaviors.  \n\nThis project contains no duplication with any effort within the Military Departments and includes direct participation by other Services. The cited work is fully coordinated with Natick Soldier Research Development Engineering Command (NSRDEC), Natick, MA.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy. \n\nWork in this project is performed by the United States Army Center for Environmental Health Research (USACEHR), Fort Detrick, MD; the United States Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; and the Naval Health Research Center (NHRC), San Diego, CA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Health Research"
                                    },
                                    "Description": {
                                        "val": "This effort develops and validates novel tools and strategies to advance individualized operational exposure dosimetry (measures of exposure) and establish dose-response links between operational exposures and neurological (of or about the nerves and nervous system) and physical health. Dosimetry tools may include new technologies, human biomarkers (indicator of a process, event, condition or change within the body), objective physiologic markers, physiological) modeling, and validated algorithms to evaluate the health effects of military service, including deployments, and methods to detect a Warfighters exposure to environmental contamination and\/or toxic substances, e.g. toxic industrial chemicals (TIC). Starting in FY17 effort will be merged into project MM3."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.626"
                                            },
                                            "Text": {
                                                "val": "Assessed modifiable behaviors and those resilience factors that protect Warfighters from adverse mental or physical health outcomes. Assessed the economic burden of negative coping behaviors such as alcohol and tobacco use. This effort provided screening factors to assess military Family well-being and resilience."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.268"
                                            },
                                            "Text": {
                                                "val": "Advance and deliver innovative tools, approaches, and models for detecting and measuring a Warfighters' exposure to potentially toxic substances during operations. Provide dose-response links between operational exposures and neurological and physical health \/ well-being. Provide models for predicting the likelihood of neurological or physical injury as a result of operational exposure(s) to TICs. Deliver evidence-based guidance to inform policy makers to refine guidelines for individualized operational exposure dosimetry linked to neurological and physical injury."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM2"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL ADVANCE TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.000"
                        },
                        "CurrentYear": {
                            "val": "8.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Medical Advanced Technology Initiatives."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Military Burn Trauma Research Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Military Burn Trauma Research Program"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Military Burn Trauma Research Program"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM3"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Medical Protection & Performance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.394"
                        },
                        "CurrentYear": {
                            "val": "19.025"
                        },
                        "BudgetYearOne": {
                            "val": "20.816"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.816"
                        },
                        "BudgetYearTwo": {
                            "val": "21.367"
                        },
                        "BudgetYearThree": {
                            "val": "21.729"
                        },
                        "BudgetYearFour": {
                            "val": "22.160"
                        },
                        "BudgetYearFive": {
                            "val": "22.470"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Starting in Fiscal Year (FY) 2017 the FH4 funding and research will be merged into Project MM3."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the Medical and Survivability technology areas of the future force with laboratory validation studies and field demonstrations of biomedical products designed to protect, sustain, and enhance Soldier performance in the face of myriad environmental and physiological (human physical and biochemical functions) stressors and materiel hazards encountered in training and operational environments. This effort focuses on demonstrating and transitioning technologies as well as validated tools associated with biomechanical-based health risks, injury assessment and prediction, Soldier survivability, and performance during continuous operations. The four main thrust areas are (1) Physiological Health, (2) Environmental protection, (3) Injury Prevention and Reduction and (4) Psychological (mental) Health and Resilience.\n\nThis project contains no duplication with any effort within the Military Departments and includes direct participation by other Services. The cited work is fully coordinated with Natick Soldier Research Development (NSRDEC), Natick, MA. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by the United States Army Research Institute of Environmental Medicine (USARIEM), Natick, MA, and United States Army Aeromedical Research Laboratory (USAARL), Fort Rucker, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Physiological (human physical and biochemical functions) Health and Environmental Protection (Sleep Research\/Environmental Monitoring)"
                                    },
                                    "Description": {
                                        "val": "This effort supports and matures laboratory prototypes, nutritional interventions, and decision aids for the validation of physiological status and prediction of Soldier performance in extreme environments. This effort supports Technology-Enabled Capability Demonstration 1.b, Force Protection--Warfighter and Small Unit in FY2014-2016 and also supports capability demonstrations in the area of decreasing Warfighter physical burden in FY2014-2016."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.641"
                                            },
                                            "Text": {
                                                "val": "Performed field-studies to demonstrate the efficacy of nutritional interventions for optimizing Warfighter recovery from physical and mental injury. Validated algorithms and mathematical models capable of predicting cognitive status and monitoring recovery and healing from physical injury."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.736"
                                            },
                                            "Text": {
                                                "val": "Verify that nutritional approaches enhance recovery of brain function after injury. Demonstrate dining hall interventions that improve Warfighter diet quality. Validate models that can accurately predict recovery and safe return-to-duty."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.753"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.753"
                                            },
                                            "Text": {
                                                "val": "Will assess the impact of nutritionally optimized ration items on body composition and physiological status in Warfighters. Will determine the effectiveness of nutritional interventions (e.g. zinc, Omega-3 polyunsaturated fatty acids, etc.) for accelerating recovery from impact-acceleration head injury. Will begin modeling of cognitive performance with caffeine consumption based on reaction time data from laboratory studies. Will characterize intra-individual responsiveness under operationally relevant sleep-loss conditions. Assess physiological metrics (or biomarkers) that are associated with resilience and long term military career success."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection - Physiological (human physical and biochemical functions) Awareness Tools and Warrior Sustainment in Extreme Environments."
                                    },
                                    "Description": {
                                        "val": "This effort supports and maturates non-invasive technologies, decision-aid tools, and models to enhance Warfighter protection and sustainment across the operational spectrum. This effort provides the scientific basis for developing focused heating and cooling solutions to maintain fine motor dexterity, core temperature, and optimize physical and cognitive performance during cold-weather and hot-humid operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.278"
                                            },
                                            "Text": {
                                                "val": "Conducted a feasibility study to determine saliva biomarker panel to distinguish levels of dehydration in exertional exercise to prevent heat injury. Validated organ damage biomarkers correlation to clinical measures in heat stroke patients. Determined efficacy of drug treatments for heat injury and heat stroke recovery. Provided strategies for localized heating to optimize hand and finger dexterity for specific military tasks. Exploited nanomaterials (materials smaller than a one tenth of a micrometer in at least one dimension) for developing advanced focused heating approaches to prevent nonfreezing cold injury. Evaluated the efficacy of new pharmaceuticals to prevent acute mountain sickness and improve work performance at high altitude."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.759"
                                            },
                                            "Text": {
                                                "val": "Validate biomarkers of heat injured organ damage to clinical outcome measures. Validate effectiveness of interventions including targeted drug treatments for recovery from heat injury. Transition altitude sickness, acclimatization and task performance models to physiological status monitoring system(s) for end-user field validation studies. Refine localized heating strategies to improve hand dexterity and develop a militarily-relevant dexterity assessment method for cold weather operations and provide policy guidance for validated intervention strategies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.024"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.024"
                                            },
                                            "Text": {
                                                "val": "Will provide evidence-based practice recommendations; continue to validate more specific biomarkers of physiological adaptation, and mathematical models for optimizing health and performance against combinations of environmental threats. Will increase finger blood flow, fine-motor dexterity and thermal comfort using facial heating during exposure to cold air for integration into a microclimate heating prototype. Will validate a tool for modernizing dexterity assessment. The assessment instrument will capture many embedded cognitive and sensory components of dexterity such as problem solving, planning, attention, vision, tactile sensation, and proprioception (sense of how our bodies are positioned)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction"
                                    },
                                    "Description": {
                                        "val": "This effort supports and validates injury prediction tools and return-to-duty assessments for brain, spine, and chest injury from blast, blunt, and ballistic impact. This effort also addresses need for validated aeromedical standards and strategies to enable aircrew to effectively fight, navigate, & land under a range of degraded visual environments and provide aeromedical return to duty guidelines after neurosensory injury (deficits in the nervous system control of the senses: vision, hearing, taste, smell, and touch)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.637"
                                            },
                                            "Text": {
                                                "val": "Provided medical standards for protection against hearing and vestibular (sensory system supporting movement and sense of balance, located in the inner ear) injuries and ensured compatibility with military operations and maintenance of Warfighter situational awareness. Developed and validated improved sensory system injury countermeasures. Developed and validated computational models to predict the effects of the primary blast wave on the face and eyes. Developed field-forward, non-invasive tools that will aid medical staff decisions regarding treatment, prognosis, and return-to-duty following muscle and\/or other tissue injury."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.101"
                                            },
                                            "Text": {
                                                "val": "Work with combat developers to provide active and passive hearing protection standards. Refine and validate model(s) for predicting effects of hearing loss on speech intelligibility with hearing protection. Refine standards for improved sensory system countermeasures to be used by aircrew in degraded visual environments. Validate computational models that predict the effects of the primary blast wave on the face and eyes and incorporate into a decision aid for transition to commanders."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.842"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.842"
                                            },
                                            "Text": {
                                                "val": "Will validate objective assessment criteria for the prediction of central and peripheral acoustic and hearing-balance sensory nerve injury. Will validate metrics that predict the type and severity of blast induced eye and visual pathway injuries. Will develop and validate methodology and standards to guide the design of Warfighter eye protection compatible with modern military systems in aviation and enable optimal visual performance. Disseminate top clinical factors (disease\/injuries) that impact aircrew performance and provide recommendations to update policy papers. Will monitor and quantify the long-term effects of neurosensory injury on military occupational performance and the long term consequences of retaining Warfighters with previous neurosensory injuries. Will continue surveillance and documentation of best practices to improve and transition an updated neurosensory performance return to duty toolkit."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health and Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort supports and validates neurocognitive (relating to or involving the central nervous system and cognitive abilities) assessment and brain injury detection methods; and validates tools and preclinical methods to treat post-traumatic stress disorder in a military population. This effort also supports validation of interventions in Warfighters for post-traumatic stress disorder (PTSD), validation of biomarkers of individual PTSD symptoms, validation of methods to follow effectiveness of PTSD treatments, validation of neuroprotective (protection of nerves and nervous system) interventions and validation of strategies to prevent neurocognitive deficits (reduced ability to learn and comprehend) and symptomatology associated with brain injury."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.838"
                                            },
                                            "Text": {
                                                "val": "Provided guidance on the use of sleep measures to aid in the diagnosis, prognosis, and monitoring of recovery from a concussive event. Determined the utility of neurocognitive assessment tools (computerized tests that assess different aspects of cognitive functioning such as ANAM, DANA, ImPact, AXON, etc.) in conjunction with physiological data from other sources, such as blood biomarkers, for assessment of post-concussive symptoms. Validated algorithms that predict concussion injury and incorporated these into currently available blast-wave concussion sensor systems. Evaluated the efficacy of bright light therapy for PTSD treatment. Determined the gender-relevant signatures of PTSD and the changes in biomarker levels associated with PTSD onset during deployment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.429"
                                            },
                                            "Text": {
                                                "val": "Continue to validate previously developed strategies to reduce vulnerability to concussive injury during blast and impact exposures and promote recovery from concussion. Initiate investigation into the correlation of detailed PTSD symptomatology\/behavioral data with DNA, protein and food breakdown products (genomic, proteomic, and metabolic) biomarkers for stratification of PTSD into subtypes (each PTSD patient may not have the exact same list of symptoms so those that exhibit similar symptoms would be a categorical subtypes). Collect specimens pre- and post-treatment for identification of blood biomarkers associated with treatment response and identification of predictive markers associated with successful exposure therapy treatment. Continue collaborative support for research and data analysis with the Army University Affiliated Research centers, the University of California Santa Barbara Institute for Collaborative Biotechnologies and Systems Biology Enterprise."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.082"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.082"
                                            },
                                            "Text": {
                                                "val": "Will continue to expand the Systems Biology Enterprise PTSD biomarker research to identify the impact of treatment upon PTSD disease biomarkers and will begin relating biomarker change to specific interventions toward development of prescriptive intervention regimen. Will continue human research funding of randomized controlled trials of pharmacologic PTSD intervention (Rilouzal). Will continue animal model research focused upon identification of molecular level intervention targets for PTSD treatment and matching with available Food and Drug Administration (FDA) approved drugs (for off label use or Investigational New Drug (IND) consideration). Will produce a prototype mathematical model for concussion risk prediction (links likelihood of concussion to an impact or blast exposure) based on animal study data, data from high school and collegiate athletes, input from breacher blast-exposure studies and in-theater measurements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Health Research"
                                    },
                                    "Description": {
                                        "val": "This effort develops and validates novel tools and strategies to advance individualized operational exposure dosimetry (measures of exposure) and establish dose-response links between operational exposures and neurological and physical health. Dosimetry tools may include new technologies, human biomarkers objective physiologic markers, physiological modeling, and validated algorithms to evaluate the health effects of military service, including deployments, and methods to detect a Warfighters exposure to environmental contamination and\/or toxic substances, e.g. toxic industrial chemicals. The funding for this research effort was previously in project FH4 and moved to project MM3 in FY17."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.115"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.115"
                                            },
                                            "Text": {
                                                "val": "Will quantify dose-response relationships to operationally-relevant exposures in military personnel population specifically to permethrin (synthetic chemical, an insecticide and insect repellent) and polycyclic aromatic compounds (created when products like coal, oil, gas, and garbage are burned but the burning process is not complete). Will provide model parameters for assessment of real-time personal dose levels to operationally relevant exposures among the high risk military job population subgroups. Will document the specific patterns of health outcomes following exposure to permethrin and other operationally relevant chemicals."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}