{
    "id": "754e0b1ac58120f0d558cfdbaebe2898f9d4a21f",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA1_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601101A"
        },
        "ProgramElementTitle": {
            "val": "In-House Laboratory Independent Research"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "13.125"
            },
            "CurrentYear": {
                "val": "13.018"
            },
            "BudgetYearOne": {
                "val": "12.381"
            },
            "BudgetYearOneBase": {
                "val": "12.381"
            },
            "BudgetYearTwo": {
                "val": "11.971"
            },
            "BudgetYearThree": {
                "val": "11.540"
            },
            "BudgetYearFour": {
                "val": "11.723"
            },
            "BudgetYearFive": {
                "val": "11.958"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) supports basic research at the Army laboratories through the In-House Laboratory Independent Research (ILIR) program.  Basic research lays the foundation for future developmental efforts by identifying fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge.  The ILIR program serves as a catalyst for major technology breakthroughs by providing laboratory directors flexibility in implementing novel research ideas, by nurturing promising young scientists and engineers, and is used to attract and retain top doctoral degreed scientists and engineers.  The ILIR program also provides a source of competitive funds for peer reviewed efforts at Army laboratories to stimulate high quality, innovative research with significant opportunity for payoff to Army warfighting capability.  \n\nThis Program Element (PE) supports ILIR at the Army Materiel Command's (AMC) six Research, Development, and Engineering Centers (Project 91A); at the six U.S. Army Medical Research and Material Command Laboratories (Project 91C); the seven laboratories within the Corps Of Engineers' U.S. Army Engineer Research and Development Centers (Project 91D); and at the U.S. Space and Missile Defense Command (SMDC) Technical Center (Project F16).\n\nWork in the PE provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by AMC, the Medical Research Materiel Command (MRMC), the Engineer Research and Development Center (ERDC) (multiple sites); and the SMDC Technical Center (Huntsville,AL)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.427"
                },
                "CurrentYear": {
                    "val": "13.018"
                },
                "BudgetYearOne": {
                    "val": "12.381"
                },
                "BudgetYearOneBase": {
                    "val": "12.381"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.125"
                },
                "CurrentYear": {
                    "val": "13.018"
                },
                "BudgetYearOne": {
                    "val": "12.381"
                },
                "BudgetYearOneBase": {
                    "val": "12.381"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.302"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.302"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "91A"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-AMC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.300"
                        },
                        "CurrentYear": {
                            "val": "12.107"
                        },
                        "BudgetYearOne": {
                            "val": "11.457"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.457"
                        },
                        "BudgetYearTwo": {
                            "val": "11.031"
                        },
                        "BudgetYearThree": {
                            "val": "10.583"
                        },
                        "BudgetYearFour": {
                            "val": "10.747"
                        },
                        "BudgetYearFive": {
                            "val": "10.962"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds basic research within the Army Materiel Command's (AMC) Research, Development, and Engineering Centers (RDECs) and lays the foundation for future developmental efforts by identifying the fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Edgewood Chemical and Biological Center, Aberdeen Proving Grounds, MD within AMC, the Armaments Research, Development, and Engineering Center, Picatinny, NJ, the Tank and Automotive Research, Development, and Engineering Center, Warren, MI, the Natick Soldier Research, Development, and Engineering Center, Natick, MA, the Aviation and Missile Research, Development, and Engineering Center, Huntsville, AL, and the Communications and Electronics Research, Development, and Engineering Center, Ft. Monmouth, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Edgewood Chemical Biological Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in chemistry, biology, biotechnology, and aerosol for countering improvised explosive devices (IEDs), obscurants, and\/or target defeat.  Work in this project provides theoretical underpinnings for Program Element (PE) 0602622A (Chemical, Smoke, and Equipment Defeating Technologies)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.974"
                                            },
                                            "Text": {
                                                "val": "Conducted fundamental research to develop an understanding of rational molecular and nano-system design, synthetic biology, nano-scale chemical and biological sensing and signaling, molecular toxicology, interfacial phenomena of particulate matter (solid\/liquid) with chemical surfaces, and synthesis of new materials for protection, decontamination, and detection, and research the mathematics involved in data processing and interpretation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.018"
                                            },
                                            "Text": {
                                                "val": "Further fundamental research to understand rational molecular and nano-system design, synthetic biology, nano-scale chemical and biological sensing and signaling, molecular toxicology, interfacial phenomena of particulate matter (solid\/liquid) with chemical surfaces, and synthesis of new materials for protection, decontamination, and detection, and research the mathematics involved in data processing and interpretation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.033"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.033"
                                            },
                                            "Text": {
                                                "val": "Will further fundamental research to understand rational molecular synthesis and novel materials, synthetic biology, nano-scale chemical and biological sensing, molecular toxicology, aerosol sciences, interfacial phenomena of particulate matter (solid\/liquid) with chemical surfaces, and synthesis of new materials for protection, decontamination, and detection, and research the mathematics involved in data processing and interpretation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armaments Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in weapons component development, explosives synthesis\/detection and area denial.  Work in this project provides theoretical underpinnings for PE 0602307A (Advanced Weapons Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.657"
                                            },
                                            "Text": {
                                                "val": "Continued to solicit on a yearly basis new efforts to further basic research in areas such as advanced materials and nanotechnologies, more powerful energetics including those with insensitive munition properties, counter terrorism technologies, power and energy systems, smaller more lethal warheads and composite materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.655"
                                            },
                                            "Text": {
                                                "val": "Further basic research in areas such as advanced materials and nanotechnologies, more powerful energetics including those with insensitive munitions properties, counter terrorism technologies, power and energy systems, smaller more lethal warheads and composite materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.556"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.556"
                                            },
                                            "Text": {
                                                "val": "Will solicit new innovative research proposals to conduct fundamental research for developing technologies for lighter structural materials, nano-materials, area denial technologies, more powerful explosives, more lethal compact warheads, efficient thermal batteries and material coating technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tank-Automotive Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in ground vehicle technologies to include power, mobility, and unmanned systems.  Work in this project provides theoretical underpinnings for PE 0602601A (Combat Vehicle and Automotive Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.463"
                                            },
                                            "Text": {
                                                "val": "Investigated shock wave localization and propagation in layered media; research the combustion properties of new fuels; investigated discrete element modeling for granular terrain – vehicle interaction; studied on-wafer microwave nonreciprocal devices (isolators and circulators) based on artificial magnetic metamaterials and naturally anisotropic ferrite materials; researched manned\/unmanned teaming and cooperative mobility behaviors; researched incremental learning for autonomous systems; and researched optical limiter techniques and materials for laser protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.452"
                                            },
                                            "Text": {
                                                "val": "Conduct research in off-road mobility and terramechanics, materials for shock wave mitigation, nano-lubricants, analytical framework for autonomy-enabled systems, combustion for military logistics fuels, and modeling of cognitive burdens.  In-house research efforts address several Army-identified major research efforts for the future including materials science and multiscale modeling, intelligent\/autonomous systems, and human sciences."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.350"
                                            },
                                            "Text": {
                                                "val": "Will solicit on a yearly basis new and continuing efforts to further basic research in Army-centric areas such as development of analytical methodologies for autonomous and autonomy-enabled systems such as latency compensation, shared control, modeling of human cognition, proprioception and perception, next-generation battery systems, advanced combustion, off-road mobility\/terramechanics, materials and joining research as pertaining to lightweighting, armor materials\/mechanisms, Big Data analytics, newtork security for autonomous systems, aeroacoustics computational fluid dynamics, bio-inspired approaches to waste-water treatment, multi-functional additives for fuels\/lubricants, and pulse power applications to vehicle protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Natick Soldier Research, Development, and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in food sciences, textiles, and lightweight materials with potential for individual protection. Work in this project provides theoretical underpinnings for PE 0601102A (Defense Research Sciences), Project H52 (Equipment for the Soldier)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.365"
                                            },
                                            "Text": {
                                                "val": "Explored the unique physics of photonic nanomaterials for revolutionizing the performance and size of systems such as infrared (IR) detectors, power generation, and remote imaging; continued to explore the relationship between peptide structure on tailored structures for controlling and optimizing the destructive efficacy of antimicrobial peptides for multiple applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.350"
                                            },
                                            "Text": {
                                                "val": "Create a new two-dimensional (2D) computational modeling approach to enhance understanding of interactions between fluids (e.g., airflow) and structural forces to provide a foundation for design of parachutes and fabric shelters; examine novel approaches to tailor textile surface chemistry and\/or integration of advanced materials to allow creation of surfaces exhibiting true multifunctionality."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.246"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.246"
                                            },
                                            "Text": {
                                                "val": "Will assess newly modeled microrectenna arrays for their response to IR illumination; assess efficiency and adaptability of these microrectenna arrays for application in IR detectors, communication, and energy harvesting applications; explore the incorporation of bioactive peptides for increased stability of thin films."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Missile Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in guided missile and rocket systems, directed energy weapons, unmanned vehicles, and related components.  Work in this project provides theoretical underpinnings for PE 0602303A (Missile Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.746"
                                            },
                                            "Text": {
                                                "val": "Performed a pioneering demonstration of surface-enhanced analyte sensing and damage using plasmonic metal nanostructures; performed experimental test of analytic density matrix models in pump-probe spectroscopy; demonstrate chaotic dynamics in hybrid and non-smooth systems; pioneered innovative terahertz (THz) imaging techniques by combining state-of-the-art coherent imaging hardware and computational imaging methodologies; identified novel propagation phenomena that can dramatically modify\/enhance linear and nonlinear interactions with artificial, metal-based plasmonic materials and semiconductors; and performed an experimental study of plasmonic nanostructures in the enhanced transmission regime for applications to beam steering."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.608"
                                            },
                                            "Text": {
                                                "val": "Continue experimental test of analytic density matrix models in precision pump-probe spectroscopy; demonstrate chaotic dynamics in hybrid and non-smooth systems; pioneer innovative THz imaging techniques by combining state-of-the-art coherent imaging hardware and computational imaging methodologies; and develop novel high performance signal processing techniques for chaotic waveforms in radar and communications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.483"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.483"
                                            },
                                            "Text": {
                                                "val": "Will explore ultraviolet photocatalytic splitting of molecular bonds using plasmonic metal nanoparticles; investigate homomorphic encryption schemes (for tamper-proof signal processing); study new electromagnetic pulse propagation models that include nonlocal and quantum tunneling effects (to explore novel propagation phenomena and dramatically modify\/enhance linear and nonlinear interactions with artificial, metal-based plasmonic materials and semiconductors); pioneer polarization-sensitive terahertz holographic imaging (for mapping strain in opaque materials); explore use of chaotic waveforms (for transformative high resolution radar and tactical data communications); develop microwave hyperbolic metamaterials (for subwavelength antennas and resonators); and study theoretically and experimentally linear and nonlinear optical properties of graphene-based layered and textured nanostructures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Aviation Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for aviation enabling technologies in the areas of aerodynamics, structural dynamics, and material science.  Work in this project provides theoretical underpinnings for PE 0602211A (Aviation Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.560"
                                            },
                                            "Text": {
                                                "val": "Continued basic fluid dynamic research in the areas of vorticity dynamics, unsteady flow separation, and flow control to identify fundamental governing principles; completed analysis of wing\/vortex interaction; conducted detailed measurements of boundary layer response to flow control; and continued work to increase control authority of plasma devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.553"
                                            },
                                            "Text": {
                                                "val": "Explore novel approaches to increase flow control authority for rotating wing applications using plasma; develop experimental techniques to better measure and understand flow structures in the wake of multi-rotor configurations and their performance in hover; and explore novel control allocation strategies to optimize pilot work load for future vertical lift configurations with redundant controls."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.453"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.453"
                                            },
                                            "Text": {
                                                "val": "Will combine visualization and measurements of the flow features in the wake of a wing interacting with a passing vortex (to better understand the structure and evolution of the trailing wake, and its relation to the lift distribution on the generating wing); apply novel fluidic actuators for adverse force reduction; and develop novel computational algorithms to dramatically speed up computations on newly emerging exascale computer architectures using techniques such as parallelization in both time and space."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications-Electronics Research, Development, and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for communication and network enabling technologies in the areas of antenna design, network management, power generation and storage, and sensors.  Work in this project provides theoretical underpinnings for PE 0602705A (Electronics and Electronic Devices)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.535"
                                            },
                                            "Text": {
                                                "val": "Conducted research on a novel class of quasi-orthogonal waveforms that allow radar systems to perform their primary target detection mission while simultaneously allowing data sharing with other systems; investigated a new compressive sensing approach to adaptive target detection (can potentially ease antenna integration requirements for future multi-band\/multi-aperture systems and improve the spatial resolution for target detection); investigated the fundamental distributed reformation reactions which affects species production, soot (coke) formation with more favorable reformed product gases; investigated the fundamental electrochemical properties of applied composite solid electrolyte interface for lithium electrochemical cells; investigated how Compressive Sensing (CS) affects image quality and develop metrics and model for CS; investigated how carrier transport phenomenology in epitaxial multilayer structures contribute to the performance of infrared focal plane arrays (FPAs); and investigated graph anomaly detection to identify network intrusions using traffic flow graph analysis and anomaly detection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.471"
                                            },
                                            "Text": {
                                                "val": "Conduct research in data flow analysis as a supplemental theory for use in Satisfiability Modulo Theory (SMT) solvers to improve vulnerability detection by utilizing data-flow graphs coupled with SMT solvers; investigate an analytic method to calculate the probability and efficiency of message transmission via dynamic opportunistic devices across an undefined and uncooperative network; research the ability to perform signal processing by manipulating modes within a multi-mode optical fiber by utilizing the statistics of transmission properties and techniques for spatial division multiplexing to perform single and multi signal filtering within the optical fiber; investigate the performance of infrared detectors by researching high quantum efficiency Gallium-free long wave infrared nBn detectors grown on an aluminum antimonide (AlSb) lattice; research liquid phase heat transfer as a function of flow instability and vorticity intensity in microchannels with microcylinders with tip clearances to determine the optimum micro cylinder design in microchannels in three-dimensional (3D) stacked circuit architectures for electro-optics, radar, electronic warfare, communication and intelligence systems; investigate the fundamental electrochemical properties of applied composite solid electrolyte interface for lithium and divalent electrochemical cells; and investigate game theory based machine learning techniques to determine the feasibility of coordinating electronic warfare and tactical communications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.336"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.336"
                                            },
                                            "Text": {
                                                "val": "Will conduct research focusing on the mathematical foundations of a pre-processing technique to facilitate fully homomorphic cryptosystems; research designs of packaging material used in solid state and bipolar batteries; investigate novel architectures that utilize photonic detection and beam forming concepts in the design of a highly capable beam-former\/receiver (to alleviate the processing burden by exploring analog preprocessing and filtering techniques prior to digitization); create integratable thin film material heterostructures and explore novel process science techniques to enable high performance tunable filters for the next generation radar, electronic warfare and communications systems; research candidate target contrast metrics to improve parameters used in human vision model for high-contrast, low-contrast, and low-observable targets and investigate the psychophysics of noise in the Human Visual System (HVS) information processing chain by controlling “where” visual fusion takes place (e.g., temporal, left-right eye, or cognitive) to provide insight to how humans process fused image information and how the HVS filters information and noise; and research a planarization technique for infrared materials that yields a nearly flat surface with undamaged active layers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F16"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-SMDC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.825"
                        },
                        "CurrentYear": {
                            "val": "0.911"
                        },
                        "BudgetYearOne": {
                            "val": "0.924"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.924"
                        },
                        "BudgetYearTwo": {
                            "val": "0.940"
                        },
                        "BudgetYearThree": {
                            "val": "0.957"
                        },
                        "BudgetYearFour": {
                            "val": "0.976"
                        },
                        "BudgetYearFive": {
                            "val": "0.996"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides In-house Laboratory Independent Research (ILIR) at the US Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT), Technical Center.  This basic research on lasers and directed energy lays the foundation for future developmental efforts on high energy lasers and directed energy systems by identifying the fundamental principles governing various directed energy phenomena.  \n\nWork in this project is related to, and fully coordinated with, efforts in Program Element (PE) 0602307A (Advanced Weapons Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the USASMDC\/ARSTRAT, Technical Center, Huntsville, AL"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SMDC In-house Laboratory Independent Research (ILIR)"
                                    },
                                    "Description": {
                                        "val": "Funds basic research to investigate laser propagation phenomenology for application in modeling and simulation and future directed energy weapons design.  Activities in this proproject transition to High Energy Laser Technology in PE 0602307A (Advanced Weapons Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.825"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a diode pumped rare earth gas laser and begin assessing scalability and potential for very high efficiency operation; completed spectroscope research on Xenon as a potential rare earth gas laser for transition to advanced beam control efforts; completed 1.06 micron laser atmospheric propagation research for transition to solid state laser effects; and completed initial assessment of all-weather tracker phenomenology for transition to advanced beam control efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.911"
                                            },
                                            "Text": {
                                                "val": "Complete inductive radio frequency (RF) line widths, absorption, plasma control, and lifetimes investigations for an efficient Xenon laser; develop a Xenon high power laser scaling model; and complete comparison of different RF pumping mechanisms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.924"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.924"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to measure quenching of electron energy states of various buffer gas concentrations; investigate potential high power laser designs that use only efficient diode lasers without an additional laser gain media; and conduct experiments to measure effects of different innovative adaptive optics techniques for laser propagation in the presence of particulates."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}