{
    "id": "770b358386e363a74f67fa44ac1efb73226c3f09",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA6_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605702A"
        },
        "ProgramElementTitle": {
            "val": "Meteorological Support to RDT&E Activities"
        },
        "R1LineNumber": {
            "val": "148"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.289"
            },
            "CurrentYear": {
                "val": "8.303"
            },
            "BudgetYearOne": {
                "val": "6.925"
            },
            "BudgetYearOneBase": {
                "val": "6.925"
            },
            "BudgetYearTwo": {
                "val": "7.099"
            },
            "BudgetYearThree": {
                "val": "9.907"
            },
            "BudgetYearFour": {
                "val": "8.422"
            },
            "BudgetYearFive": {
                "val": "8.647"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This project provides meteorological support to research, development, test, and evaluation (RDT&E) activities and provides standard and specialized weather forecasts and data for test reports to satisfy Army\/Department of Defense RDT&E test requirements for modern weaponry, e.g., (1) unique atmospheric analysis and sampling to include atmospheric transmittance, extinction, optical scintillation, infrared temperature, aerosol\/smoke cloud dispersion characteristics, and ballistic meteorological measurements; (2) test event forecasting to include prediction of sound propagation for ballistic firing tests, specialized prediction of light levels and target to background measurements, and predictions for electro-optical testing and ballistic artillery\/mortar firing; and (3) advisory and warning products such as go\/no-go test recommendations for ballistic and atmospheric probe missiles, smoke\/obscurant tests, hazard predictions for chemical agent munitions disposal, monitoring dispersion of simulant clouds for chemical\/biological detector tests, simulated nuclear blasts, and weather warnings for test range safety.  Provides technical support to Army Program Executive Officers (PEOs), Project Managers (PMs), and the Army test ranges and sites at: White Sands Test Center (WSTC) White Sands Missile Range, New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; West Desert Test Center (WDTC), Dugway Proving Ground, Utah; Aberdeen Test Center (ATC), Aberdeen  Proving Ground, Maryland; Redstone Test Center (RTC), Redstone Arsenal, Alabama;  Yuma Test Center (YTC), Yuma Proving Ground, Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska); Operational Test Command (OTC), Fort Hood, Texas and Fort Bragg, North Carolina. This program develops methodologies and acquires instrumentation and systems that allow meteorological teams to support current and future Army\/DoD RDT&E requirements.  It finances indirect meteorological support operating costs not billable to customers and replacement\/upgrade of meteorological instrumentation and support systems.  Direct costs for meteorological support services are not funded by this PE, but are borne by the customer (i.e., materiel\/weapons developers and project\/product managers) in accordance with DoD Directive 7000.14R, October 1999.  This program enables more effective test scheduling and execution, and is essential to the accomplishment of the Army's developmental and operational test mission in that precise weather modeling and measurements directly influence test item performance and quantify test item weather dependencies and vulnerabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.411"
                },
                "CurrentYear": {
                    "val": "8.303"
                },
                "BudgetYearOne": {
                    "val": "6.297"
                },
                "BudgetYearOneBase": {
                    "val": "6.297"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.289"
                },
                "CurrentYear": {
                    "val": "8.303"
                },
                "BudgetYearOne": {
                    "val": "6.925"
                },
                "BudgetYearOneBase": {
                    "val": "6.925"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.122"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.628"
                },
                "BudgetYearOneBase": {
                    "val": "0.628"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.122"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.628"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.628"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 increase is because of life cycle replacement for high performance system required to operate 4DWX weather model."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "128"
                    },
                    "ProjectTitle": {
                        "val": "Meteorological Support To RDT&E Activities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.289"
                        },
                        "CurrentYear": {
                            "val": "8.303"
                        },
                        "BudgetYearOne": {
                            "val": "6.925"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.925"
                        },
                        "BudgetYearTwo": {
                            "val": "7.099"
                        },
                        "BudgetYearThree": {
                            "val": "9.907"
                        },
                        "BudgetYearFour": {
                            "val": "8.422"
                        },
                        "BudgetYearFive": {
                            "val": "8.647"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides meteorological support to research, development, test, and evaluation (RDT&E) activities and provides standard and specialized weather forecasts and data for test reports to satisfy Army\/Department of Defense RDT&E test requirements for modern weaponry, e.g., (1) unique atmospheric analysis and sampling to include atmospheric transmittance, extinction, optical scintillation, infrared temperature, aerosol\/smoke cloud dispersion characteristics, and ballistic meteorological measurements; (2) test event forecasting to include prediction of sound propagation for ballistic firing tests, specialized prediction of light levels and target to background measurements, and predictions for electro-optical testing and ballistic artillery\/mortar firing; and (3) advisory and warning products such as go\/no-go test recommendations for ballistic and atmospheric probe missiles, smoke\/obscurant tests, hazard predictions for chemical agent munitions disposal, monitoring dispersion of simulant clouds for chemical\/biological detector tests, simulated nuclear blasts, and weather warnings for test range safety.  Provides technical support to Army Program Executive Officers (PEOs), Project Managers (PMs), and the Army test ranges and sites at: White Sands Test Center (WSTC) White Sands Missile Range, New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; West Desert Test Center (WDTC), Dugway Proving Ground, Utah; Aberdeen Test Center (ATC), Aberdeen  Proving Ground, Maryland; Redstone Test Center (RTC), Redstone Arsenal, Alabama;  Yuma Test Center (YTC), Yuma Proving Ground, Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska); Operational Test Command (OTC), Fort Hood, Texas and Fort Bragg, North Carolina. This program develops methodologies and acquires instrumentation and systems that allow meteorological teams to support current and future Army\/DoD RDT&E requirements.  It finances indirect meteorological support operating costs not billable to customers and replacement\/upgrade of meteorological instrumentation and support systems.  Direct costs for meteorological support services are not funded by this PE, but are borne by the customer (i.e., materiel\/weapons developers and project\/product managers) in accordance with DoD Directive 7000.14R, October 1999.  This program enables more effective test scheduling and execution, and is essential to the accomplishment of the Army's developmental and operational test mission in that precise weather modeling and measurements directly influence test item performance and quantify test item weather dependencies and vulnerabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Pay and Support Costs"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.931"
                                            },
                                            "Text": {
                                                "val": "Provided indirect costs (personnel salaries) for generating weather forecasts, severe weather warnings and advisories; staff meteorological services; and atmospheric measurements in support of Army\/DoD tests and projects at eight Army sites\/test ranges, and alternate test sites as required.  Provided program management for meteorological support to the Army research, development, test and evaluation community and technical review\/assistance to ranges and meteorological support teams.  Included collaboration between Army meteorologists and the National Center for Atmospheric Research (NCAR) toward improvements to the Four-Dimensional Weather (4DWX) System.  Conducted assessment of range support to gain efficiencies in light of future DA TDA reductions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.095"
                                            },
                                            "Text": {
                                                "val": "Provides indirect costs (personnel salaries) for generating weather forecasts, severe weather warnings and advisories; staff meteorological services; and atmospheric measurements in support of Army\/DoD tests and projects at eight Army sites\/test ranges, and alternate test sites as required. Provides program management for meteorological support to the Army research, development, test and evaluation community and technical review\/assistance to ranges and meteorological support teams.  Includes collaboration between Army meteorologists and the National Center for Atmospheric Research (NCAR) toward improvements to the Four-Dimensional Weather (4DWX) System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.060"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.060"
                                            },
                                            "Text": {
                                                "val": "Will provide indirect costs (personnel salaries) for generating weather forecasts, severe weather warnings and advisories; staff meteorological services; and atmospheric measurements in support of Army\/DoD tests and projects at eight Army sites\/test ranges, and alternate test sites as required.  Will provide program management for meteorological support to the Army research, development, test and evaluation community and technical review\/assistance to ranges and meteorological support teams.  Will include collaboration between Army meteorologists and the National Center for Atmospheric Research (NCAR) toward improvements to the Four-Dimensional Weather (4DWX) System."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Four Dimensional Weather System (4DWX) and Instrumentation"
                                    },
                                    "Description": {
                                        "val": "Provides funding for meteorological instrumentation and technology to support RDT&E activities at Army test ranges.  Includes funding for development and enhancement of the 4DWX system, an advanced meteorological support system that provides high-resolution weather forecasts and analyses.  The 4DWX analyses and forecasts of the 3-dimensional structure of the atmosphere over time (4th dimension) are used in test planning, conduct, and forensic analyses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.358"
                                            },
                                            "Text": {
                                                "val": "Provided funding for meteorological instrumentation and technology to support RDT&E activities at Army test ranges.  Included funding for development and enhancement of the 4DWX system, an advanced meteorological support system that provided high-resolution weather forecasts and analyses.  The 4DWX analyses and forecasts of the 3-dimensional structure of the atmosphere over time (4th dimension) were used in test planning, conduct, and forensic analyses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.208"
                                            },
                                            "Text": {
                                                "val": "Continues 4DWX system enhancements and modernization to improve forecast accuracy in support of Army RDT&E mission requirements, including development of probabilistic modeling, development and use of improved parameterizations of wind flow over complex terrain features; improved data assimilation procedures, and configuration of 4DWX for each test range to optimize accuracy; and development of a Verification & Validation plan for 4DWX. Funds lifecycle replacement of high performance computing system required to operate the 4DWX weather model due to the current, aging system becoming obsolete. Instrumentation funding is used to continue a multiyear effort to replace\/upgrade obsolete instrumentation, including upper-air sounding systems, upgrades to weather stations, replacement of radar wind profilers and Doppler acoustic sounders, and upgrade of data analysis and display software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.865"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.865"
                                            },
                                            "Text": {
                                                "val": "Will continue 4DWX system enhancements and modernization to improve forecast accuracy in support of Army RDT&E mission requirements, including development of stream-flow prediction, development of a full-grid climatography using 4DWX final-analysis data, and further development of probabilistic modeling; improved data assimilation procedures, and configuration of 4DWX to optimize test range-specific accuracy; and continued 4DWX Verification and Validation efforts. Instrumentation funding will be used to continue a multiyear effort to replace\/upgrade obsolete instrumentation, including upper-air sounding systems, upgrades to weather stations and replacement of radar wind profilers"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}