{
    "id": "7d8f3964a80dc605e6af2c3a6d7e09f57de8ea2c",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA2_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602716A"
        },
        "ProgramElementTitle": {
            "val": "Human Factors Engineering Technology"
        },
        "R1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "23.434"
            },
            "CurrentYear": {
                "val": "23.681"
            },
            "BudgetYearOne": {
                "val": "23.671"
            },
            "BudgetYearOneBase": {
                "val": "23.671"
            },
            "BudgetYearTwo": {
                "val": "24.034"
            },
            "BudgetYearThree": {
                "val": "24.636"
            },
            "BudgetYearFour": {
                "val": "25.094"
            },
            "BudgetYearFive": {
                "val": "25.596"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) conducts applied research on aspects of human factors engineering that impact the capabilities of individual and teams of Soldiers operating in complex, dynamic environments.  The results of the research will enable maximizing the effectiveness of Soldiers and their equipment for mission success.  The aspects of human factors that will be studied include sensing, perceptual and cognitive processes, ergonomics, biomechanics and the tools and methodologies required to manage interaction within these areas and within the Soldiers' combat environment.  Project H70 research is focused on decision-making; human robotic interaction; crew station design; improving Soldier performance under stressful conditions such as time pressure, information overload, information uncertainty, fatigue, on-the-move and geographic dispersion; and enhancing human performance modeling tools.   \n\nWork in this project leverages basic research performed in PE 0601102A (Defense Research Sciences), and complements and is fully coordinated with PE 0602601A (Combat Vehicle and Automotive Advanced Technology), PE 0602786A (Warfighter Technology), PE 0602120A (Sensors and Electronic Survivability), PE 0602784A (Military Engineering Technology), PE 0602783A (Computer and Software Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0602785 (Manpower\/Personnel\/Training Technology), PE 0603005A (Combat Vehicle and Automotive Technology), PE 0603710A (Night Vision Advanced Technology), PE 0603015A (Next Generation Training and Simulation), and PE 0603007A (Manpower, Personnel, and Training Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "23.778"
                },
                "CurrentYear": {
                    "val": "23.681"
                },
                "BudgetYearOne": {
                    "val": "23.671"
                },
                "BudgetYearOneBase": {
                    "val": "23.671"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.434"
                },
                "CurrentYear": {
                    "val": "23.681"
                },
                "BudgetYearOne": {
                    "val": "23.671"
                },
                "BudgetYearOneBase": {
                    "val": "23.671"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.344"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.344"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H70"
                    },
                    "ProjectTitle": {
                        "val": "Human Fact Eng Sys Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.434"
                        },
                        "CurrentYear": {
                            "val": "23.681"
                        },
                        "BudgetYearOne": {
                            "val": "23.671"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.671"
                        },
                        "BudgetYearTwo": {
                            "val": "24.034"
                        },
                        "BudgetYearThree": {
                            "val": "24.636"
                        },
                        "BudgetYearFour": {
                            "val": "25.094"
                        },
                        "BudgetYearFive": {
                            "val": "25.596"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on human factors to maximize the effectiveness of Soldiers in concert with their equipment.  The resulting data are the basis for weapon systems and equipment design standards, guidelines, handbooks, and Soldier training as well as manpower requirements to improve equipment operation and maintenance. Application of this research will yield reduced workload, fewer errors, enhanced Soldier protection, user acceptance, and allows the Soldier to extract the maximum performance from the equipment.  \n\nMajor efforts research sources of stress, potential stress moderators, and intervention methods, and identify and quantify human performance measures and methods to address current and future warrior performance issues. Individual efforts exploit adaptive learning methods and strategies, enhance and validate human performance modeling tools; investigate integration of advanced concepts in crew stations designs, optimizes interfaces for information systems and improves human robot interaction (HRI) in a full mission context.\n\nEfforts in this program element support the Army science and technology Soldier\/Squad portfolio.\n\nResults of these efforts are transitioned to the Research, Development, and Engineering Centers, the Program Executive Offices (PEO) & Program Managers, Army Training and Doctrine Command (TRADOC), Army Medical Command (MEDCOM), Human Systems Integration (HSI) Directorate (Army G1), and Army Test and Evaluation Command (ATEC).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research Laboratory (ARL), Aberdeen, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interfaces for Collaboration and Decision Making"
                                    },
                                    "Description": {
                                        "val": "This effort looks at the study of how networks influence, and are influenced by, human behavior in the context of military decision making.  The studies, which range from computational modeling to networked simulations in a laboratory environment, to large-scale simulation exercises, will investigate the effects of technology on information flow, cognitive workload, team collaboration, organizational effectiveness, situational awareness, and decision making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.307"
                                            },
                                            "Text": {
                                                "val": "Examined communication capabilities of small team operations at the \"edge\" of the battlefield, with a focus on the effectiveness of different types of interfaces and (information) presentation techniques; and enhanced experimental platforms for studying mission command network operations in civil-military scenarios.  Goals were to develop techniques for improved information sharing, more effective use of available information, and new and enhanced metrics and methods that led to a better understanding of how human-network interactions impact distributed team performance.  Research was conducted via human-system information flow modeling, lab, simulation, and field experimentation using novel information and collaboration technologies in realistic networked environments with teams ranging from squads to command headquarters sizes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.711"
                                            },
                                            "Text": {
                                                "val": "Identify and investigate aspects of information displays and interfaces that best support the effective conduct of tactical intelligence; Validate the effectiveness of interface type and information presentation techniques in experimental decision aids such as the Warfighter Associate;  and conduct research to identify elements critical to information display and presentation for the development of future decision aids applicable to civil-military, tactical (Company level), and cyber security."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.699"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.699"
                                            },
                                            "Text": {
                                                "val": "Will conduct fact extraction and analysis of data from complex networked teams (including civil-military), to inform development of technology for enhanced decision-making; and conduct research on data-to-decisions and decision-support technologies for cyber security, mission command and understanding of big data domains to enhance decision-making and collaborative performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Performance Modeling"
                                    },
                                    "Description": {
                                        "val": "Enhance human performance modeling tools to enable system analysis that will inform system design early in the acquisition process.  These tools will allow the identification of design flaws that can be mitigated to reduce workload and human errors and increase user acceptance of developing technologies allowing the Soldier to extract the maximum performance from the equipment.  Collect and analyze empirical data on human perception (vision and hearing) to support human and system performance models used for equipment design and training. Efforts are coordinated with Program Element (PE) 0602786A\/H98 (Clothing and Equipment Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.465"
                                            },
                                            "Text": {
                                                "val": "Developed HSI tools and methodologies to quantify the usability of systems developed to support team environments.  These tools provided quantitative data that can be used to support acquisition and design trade off decisions.  Research was conducted using findings from human sciences, algorithm development, field trials with military use cases, and feedback from the research, military, analyst, and system design and development communities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.672"
                                            },
                                            "Text": {
                                                "val": "Enhance the analytic capabilities and usability of current human performance modeling tools by incorporating cognitive distraction driving scales, updating military specialty lists and improving reporting and visualization capabilities; expand human figure digital library by developing three-dimensional (3D) models of Air Soldier clothing and equipment items to perform early human figure modeling assessments of future aviation platform designs; investigate the importance of coping style and working memory capacity for improved prediction of cognitive performance while driving; and investigate the feasibility of incorporating Soldier Systems Engineering Architecture (SSEA) drawings and Human View concepts into the Improved Performance Research Integration Tool (IMPRINT) to improve system design predictions and drive design requirements early in acquisition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.128"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.128"
                                            },
                                            "Text": {
                                                "val": "Will incorporate new cognitive demand scales and update micromodels within IMPRINT; and investigate the effects of physical and cognitive stress such as dehydration or vigilance on Soldier performance, and transition results to models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Brain-Computer Interaction"
                                    },
                                    "Description": {
                                        "val": "Investigate the use of neurophysiological and behavior-based technologies for enhancing the interaction between Soldiers and systems such as autonomous systems and advanced crew stations.  Implement guidelines for: algorithms for characterizing Soldier brain activity in operational contexts; real-time techniques to integrate neurally-based information into systems designs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.242"
                                            },
                                            "Text": {
                                                "val": "Developed and matured brain-computer interaction technology for image analysis that is capable of adapting to the user for increased joint Soldier-system performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.338"
                                            },
                                            "Text": {
                                                "val": "Investigate novel approaches for image analysis that fuse computer vision and brain-computer interaction technologies for enhanced target identification capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.288"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.288"
                                            },
                                            "Text": {
                                                "val": "Will develop novel techniques that enable co-adaptation of multiple computer vision and brain-computer interface systems for distributed processing of large-scale image data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Soldier Performance"
                                    },
                                    "Description": {
                                        "val": "Investigate equipment design standards and human performance measures and create guidelines for maneuver team information systems solutions that improve situational understanding and decision cycle time; identify, mature, and quantify human performance limitations to address future warrior performance issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.257"
                                            },
                                            "Text": {
                                                "val": "Expanded applied research and analysis on the effects of physical and cognitive loads on Soldier performance to more operationally relevant environments; determined and matured guidelines for equipment developers and the Research and Development Centers that will lighten the Soldier physical, sensory, and cognitive burden and enhance Soldier and small team performance; applied techniques developed for quantifying the effects of weapon recoil on shooter performance to a broader area of research (such as the effects of small arms equipment on marksmanship performance); and transitioned results to the U.S. Army Marksmanship Unit."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.204"
                                            },
                                            "Text": {
                                                "val": "Investigate effects of cognitive stress on physical performance; develop techniques to employ basic science principals discovered in highly controlled laboratory experiments in more operationally relevant environments using more militarily relevant physical and cognitive stressors to enhance research results; conduct research to inform guidelines for equipment developers and the Research and Development Centers that will enhance Soldier and small team performance; investigate the effects of small arms recoil on shooter performance and transition results to research and development centers and the U.S. Army Marksmanship Unit."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.507"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.507"
                                            },
                                            "Text": {
                                                "val": "Will examine the tradeoffs between ballistic armor coverage area, armor plate design and mobility to quantity the effect to Soldier performance; conduct research to provide a greater understanding of the effects of physical augmentation (such as exoskeleton devices) on Soldier performance; examine the effects of physical load mitigation technologies on physical performance; investigate the effects of motivation on cognitive performance for individuals and small teams; and examine the effects of prolonged physical stress on physical and cognitive performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human-Robot Interaction (HRI)"
                                    },
                                    "Description": {
                                        "val": "Design human-centered design requirements and technologies for supervision and Soldier interaction with multiple semi-autonomous unmanned vehicles in urban and unstructured environments.  This research will be transitioned to U.S. Army Tank Automotive Research Development and Engineering Center (TARDEC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.173"
                                            },
                                            "Text": {
                                                "val": "Continued to focus on human-robot interaction by examining such issues as Soldier-robot interaction modes, communication, situation awareness, trust, and transparency in coordination with the ARL Autonomous Systems Enterprise partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.164"
                                            },
                                            "Text": {
                                                "val": "Develop concepts for efficient Soldier-robot interaction and teaming, multimodal bidirectional communication between Soldiers and autonomous systems, and trust and transparency between Soldier and robot; and investigate the impact of social-cultural context on usage of autonomous systems in coordination with the ARL Autonomous Systems Enterprise partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.998"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.998"
                                            },
                                            "Text": {
                                                "val": "Will develop and assess multimodal bidirectional communication solutions, including natural language, gesture, and tactile methods, for effective Soldier-agent interaction and teaming; and develop models of trust and transparency as basis for human-centered design requirements for intelligent, autonomous systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding Socio-cultural Influence"
                                    },
                                    "Description": {
                                        "val": "Investigate and model cognitive aspects of socio-cultural influences on Soldier\/Commander decision making and communication to enhance Soldier performance with systems, within teams and in the mission context.  Extend models of individual and teams to societal levels to support regional understanding, training, mission rehearsal, and influence.  This work complements and is coordinated with PE 0602784A\/T41 (Socio\/Cultural Behavior) and PE 0602785A\/790 (Personnel Performance & Training Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.990"
                                            },
                                            "Text": {
                                                "val": "Validated cognitive framework and proof of concept decision support tools; developed guiding principles for the presentation of socio-cultural information using validated cognitive framework; initiated extension of cognitive framework to encompass societal-level perspective leveraging historical Office of the Secretary of Defense (OSD)-investments; and determined experiment requirements for validation of extension."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.019"
                                            },
                                            "Text": {
                                                "val": "Conduct experiments on the effectiveness of information presentation using the socio-culturally informed design principles; integrate cognitive framework into select experimental decision support and training tools and validate tools with experiments designed to determine if relevant socio-cultural information is presented effectively to enhance Soldier decision making in diverse environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.029"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.029"
                                            },
                                            "Text": {
                                                "val": "Will develop metrics and supporting models to map the effect of socio-cultural factors on Soldiers’ decision-making, and improve asymmetric threat forecasting to inform battlefield operations; and develop representative algorithms of social-cultural variables to integrate into models that will predict adversary behavior."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continuous Multi-Faceted Soldier Characterization for Adaptive Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort will investigate technologies that provide the foundation for future Army systems to adapt to individual Soldier’s states, behaviors, and intentions in real-time.  Develop novel approaches to individualize adaptive systems through enhanced interfaces, interactions, or interventions that capitalize on prediction methods; and decrease time-to-train, augment physical, cognitive, and social performance, and improve human-network interactions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "Will develop techniques to integrate behavioral, physiological, environmental, and task-based sensors to enable continuous low resolution multi-faceted monitoring of an individual."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Sensory Performance"
                                    },
                                    "Description": {
                                        "val": "Conduct Soldier-oriented research to understand the attentional and cognitive challenges of interpreting unaided and aided tactile signals, visual imagery, and auditory events in complex, dynamic battlefield environments.  Results are used for enhancing sensory performance by providing the materiel development community with the knowledge necessary to effectively design systems that maximize mission effectiveness and survivability of the dismounted Soldier."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.473"
                                            },
                                            "Text": {
                                                "val": "Conduct Soldier-centric research on personnel-borne improvised explosive device (IED) detection technologies to characterize operator\/system strengths and constraints, and maximizing IED detection performance; conduct research on enhancements to night-vision goggle technologies, including studies designed to optimize processing parameters (e.g., image latency and frame rate) for electronically coupled night-vision and thermal detection systems; continue to support equipment development by providing human auditory performance data to Research Development and Engineering Centers (RDECs) in order to develop evaluation standards that are tied to the impact of auditory capabilities on operational requirements; conduct a study to examine the efficacy of two-way tactile communication to support squad-level communications; explore the integration of bone conduction technology communication systems into chemical, biological, radiological and nuclear protective masks to improve Soldier communication and validate their effectiveness in a field environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.485"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.485"
                                            },
                                            "Text": {
                                                "val": "Will develop models of target saliency and concepts for training methodologies to enhance IED detection performance; validate concepts of integrating bone conduction communications systems into chemical, biological, radiological and nuclear protective masks as an improvement to Soldier communication and performance; and characterize operator\/system performance capabilities of night vision devices (NVDs) to support development of digital sensor technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training Effectiveness Research"
                                    },
                                    "Description": {
                                        "val": "Novel technologies and their implementation in Army systems may result in demands on Soldiers that exceed their knowledge, skill, or memory capacity.  When demands cannot be remediated by human systems integration, training may enable the demands to be met.  This effort will identify human operator tasks in complex, intelligent, and emerging systems critical to mission employment of new technologies.  The aspects (particularly knowledge and skill) of those tasks will be determined through experimentation and analysis to inform development of training and simulation technologies, fundamental research on the effectiveness of training regimes, and simultaneous task combinations that must be trained.  This effort leverages research from PE 0601102A\/74A (Human Engineering) and will be transitioned to PE 0603015\/S29 (Next Generation Training and Simulation Systems)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Investigated emerging technologies and targeted those likely to place significant demands on human operators, in particular intelligent, decision-aiding, and autonomous systems for which transparency and trust are crucial; conducted analyses of two emerging or projected technologies in the context of mission performance to determine combinations of tasks, such as, those resulting from use of the emerging technology and those from legacy systems, those requiring understanding of dynamic system models, required for mission performance; and conducted research on task combinations to determine parameters that may inform the development of training technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Identify user skills that are critical to interacting with intelligent, autonomous systems and appropriate methods for measuring the user's skill level; and identify or mature approaches for evaluating the effectiveness of various types of training to conduct select human operator tasks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.937"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.937"
                                            },
                                            "Text": {
                                                "val": "Will develop automated performance measurement capabilities for use in evaluating the effectiveness of training; and conduct research on the integration of multi-sensor data (e.g. accuracy, communications, psycho-physiological, and\/or movement\/location) for automated measurement of critical training outcomes and perform validation studies assessing metrics (algorithms) of training performance in virtual test-bed and live training environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier System Architecture"
                                    },
                                    "Description": {
                                        "val": "Soldier performance is affected by mission demands, environment, human characteristics, equipment, and technology.  System development requires considering tradeoffs among these factors and sufficient data about them on which to base analyses.  This effort will identify and develop human performance measures of effectiveness and performance (MOEs and MOPs) critical to performing individual and team tasks in a mission text.  Tools and techniques for analysis of these tradeoffs will also be developed.  Empirical data will be mined from existing sources or collected where gaps exist to inform the interaction among factors affecting Soldier mission performance for emerging technologies.  This research supports the development of the SSEA and is coordinated with PE 0602786A\/ H98, 0603015A\/S28, PE 0603710A\/Project K70, PE 0602308A\/ C90, PE 0602787A\/869, and 0603004A\/232."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Conducted research to identify relative contributions and interactions of factors critical to Soldier and team system performance; worked within Human Systems community to identify and prioritize critical human performance MOEs and MOPs; conducted research to support development of high priority measures not supported by sufficient empirical data involving interaction among factors such as mission demands, environment, human characteristics, equipment and technology; and proposed modifications to individual measures to account for small team performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Text": {
                                                "val": "Develop model-based predictive analyses of Dismounted Infantry (DI) missions that will provide Department of Defense (DOD) leadership with analytic data to inform requirements development and trade-off decisions as early as Milestone A.  These analyses will integrate Human Systems Integration and Systems Engineering inputs to generate critical tasks combinations that provide the necessary analytical data to support cognitive workload measurement, MOEs, and MOPs for DI."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will develop an analysis methodology and proof of concept front end analysis tool for SSEA; and develop operational scenarios to examine cognitive, physical, and social aspects of performance to exercise within SSEA."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}