{
    "id": "83cdd9baad74d582cf4652f64ce5fedde14e5afe",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA2_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Technology"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.333"
            },
            "CurrentYear": {
                "val": "19.243"
            },
            "BudgetYearOne": {
                "val": "25.466"
            },
            "BudgetYearOneBase": {
                "val": "25.466"
            },
            "BudgetYearTwo": {
                "val": "25.041"
            },
            "BudgetYearThree": {
                "val": "24.822"
            },
            "BudgetYearFour": {
                "val": "24.737"
            },
            "BudgetYearFive": {
                "val": "25.172"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) designs and validates electronic warfare (EW) components that deny, disrupt, or degrade the enemy's use of the electromagnetic spectrum for offensive or defensive operations. This is accomplished through the investigation of electronic support measures (ESM); countermeasures against communications systems and networks; the design and fabrication of sensors used to identify and locate threat forces in an asymmetric environment; and threat warning and electronic countermeasures (ECM) against munitions sensors, missile guidance systems, targeting systems, and explosive hazards. Project 906 supports protection of high-value ground platforms, aircraft and the Soldier from threat surveillance and tracking systems, imaging systems, and advanced radio frequency (RF)\/electro-optical (EO)\/infrared (IR) missiles, artillery, and smart munitions. Information fusion research addresses sensor correlation and fusion, relationship discovery, and management services through use of automated processing, as well as software that applies higher level reasoning techniques to support automated combat assessment. Project 906 also supports research and application of key EW sensors, direction finders and jammers to intercept, locate, and disrupt current and emerging communications and non-communications threat emitters to provide vital quality combat information directly to users in a timely and actionable manner. Specifically, it focuses on detection of threat sensors and emitters associated with weapon systems, targeting systems and command, control, communications, computers, and intelligence systems and networks. \n\nWork in this PE is complementary of PE 0602120A (Sensors and Electronic Survivability), PE 0602782A (Command, Control, Communications Technology), PE 0603270A (Electronic Warfare Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology); and fully coordinated with PE 0603008A (Command, Control, Communications Advanced Technology), PE 0603710A (Night Vision Advanced Technology) and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research, Development and Engineering Command, Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.500"
                },
                "CurrentYear": {
                    "val": "19.243"
                },
                "BudgetYearOne": {
                    "val": "20.466"
                },
                "BudgetYearOneBase": {
                    "val": "20.466"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.333"
                },
                "CurrentYear": {
                    "val": "19.243"
                },
                "BudgetYearOne": {
                    "val": "25.466"
                },
                "BudgetYearOneBase": {
                    "val": "25.466"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.833"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.000"
                },
                "BudgetYearOneBase": {
                    "val": "5.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.167"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "5.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year (FY) 2017 increase to expand research on offensive cyber and signals intelligence."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "906"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Electronic Warfare Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.333"
                        },
                        "CurrentYear": {
                            "val": "19.243"
                        },
                        "BudgetYearOne": {
                            "val": "25.466"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.466"
                        },
                        "BudgetYearTwo": {
                            "val": "25.041"
                        },
                        "BudgetYearThree": {
                            "val": "24.822"
                        },
                        "BudgetYearFour": {
                            "val": "24.737"
                        },
                        "BudgetYearFive": {
                            "val": "25.172"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project designs, fabricates, evaluates, and applies key electronic warfare (EW)\/information operations technologies to enhance platform survivability (to include ground combat vehicles, aircraft, and the dismounted Soldier) and to intercept, track and locate current and emerging threat munitions, communications and non-communications threat emitters. This project applies recent advances in radio frequency (RF), infrared (IR), and electro-optical (EO) sensors and jamming sources to detect, locate, deceive, and jam threats (to include radar directed target acquisition systems, target-tracking sensors, surface-to-air missiles (SAMs), air-to-air missiles (AAMs), top attack weapons, and electronically fuzed munitions). This project also pursues the ability to neutralize improvised explosive devices. This project designs information systems to provide vital, quality combat information directly to users in a timely, actionable manner in accordance with concepts for future force intelligence operations. This project investigates RF collection and mapping technologies to offer real time emitter detection, location, and identification. In addition, this project enables a remote capability to disrupt, deny, or destroy threat communication signals and enables fusion (automated assimilation and synthesis) of battlefield intelligence data to enable interpretation of current threats and future enemy activities. This allows commanders to develop operational courses of action in time to act decisively and in a pre-emptive manner.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Ground Maneuver, Soldier\/Squad and Air portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command, Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Intelligence Data Fusion and Targeting"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and codes advanced automated exploitation and fusion analysis tools, applications, and software services for the creation of improved intelligence products, common information management and information dissemination systems to facilitate collaboration between intelligence and mission command functions. This will provide relevant and timely information in support of command decisions, such as high value identification and targeting in an asymmetric environment. Work being accomplished under Program Element (PE) 0603772A\/project 243 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.695"
                                            },
                                            "Text": {
                                                "val": "Investigated methods to fuse biometric enabled intelligence analysis results with other forms of intelligence data to improve the overall quality of data products; designed methods and analysis software tools and algorithms to extract biometric and contextual data from streaming video sources; began designing and coding of software tools to assign quality scores to data gathered from non-dedicated biometric sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.720"
                                            },
                                            "Text": {
                                                "val": "Design biometric\/video architecture capable of pulling non-traditional biometric data from disparate video sources and integrate biometric extraction and analysis algorithms into this architecture; experiment with and evaluate software tools for biometric extraction from video sources to determine ability to perform biometric extraction and pull useful intelligence, surveillance and reconnaissance data from the video using the biometric\/video architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.720"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.720"
                                            },
                                            "Text": {
                                                "val": "Will assess techniques for identifying necessary patterns and behaviors based on the types of data accessible from pertinent data sources accessed via the intelligence enterprise; design and code algorithms and software predictive analysis tools that support analysis of big data on the intel enterprise to determine patterns, anomalies, and behavior based upon data from various sources; evaluate the performance of tools against defined measures of effectiveness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Offensive Information Operations Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, codes and evaluates cyber architectures, software, tools and techniques that identify and capture data traversing targeted networks for the purpose of computer network operations (CNO) or otherwise countering adversary communications. Cyber capabilities include detection, identification, exploitation, direction finding (DF), geolocation, and denial of service. Work being accomplished under PE 0603270A\/project K15 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.848"
                                            },
                                            "Text": {
                                                "val": "Investigated the impacts on cyber\/EW techniques of converging disparate RF devices into a common hardware and software platform; developed coordinated cyber\/EW techniques to exploit tactically relevant targets; analyzed and developed performance predictions for various techniques being employed on different cyber and EW platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.843"
                                            },
                                            "Text": {
                                                "val": "Investigate advanced techniques against next-generation signals of interest (SOIs); research an architecture for resilient operations across cyber, EW and signal intelligence (SIGINT) assets; investigate extending cyber enabled operations to software defined radio platforms such as dismounted\/mounted radio and\/or next generation radar systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.857"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.857"
                                            },
                                            "Text": {
                                                "val": "Will investigate additional advanced techniques to perform various SIGINT missions against identified SOIs; begin analysis of requirements for commander to perform command & control functions across security domains; analyze data to determine necessary data models for the delivery of tactically collected cyber electromagnetic activities (CEMA) data to the intelligence enterprise; investigate analytic tools to enhance commander’s situational understanding by adding cyber data input; investigate next generation architecture requirements and research techniques to determine the current configuration state of the operational offensive cyber operations architecture to enable automated replication within a laboratory environment; conduct experiments to validate necessary hardware and software component fidelity within the future architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multispectral Threat Warning"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates software and sensor\/countermeasure components to increase probability of detection of small arms and probability of detection and defeat of man-portable air defense system (MANPADS) type threats for aviation platforms using modeling and simulation (M&S) and hardware in the loop (HIL) simulations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.283"
                                            },
                                            "Text": {
                                                "val": "Evaluated effectiveness of current countermeasures techniques against additional classes of emerging multi-spectral threats required by Common IR Countermeasures program of record; expanded laboratory and M&S environment to accommodate assessment of advanced threat countermeasures; initiated design, fabrication and encoding of techniques and technologies that provide countermeasures against multi-spectral IR and RF threats; investigated multi-band signature management exploitation and design correlation techniques for improved threat detection, identification and countermeasures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.309"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop hardware and software simulation environment to assess countermeasures with appropriate level of simulation fidelity based on threat specifications and studies; explore ways to exploit a second class of emerging threats and assess baseline countermeasure techniques against this second class of emerging threat; develop holistic countermeasure approaches to protect aviation platforms and investigate application of additional technologies to support threat detection as well as optimize countermeasure performance as part of the holistic approach."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.367"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.367"
                                            },
                                            "Text": {
                                                "val": "Will continue to perform threat characterization and countermeasure development for relevant threat targets; perform feasibility study on application of high energy lasers with improved laser technology and material development as countermeasures to existing and emerging threats; incorporate higher fidelity flare simulations into the simulation environment; collect and update data on advanced threats to update optical cross section database for use in simulation environment; incorporate threat characterization data into threat classifier software"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Function Intelligence, Surveillance and Reconnaissance (ISR) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and codes software algorithms and techniques to intelligently integrate tactical ISR sensors, improve their individual performance and increase the effectiveness of battlespace awareness\/intelligence data in an area of operations. Efforts focus on networking of sensors and open, scalable common RF architectures for terrestrial and aerial sensors. Work being accomplished under PE 0603270A\/project K15 and PE 0603772A\/project 243 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.318"
                                            },
                                            "Text": {
                                                "val": "Studied the feasibility of combining a series of synthetic aperture radar (SAR) images to develop a motion video-like data product for more reliable entity resolution and real time tracking; established metrics for measuring and judging the quality of SAR motion video products; investigated techniques to identify and mitigate the impact of intentional red force interference sources on friendly ISR assets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.171"
                                            },
                                            "Text": {
                                                "val": "Investigate and define operational\/technical requirements to design an open architecture RF front end for aerial and terrestrial platforms to allow multiple sensors access to platform antenna arrays to avoid redundancy; analyze and determine specifications to standardize RF distribution networks on aerial and terrestrial platforms to facilitate modularity and the interoperability of RF systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.522"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.522"
                                            },
                                            "Text": {
                                                "val": "Will complete overall architecture design, module and processing specs and interfaces for the multi-function (defensive\/offensive electronic attack, electronic support, SIGINT) RF front-end receiver; mature designs of the electronic modules including the low-band and mid-band input modules, pre-selector, N channel receiver, and master control\/ computation\/communications\/power modules; investigate and design the low band circular antenna array and mid band antenna array for terrestrial and aerial applications; begin reference design and development of processing engines for basic direction finding set-on and scan applications; investigate operational and technical requirements to develop high frequency (HF) exploitation software solutions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Architectures and Countermeasures"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates the technical specifications of a family of threats to develop non-kinetic countermeasures. Work being accomplished under PE 0603270A\/project K16 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.189"
                                            },
                                            "Text": {
                                                "val": "Analyzed existing blue force ground EW systems to determine potential deficiencies or weaknesses in the system design and implementation that could be exploited by red forces; investigated emerging red force EW system architectures to identify design characteristics that can be exploited by blue force EW systems to limit their effectiveness"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Analyze modular open RF architecture interfaces to determine vulnerabilities that emerged as component interactions are standardized; continue the evaluation of emerging scheduling algorithms for use within the architecture to coordinate various mission functions (SIGINT, EW, Communications); design software for automated classification, detection, identification and correlation algorithm to coordinate EW\/SIGINT\/Comms transmissions for real time communications across those mission functions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will complete open RF architecture interface vulnerability analysis; develop and mature robust information assurance vulnerability mitigation techniques for the open RF architecture; begin analysis to apply the open RF architecture to RF capabilities on manned and unmanned airborne platforms; coordinate mitigation strategies and develop mitigation techniques for RF architecture vulnerabilities discovered for emerging SIGINT, EW, Communications scheduling algorithms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}