{
    "id": "95812580f5ce3737394115c2d3f2361246eb15db",
    "meta": {
        "filename": "dod-2017_RDTE_2017_CBDP_U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (BASIC RESEARCH)"
        },
        "R1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "45.720"
            },
            "CurrentYear": {
                "val": "47.761"
            },
            "BudgetYearOne": {
                "val": "44.800"
            },
            "BudgetYearOneBase": {
                "val": "44.800"
            },
            "BudgetYearTwo": {
                "val": "44.311"
            },
            "BudgetYearThree": {
                "val": "43.793"
            },
            "BudgetYearFour": {
                "val": "46.718"
            },
            "BudgetYearFive": {
                "val": "46.728"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Advances fundamental knowledge and promotes theoretical and experimental research in life and physical sciences.\n\nThe projects within this BA reflect the research areas of Life Sciences (LF1) (e.g. microbiology, biochemistry, pathogenic mechanisms, cell and molecular biology, immunology, nanoscale science, and information science) which focus on fundamental efforts to understand living systems' response to biological or chemical agents, to support detection, diagnostics, protection, and medical treatment. \n\nThe projects within this BA also include efforts in Physical Sciences (PS1) (e.g. chemistry, physics, materials science, nanotechnologies, nanoscale science and environmental science) which focus on fundamental scientific phenomena.  These support investigation of physical and chemical properties and interactions for enhanced functionalities important to detection, diagnostics, protection, and decontamination.\n\nBA1 also supports the DoD Science, Technology, Engineering, and Math (STEM) Strategy Plan to attract, inspire, and develop exceptional STEM talent across the education continuum to enrich our current and future DoD workforce to meet defense technological challenges.  This includes the Joint Science and Technology Institute (JSTI) which is a 2-week residential program for high school students and teachers who conduct a research project from a STEM field with a DoD scientist.  In addition, the National Research Council Research Associateship Program and the Military Internship Program provide unique opportunities for talented scientists and engineers, and promising midshipmen\/cadets, respectively, to conduct research at DOD service laboratories on projects that are of interest to the Chemical and Biological Defense Program Enterprise in an effort to develop the future DoD workforce.\n\nThe projects in this PE are placed in BA1 because they are basic research efforts directed towards non-specific or non-unique military applications.  Basic research technological breakthroughs support applied research (PE 0602384BP) activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "48.261"
                },
                "CurrentYear": {
                    "val": "46.261"
                },
                "BudgetYearOne": {
                    "val": "45.364"
                },
                "BudgetYearOneBase": {
                    "val": "45.364"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "45.720"
                },
                "CurrentYear": {
                    "val": "47.761"
                },
                "BudgetYearOne": {
                    "val": "44.800"
                },
                "BudgetYearOneBase": {
                    "val": "44.800"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.541"
                },
                "CurrentYear": {
                    "val": "1.500"
                },
                "BudgetYearOne": {
                    "val": "-0.564"
                },
                "BudgetYearOneBase": {
                    "val": "-0.564"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "1.500"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.874"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.667"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.564"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.564"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: N\/A\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "LF1"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL\/BIOLOGICAL DEFENSE - LIFE SCIENCES (BASIC RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.337"
                        },
                        "CurrentYear": {
                            "val": "29.338"
                        },
                        "BudgetYearOne": {
                            "val": "29.376"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.376"
                        },
                        "BudgetYearTwo": {
                            "val": "28.260"
                        },
                        "BudgetYearThree": {
                            "val": "27.891"
                        },
                        "BudgetYearFour": {
                            "val": "30.701"
                        },
                        "BudgetYearFive": {
                            "val": "30.707"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (LF1) focuses on fundamental efforts to understand living systems' response to biological or chemical agents, to support detection, protection, diagnostics, and medical treatment.  Research focuses on understanding factors which influence the behavior of chemicals, toxins, and pathogens in relation to the host or target.  Understanding of host\/agent interactions can drive exploration of novel approaches to detect, diagnose or protect against threats.  Research also focuses on medical countermeasures for improved efficacy against a wide array of current and future threat agents."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Life Sciences"
                                    },
                                    "Description": {
                                        "val": "Focuses on fundamental efforts to understand living systems' response to biological or chemical agents, to support detection, protection, diagnostics, and medical treatment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.337"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to understand pathogens, novel threats and host responses (including human and zoonotic) to prevent\/minimize host injury.  Investigated and evaluated systemic biological responses following exposure of living systems to CB agents.  Improved understanding of how polymicrobial interactions interfere with bacterial activities to influence discovery of novel antagonists for medical countermeasures.  Explored computational infectious models that utilize experimental data to generate mathematical models of infection and immunity.  Developed human monoclonal antibodies that were protecting from Ebola and Marburg viruses in animal models.  Developed artificial DNA and RNA and utilized them for a single assay that was able to detect any of 22 mosquito borne viruses, from a single mosquito carcass.  Developed paper-based synthetic gene networks for specific and rapid diagnostics on a low-cost, highly scalable platform.  Developed 3-D gut-on-a-chip devices that recapitulate spatial and temporal native function of human GI tract for pharmaceutical in vitro testing and research.  Explored micro-, nano- and nanostructured materials as approaches to the needs of chemical and biological countermeasures, including behavior in biological systems and how morphology relates to biological interaction and function.  Explored functional cellular and molecular systems and integration of functionality that may provide adaptive materials and\/or autonomously functioning materials and capabilities for CB defense countermeasures that sense and transduce threats.  Developed understanding and means to recognize the interaction of pathogens, toxicants, and novel threats with the blood-brain barrier and central nervous system.  Continued consortium approach to explore the importance of bacterial persistence and antibiotic tolerance in the establishment of recurring\/chronic infections such as melioidosis.  Initiated evaluation of role of gene amplification and duplication in the development of multiple drug resistance in bacterial pathogens.  Investigated the influence of glycosylation patterns on biologic stability and pharmacologic characteristics.  The scientific discoveries in the serological and genomic analysis of Burkholderia pseudomallei infections allowed for transition of academic grants research to the TM2 medical biological countermeasures for advancement of biological therapeutics.  The scientific advances in the discovery of targeted mutational analysis of Coxiella burnetii allowed for the identification of virulence determinants of acute and chronic disease and transitioned to TM2 biological countermeasures for the advancement of a potential vaccine.  The advancements made in nanocarrier-mediated targeting of bioscavengers allowed for the transition of academic grants research to the TM2 chemical countermeasures for the development of improved nerve agent bioscavengers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.762"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to understand pathogens, novel threats and host responses (including human and zoonotic) to prevent\/minimize host injury.  Continue to investigate and evaluate systemic biological responses following exposure of living systems to CB agents.  Improve understanding of how polymicrobial interactions interfere with bacterial activities to influence discovery of novel antagonists for medical countermeasures, thus influencing response to or course of disease.  Continue to explore nano- and nano-structured materials as approaches to the needs of chemical and biological countermeasures, including behavior in biological systems and how morphology relates to biological interaction and function.  Continue evaluation of role of Gene Amplification and Duplication in the development of multiple drug resistance in bacterial pathogens.  Continue consortium approach to explore the importance of bacterial persistence and antibiotic tolerance in the establishment of recurring\/chronic infections such as melioidosis.  Investigate the influence of glycosylation patterns on biologic stability and pharmacologic characteristics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.376"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.376"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to understand pathogens, novel threats, and host responses (including human and zoonotic) to prevent\/minimize host injury.  Continue to investigate and evaluate systemic biological responses following exposure of living systems to CB agents.  Improve understanding of how polymicrobial interactions interfere with bacterial activities to influence discovery of novel antagonists for medical countermeasures.  Continue to explore nano- and nano-structured materials as approaches to the needs of chemical and biological countermeasures, including behavior in biological systems and how morphology relates to biological interaction and function.  Continue to evaluate various global processes and mechanisms which lead to bacterial persistence and resistance.  Identify biomarkers indicative of resistance and persistence.  Investigate novel therapeutics developed and collected from novel sources.  Investigate the influence of glycosylation patterns on biologic stability and pharmacologic characteristics.  Continue evaluation of role of gene amplification and duplication in the development of multiple drug resistance in bacterial pathogens.  Investigate alpha-virus glycoprotein tertiary structure and other viral immunodominant epitopes for improved development of immune assays, which will support identification of an immune correlate of protection for vaccine licensure.  Examine mucosal immunity, particularly in the lung, for future development of mucosal vaccines.  Investigate new transport mechanisms of the blood-brain barrier, including specific interactions regulating viral entry into the central nervous system.  Investigate new biomarkers accessible in a minimally-invasive manner, characteristic of CB threats and the development of antimicrobial resistance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.576"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY16 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB2"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "52.364"
                                        },
                                        "CurrentYear": {
                                            "val": "51.131"
                                        },
                                        "BudgetYearOne": {
                                            "val": "56.191"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "56.191"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "60.366"
                                        },
                                        "BudgetYearThree": {
                                            "val": "53.979"
                                        },
                                        "BudgetYearFour": {
                                            "val": "54.415"
                                        },
                                        "BudgetYearFive": {
                                            "val": "54.427"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "90.527"
                                        },
                                        "CurrentYear": {
                                            "val": "84.433"
                                        },
                                        "BudgetYearOne": {
                                            "val": "68.048"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "68.048"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "73.401"
                                        },
                                        "BudgetYearThree": {
                                            "val": "76.811"
                                        },
                                        "BudgetYearFour": {
                                            "val": "77.325"
                                        },
                                        "BudgetYearFive": {
                                            "val": "81.186"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.362"
                                        },
                                        "CurrentYear": {
                                            "val": "16.062"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.109"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.109"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.343"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.899"
                                        },
                                        "BudgetYearFour": {
                                            "val": "18.035"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.038"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "102.610"
                                        },
                                        "CurrentYear": {
                                            "val": "93.725"
                                        },
                                        "BudgetYearOne": {
                                            "val": "83.838"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "83.838"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "93.720"
                                        },
                                        "BudgetYearThree": {
                                            "val": "92.727"
                                        },
                                        "BudgetYearFour": {
                                            "val": "94.495"
                                        },
                                        "BudgetYearFive": {
                                            "val": "98.357"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "PS1"
                    },
                    "ProjectTitle": {
                        "val": "CHEM\/BIO DEFENSE - PHYSICAL SCIENCES (BASIC RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.383"
                        },
                        "CurrentYear": {
                            "val": "18.423"
                        },
                        "BudgetYearOne": {
                            "val": "15.424"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.424"
                        },
                        "BudgetYearTwo": {
                            "val": "16.051"
                        },
                        "BudgetYearThree": {
                            "val": "15.902"
                        },
                        "BudgetYearFour": {
                            "val": "16.017"
                        },
                        "BudgetYearFive": {
                            "val": "16.021"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (PS1) advances fundamental scientific knowledge in physical science areas that include chemistry, physics, materials science, environmental sciences, and nanotechnology that could potentially lead to transformational CB defensive capabilities enhancing Warfighter performance and safety.  Research results in physics, chemistry and materials sciences that have potential application in point and standoff detection, diagnostics, as well as protection and decontamination.  Surface and environmental sciences focus on the study of physical and chemical properties and phenomena of interactions, especially with regard to Non Traditional Agents (NTAs), that seek to improve capabilities such as detection, protection, and decontamination.  Research in nanotechnology and nanoscale sciences, such as nanoelectromechanical systems, molecular motors, nano-mechanical resonance sensing, and nano-meter imaging, has potential application across CB capability areas to provide significant enhancement by, for example, decreasing detection response times, increasing medical countermeasure effectiveness against a wider array of threat agents, and providing currently unavailable modalities like detection imbedded in fabrics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Physical Sciences"
                                    },
                                    "Description": {
                                        "val": "Focuses on fundamental scientific phenomena including chemistry, physics, materials science, environmental science, and nanotechnology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.383"
                                            },
                                            "Text": {
                                                "val": "Synthesized and designed novel membranes which respond to CB threats via deactivation and conformation change to enable protection and a reduction in overall physical burden; results yielded in synthesis of novel polymer which deactivates CB threat simulants while changing confirmation - thereby providing colorimetric indication of deactivation.  Designed and synthesized novel decontamination options that are broadly applicable to multiple chemicals or biologicals and are less harmful to equipment.  Investigated novel signatures and analytical methods, new separation approaches, and recognition elements to reduce logistical burden while increasing specificity to overcome limitations in current approaches to identifying and quantifying CB threats.  Developed synthetic strategies within nanostructured material to mitigate chemical and biological threats; results yielded promising porous material which catalytically deactivates Soman in less than ten (10) minutes at room temperature.  Explored materials and integration of functionality that may provide adaptive materials and capabilities for CB defense countermeasures that bind, catalyze, sense, transduce, respond and\/or mitigate threats.  Verified reaction mechanisms between CB threats and state-of-the-art surfaces in a vacuum environment to establish a baseline of reactivity; results yielded in the utilization of advanced surface interrogation techniques verifying historic assumptions which previously could not be verified.  Developed understanding of chemical behavior in the environment, such as atmospheric reactivity and intra material interactions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.069"
                                            },
                                            "Text": {
                                                "val": "Continue exploring multifunctional material design and synthesis to identify dynamic materials that combine functionality and durability to improve CB protection by increasing protection factors and reducing physical burden.  Design and synthesize novel decontamination options that are broadly applicable to multiple chemicals or biologicals and are less harmful to equipment.  Continue exploration of micro-, nano- and nanostructured materials as novel approaches to needs in chemical and biological countermeasures.  Continue exploring materials and integration of functionality that may provide adaptive materials and capabilities for CB defense countermeasures that bind, catalyze, respond and\/or mitigate threats.  Continue to investigate impact of ambient surface reactivity and structure on performance of state-of-the-art and novel CB mitigating materials.  Continue to develop understanding of chemical behavior in the environment, such as intra material interactions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.424"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.424"
                                            },
                                            "Text": {
                                                "val": "Continue to examine the impact of processing parameters in designing large scale membranes, which respond to multiple CB threats via deactivation and confirmation change to enable novel means of protection and minimization of thermal burden.  Continue designing and synthesizing novel decontamination options that are broadly applicable to multiple chemicals or biologicals and are less harmful to equipment.  Continue to investigate the impact of morphology on approaches to mitigate chemical and biological threats on CB relevant substrates - such as fibers and yarns.  Continue exploring materials and integration of functionality that may provide adaptive materials and capabilities for CB defense countermeasures that bind, catalyze, respond and\/or mitigate threats.  Continue to study fundamental mechanisms between CB threats and surfaces at ambient pressure in order to elucidate its impact on reaction mechanisms between CB threats and state-of-the-art and novel CB mitigating surfaces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.354"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY16 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB2"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "52.364"
                                        },
                                        "CurrentYear": {
                                            "val": "51.131"
                                        },
                                        "BudgetYearOne": {
                                            "val": "56.191"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "56.191"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "60.366"
                                        },
                                        "BudgetYearThree": {
                                            "val": "53.979"
                                        },
                                        "BudgetYearFour": {
                                            "val": "54.415"
                                        },
                                        "BudgetYearFive": {
                                            "val": "54.427"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.362"
                                        },
                                        "CurrentYear": {
                                            "val": "16.062"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.109"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.109"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.343"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.899"
                                        },
                                        "BudgetYearFour": {
                                            "val": "18.035"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.038"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}