{
    "id": "96e9f88fc7641f4758f0fe96181da172290fdd37",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA5A_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604746A"
        },
        "ProgramElementTitle": {
            "val": "Automatic Test Equipment Development"
        },
        "R1LineNumber": {
            "val": "93"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "10.685"
            },
            "CurrentYear": {
                "val": "8.960"
            },
            "BudgetYearOne": {
                "val": "8.813"
            },
            "BudgetYearOneBase": {
                "val": "8.813"
            },
            "BudgetYearTwo": {
                "val": "10.362"
            },
            "BudgetYearThree": {
                "val": "11.572"
            },
            "BudgetYearFour": {
                "val": "9.790"
            },
            "BudgetYearFive": {
                "val": "9.974"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) provides for development and testing of general-purpose test equipment, state-of-the-art diagnostics and prognostics technologies, and software and systems to support the increasingly complex electronic components of the Army's new and upgraded weapon systems.  It focuses on implementation of commercial test and diagnostic technologies across multiple weapon platforms to minimize the cost of troubleshooting and maintenance of Army equipment in the field.  \n\nModular, reconfigurable automatic and semi-automatic systems are being developed under this program to satisfy weapon system test and diagnostics requirements.  The Next Generation Automatic Test System (NGATS), currently under development, provides state-of-the-art test and diagnostic capabilities to support current and future weapon systems.  It is the platform for transitioning Agile Rapid Global Combat Support System (ARGCS) technologies into the Army weapon system support structure, and it will replace several aging automatic test systems (ATS) that are becoming prohibitively expensive to operate and maintain.  \n\nThis PE also provides for continued development and improvement of general-purpose test equipment and calibration standards with emphasis on the incorporation of digital electronics and tailoring of configurations to improve deployability, mobility and survivability of the support equipment.  It includes development, demonstration and testing of calibration standards and techniques to support new Army test equipment requirements.  It also includes feasibility studies, market research, inventory analyses, bid sample testing and prototyping to support acquisition of calibration systems and general-purpose test and diagnostics equipment. \n\nFY 2017 Base funding for this program continues development of the Army's standard NGATS which will improve deployability and mobility of test and diagnostic equipment.  The NGATS provides state-of-the-art test and diagnostic capabilities and a means for reducing the Army's test equipment operating and support costs and the costs for supporting a number of the Army's vital warfighting systems.  The FY 2017 funding will develop or significantly modify test equipment to satisfy modular force and homeland security support requirements that cannot be accommodated with test equipment currently available in the commercial marketplace such as radio frequency (RF) and electro-optic (EO) testing capability.  It will also provide for technology enhancements to the Army's standard at-system tester to meet test and diagnostic requirements of the supported weapon systems, develop\/redesign test program sets and hardware for support of legacy and emerging weapon systems, develop a network centric software framework for NGATS, and develop and test general-purpose test equipment and calibration standards to meet Army weapon system support requirements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.079"
                },
                "CurrentYear": {
                    "val": "8.960"
                },
                "BudgetYearOne": {
                    "val": "11.014"
                },
                "BudgetYearOneBase": {
                    "val": "11.014"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.685"
                },
                "CurrentYear": {
                    "val": "8.960"
                },
                "BudgetYearOne": {
                    "val": "8.813"
                },
                "BudgetYearOneBase": {
                    "val": "8.813"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.394"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.201"
                },
                "BudgetYearOneBase": {
                    "val": "-2.201"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.394"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.201"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.201"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017, $2.201 million reduction to support higher priority projects"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "L59"
                    },
                    "ProjectTitle": {
                        "val": "Diagnost\/Expert Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.830"
                        },
                        "CurrentYear": {
                            "val": "4.699"
                        },
                        "BudgetYearOne": {
                            "val": "6.034"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.034"
                        },
                        "BudgetYearTwo": {
                            "val": "6.440"
                        },
                        "BudgetYearThree": {
                            "val": "6.720"
                        },
                        "BudgetYearFour": {
                            "val": "5.792"
                        },
                        "BudgetYearFive": {
                            "val": "5.948"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds development of and system enhancements for the Next Generation Automatic Test System (NGATS) and the Maintenance Support Device (MSD).  The NGATS is a general-purpose automatic test system (ATS) that provides test and diagnostic capabilities required to support current and future weapons and combat support systems and will facilitate retirement of aging and obsolete test equipment that is imposing increasing logistics and operations and support cost burdens.  It is the platform for transitioning Agile Rapid Global Combat Support System (ARGCS) Advanced Concept Technology Demonstration (ACTD) technologies into the Army weapon system support structure.  The ARGCS ACTD initiative was sponsored by the Department of Defense, and all Services are expected to transition demonstrated technologies into their ATS programs.  The MSD is the Army's standard at-system tester and requires continuing upgrades to support technology advancements in the supported weapon systems.  This project funds development projects to incorporate the most current relevant technology into the next generation MSD, supports capability enhancement of a wireless at-platform test set (WATS) connectivity, develops capabilities to minimize or eliminate Army dependency on expensive proprietary software to support tactical vehicles, integrates MSD into the Brigade Combat Team information structure as the at-platform data collection device for the Army's condition-based maintenance plus (CBM+) initiative and maintains compatibility with emerging aviation platform hardware bus technology and aviation notebook software interface requirements.  This project also provides for continuing efforts in the development and testing of common procedures utilizing existing test program sets and software applications; and market surveys of commercially available test equipment, methods and procedures to determine applicability to Army requirements.  The test and diagnostic systems and procedures developed under this project are essential for ensuring the operational readiness, accuracy and effectiveness of the Army's warfighting systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NGATS Radio Frequency (RF) Test Capability"
                                    },
                                    "Description": {
                                        "val": "Develop and integrate NGATS RF test capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Completed development of stand-alone commercial off-the-shelf RF test asset for NGATS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Initiate RF Interface Unit development, prototyping and integration of the entire RF test asset into the NGATS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continue prototyping and integration of RF subsystem into the NGATS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Increment 2"
                                    },
                                    "Description": {
                                        "val": "Develop and test hardware and software for NGATS Increment 2 support capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Text": {
                                                "val": "Continued development and testing of hardware and software for support of Increment 2 systems (Avenger, Multiple Launch Rocket System, TOW Missile System, Paladin and Common Remotely Operated Weapons Station (CROWS II))."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.885"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for support of Increment 2 systems (Avenger, Multiple Launch Rocket System, TOW Missile System, Paladin and CROWS II)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for support of additional Increment 2 systems (Counter RCIED (Radio-Controlled Improvised Explosive Device) Electronic Warfare (CREW) Duke, Precision Fires, Armored Multi-Purpose Vehicle (AMPV), Stryker Mobile Gun System (MGS), and Joint Assault Bridge (JAB))."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Electro-Optics (EO) Subsystem"
                                    },
                                    "Description": {
                                        "val": "Develop and test hardware and software for NGATS electro-optics (EO) subsystem (to include the capability to support new ground and aerial sensors for unmanned air and ground vehicles)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Completed development, prototyping and testing of stand-alone EO subsystem for NGATS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Initiate hardware and software integration\/testing of the EO subsystem into the NGATS for use by test program set (TPS) developers and depots."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue integration\/testing of EO subsystem into NGATS for use by Modified Table of Organization and Equipment (MTOE) locations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Developmental and Operational Follow-on Testing of NGATS Increment 1 Capability (Provides Abrams\/Bradley\/Stryker Support Capability)"
                                    },
                                    "Description": {
                                        "val": "Complete developmental and operational follow-on testing activities"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Initiate developmental and operational follow-on testing activities to include Reliability Testing, Logistics Demonstration\/TM Verification and Transportability Testing in support of a production decision.  Includes also the assessment\/verification of the development of remaining, needed capability of existing systems to operate with all existing test program sets used with legacy automatic test equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Continue and complete remaining required testing, assessment and verification events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additional Software Capabilities for Use with NGATS"
                                    },
                                    "Description": {
                                        "val": "Develop software capabilities to incorporate common logistics operating environment (CLOE)\/netcentric and embedded diagnostics data collection and analysis for closed loop diagnostic maintenance in support of condition-based maintenance"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Continued development of a network centric software framework to facilitate message communication."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Continue development of a network centric software framework to facilitate configuration status accounting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.270"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.270"
                                            },
                                            "Text": {
                                                "val": "Continue development of a network centric software framework to facilitate data exchange with other components of the global information grid (GIG)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Performance Enhancement"
                                    },
                                    "Description": {
                                        "val": "NGATS core instrument\/software modifications to increase NGATS performance"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.217"
                                            },
                                            "Text": {
                                                "val": "Initiated development of NGATS core instrument\/software modifications to increase NGATS performance to include redesign of the Automatic Test Equipment (ATE) interface perimeter engagement system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Continue development of NGATS core instrument\/software modifications to increase NGATS performance to include redesign of the ATE interface perimeter engagement system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.730"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.730"
                                            },
                                            "Text": {
                                                "val": "Complete prototype and evaluation of the redesigned perimeter engagement system and initiate development of increased processor speed with NGATS controller to add additional capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Smart TPSs\/Enhanced Self Test"
                                    },
                                    "Description": {
                                        "val": "Develop enhanced smart TPS hardware and software and enhanced self test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.508"
                                            },
                                            "Text": {
                                                "val": "Initiated development of enhanced self test strategy for NGATS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Abrams\/Bradley TPS Design"
                                    },
                                    "Description": {
                                        "val": "Design, test and evaluate Abrams\/Bradley TPSs to utilize modern core NGATS instrumentation vice continuing to execute on single-purpose instrumentation specifically developed to emulate Abrams\/Bradley legacy test equipment (i.e., Direct Support Electrical System Test Set (DSESTS))"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continued design, test and evaluation of Abrams\/Bradley TPSs to include analysis of Abrams\/Bradley TPSs against NGATS resources and incorporation of health monitoring into the instrumentation required for testing Abrams\/Bradley line replaceable units (LRU)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Redesign Abrams\/Bradley TPSs to execute on core commercial NGATS instrumentation versus continuing to execute on single purpose instrumentation specifically developed for testing Abrams\/Bradley LRUs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electro-Optic (EO) TPS Development"
                                    },
                                    "Description": {
                                        "val": "Develop Increment 2 and 3 EO TPSs for use with NGATS EO asset to utilize (Army standard) core NGATS instrumentation vice legacy automatic test systems such as DSESTS and Base Shop Test Facility (BSTF)(V)5"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Initiate development of re-hosted EO TPSs to include 4 each Abrams\/Bradley."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Continue development of re-hosted EO TPSs to include 2 each CROWS and 2 each Stryker Remote Weapons Station."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS System Level Calibration\/Verification Program"
                                    },
                                    "Description": {
                                        "val": "Develop and test the NGATS system level calibration\/verification program"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Continued development and testing of the NGATS system level calibration\/verification program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Logistics Support Products"
                                    },
                                    "Description": {
                                        "val": "Develop NGATS initial logistics support products (including provisioning, technical manuals and calibration)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Continued development of initial logistics support products for the core NGATS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Initiate development of initial logistics support products for the NGATS EO and RF subsystems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue development of NGATS EO and RF logistics products."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MSD Technology Enhancements"
                                    },
                                    "Description": {
                                        "val": "Incorporate current relevant technology into the next-generation MSD and support capability enhancement of the wireless at-platform test set (WATS).  Develop capabilities to minimize or eliminate Army dependency on proprietary software to support tactical vehicles, integrate MSD into the Brigade Combat Team information structure as the at-platform data collection device for the Army's CBM+ initiative, and maintain compatibility with emerging aviation platform hardware bus technology and aviation notebook software interface requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.805"
                                            },
                                            "Text": {
                                                "val": "Initiated development of the architectural software shell for WATS diagnostic software to accept modular platform testing software insertions.  Continued enhancement of WATS radio technology and common electronics package augmentation to provide at-platform wireless test support for Army vehicle and weapon systems platforms.  Devised methods to minimize or eliminate Army dependency on proprietary software to support current and future tactical vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.864"
                                            },
                                            "Text": {
                                                "val": "Complete enhancement of WATS radio technology, the common electronics package augmentation and WATS architectural software shell to provide at-platform wireless test support for Army vehicle and weapon systems platforms.  Continue to devise methods to minimize or eliminate Army dependency on proprietary software to support current and future tactical vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.234"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.234"
                                            },
                                            "Text": {
                                                "val": "Incorporate enhanced WATS radio technology, the common electronics package augmentation and new WATS software architecture into WATS prototype, conduct developmental testing, and develop draft Technical Data Package for at-platform wireless testing of Army vehicle and weapon systems platforms.  Continue to investigate new methods to minimize or eliminate Army dependency on proprietary software to support current and future tactical vehicles."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "."
                                    },
                                    "Title": {
                                        "val": "OPA3, SSN MB4000, Integrated Family of Test Equipment (IFTE)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "37.482"
                                        },
                                        "CurrentYear": {
                                            "val": "34.487"
                                        },
                                        "BudgetYearOne": {
                                            "val": "29.781"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "29.781"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "26.752"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.745"
                                        },
                                        "BudgetYearFour": {
                                            "val": "27.502"
                                        },
                                        "BudgetYearFive": {
                                            "val": "34.446"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "None."
                        },
                        "AcquisitionStrategy": {
                            "val": "This developmental project consists of organic and contractual actions.  When the necessary expertise and capability are available within the Department of Defense, services required for the individual development projects are ordered from the government source; otherwise, commercial contracts are used.  Equipment required for developmental projects is obtained by contract from the commercial supplier.  Developmental efforts for the Next Generation Automatic Test System (NGATS) are being completed under a number of contracts awarded to the prime contractor for the Integrated Family of Test Equipment off-platform testers and other contractors with automatic test equipment (ATE) and test program set development capabilities.  NGATS is following an evolutionary acquisition strategy using incremental development to satisfy Army depot and field testing requirements for new and existing systems.  It will replace existing legacy Army ATE (i.e., Base Shop Test Facility (BSTF)(V)3, BSTF(V)5, and Direct Support Electrical System Test Set) as well as Army depot system-specific ATE."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development\/ Verification\/Validation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "33.703"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.112"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.101"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.435"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.435"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hardware\/Support Items Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "61.252"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.668"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.591"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.899"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.899"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "48.528"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.850"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.657"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.450"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.450"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Direct"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.790"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Test program set (TPS) and contractor developmental test and evaluation are included in the product development cost."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Developmental\/Operational Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.046"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.850"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.850"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98178-57.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "98178-58.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Full Materiel Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "First Unit Equipped"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Rate Production Decision Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Testing (Increment 1 Follow-On DT\/OT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Full-Rate Production (Increment 1)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS System Development and Demonstration (SDD) (Increment 2)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Testing (Increment 2)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FOT&E Completed (DT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Development (EO Subsystem)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Development (RF Subsystem)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS EO Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS RF Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Testing (EO & RF Subsystems)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Product Improvements - Netcentric"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "New Systems Test Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MSD Technology Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Test program set (TPS) compatibility testing runs continually throughout the product development process"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L65"
                    },
                    "ProjectTitle": {
                        "val": "Test Equipment Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.855"
                        },
                        "CurrentYear": {
                            "val": "4.261"
                        },
                        "BudgetYearOne": {
                            "val": "2.779"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.779"
                        },
                        "BudgetYearTwo": {
                            "val": "3.922"
                        },
                        "BudgetYearThree": {
                            "val": "4.852"
                        },
                        "BudgetYearFour": {
                            "val": "3.998"
                        },
                        "BudgetYearFive": {
                            "val": "4.026"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports development and demonstration of state-of-the-art calibration standards and techniques, and upgrades\/improvements to existing Army calibration systems.  It provides feasibility studies, market research, inventory analyses, bid sample testing, and prototyping to support calibration systems and general-purpose test, measurement and diagnostic equipment (TMDE) acquisitions.  Primary efforts under this project include development of calibration software, calibration capability for chemical and biological agent detection systems, and improvement of test and measurement equipment performance envelopes.  This project provides for product improvements and development\/evaluation of advanced technologies to increase reliability of calibration systems and general-purpose TMDE.  The product improvements eliminate gaps in existing organic capabilities and ensure operational readiness, accuracy, effectiveness, and safety of Army weapons and combat support systems.  These improvements employ reconfigurable open-electronics architecture and computer-based instrumentation where feasible and focus on reduced test equipment footprint to improve deployability and mobility in areas of operation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Calibration Sets (CALSETS) Software Environment and Calibration"
                                    },
                                    "Description": {
                                        "val": "Develop and test an Army automated calibration environment and develop calibration procedures.  Test efforts in support of DoD Information Assurance Certification and Accreditation Process (DIACAP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "Developed and evaluated calibration procedures.  Developed, tested and evaluated enhanced calibration software environment.  Developed and tested DIACAP for calibration instrument controllers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.368"
                                            },
                                            "Text": {
                                                "val": "Continue development and evaluation of automated calibration procedures.  Evaluate feasibility of incorporating commercial procedures and calibration system performance monitoring within the software environment.  Test and evaluate prototype calibration procedure development engine."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.785"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.785"
                                            },
                                            "Text": {
                                                "val": "Initiate addition of ISO 17250 accreditation reporting to calibration software environment and calibration procedures.  Develop and evaluate automated calibration procedures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physical Instruments"
                                    },
                                    "Description": {
                                        "val": "Research, develop, and test physical parameter calibration instrumentation to support areas such as chemical\/biological agent detection systems, night vision testers, small arms gages, pneumatic pressure systems, temperature, etc."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.258"
                                            },
                                            "Text": {
                                                "val": "Completed development and test of hydrocarbon flow calibration and test standards.  Continued development, automation, and test of prototype small arms gage calibration standards.  Initiated development and test of chemical agent detectors and protective equipment testers and calibrators.  Initiated development of pneumatic standards to support avionic systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.236"
                                            },
                                            "Text": {
                                                "val": "Continue development and test of prototype small arms gage calibration standards.  Continue development and test of calibration systems for biological agent detectors and protective equipment.  Continue development of pneumatic standards to support avionic systems.  Perform market research, evaluate commercial equipment, and complete specifications for acquisition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.833"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.833"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of prototype small arms gage calibration standards.  Continue development and test of calibration systems for biological agent detectors and protective equipment.  Complete tests of pneumatic standards to support avionic systems.  Perform market research, evaluate commercial equipment, and complete specifications for acquisition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electrical Instruments"
                                    },
                                    "Description": {
                                        "val": "Research, develop, and test electrical calibration instrumentation to support areas such as deployable recertification set, intrinsic electrical standards, and electrical transport standards."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.208"
                                            },
                                            "Text": {
                                                "val": "Performed market research, evaluated commercial equipment and developed performance specifications for acquisition.  Completed testing of DC intrinsic voltage system and continued testing of AC intrinsic voltage system.  Completed testing of electronic transport standards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.272"
                                            },
                                            "Text": {
                                                "val": "Perform market research, evaluate commercial equipment and develop performance specifications for acquisition.  Complete development and test of high voltage multiplier for AC intrinsic voltage system.  Develop and test prototype microwave reference standard."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.776"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.776"
                                            },
                                            "Text": {
                                                "val": "Perform market research, evaluate commercial equipment and develop performance specifications for acquisition.  Continue development of prototype microwave reference standards.  Research improvements in reliability, transportability and supportability of DC intrinsic voltage standards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test Equipment Modernization (TEMOD)"
                                    },
                                    "Description": {
                                        "val": "Perform market research, bid sample testing, and evaluation of commercial general-purpose electronic test equipment (GPETE) and develop performance specifications for TEMOD acquisitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Text": {
                                                "val": "Performed market research and evaluation of commercial GPETE and developed performance specifications for future acquisitions.  Conducted bid sample testing to support acquisition program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluation of commercial GPETE and develop performance specifications for equipment to support acquisition program.  Conduct bid sample testing to support acquisition program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.385"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluation of commercial GPETE and develop performance specifications for improved capability spectrum analysis test equipment.  Conduct bid sample testing to support acquisition program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "SSN N10000"
                                    },
                                    "Title": {
                                        "val": "Calibration Sets Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.726"
                                        },
                                        "CurrentYear": {
                                            "val": "4.650"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.963"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.963"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.564"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.515"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.459"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.964"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SSN N11000"
                                    },
                                    "Title": {
                                        "val": "Test Equipment Modernization"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.711"
                                        },
                                        "CurrentYear": {
                                            "val": "11.083"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.482"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.342"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "1.140"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.880"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.769"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.914"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.916"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects are focused on use of commercial and nondevelopmental item technologies.  Department of Defense services provide programmatic, engineering expertise and capability for individual development projects; otherwise, commercial service contracts are used to obtain these capabilities.  Equipment required for development projects is obtained from commercial suppliers.  Candidate commercial equipment and nondevelopmental items are identified and evaluated through market research and government test and evaluation."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "In-house Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Civ Labor"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.431"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.902"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.596"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.680"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.680"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CALSETS Software Environment and Calibration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.818"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.351"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.616"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.368"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.368"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Physical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.365"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.529"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.582"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.253"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.253"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Electrical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.029"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.503"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.553"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.302"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.302"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test Equipment Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.370"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.160"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.208"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.977"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.228"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.282"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CALSETS Software Environment and Calibration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.570"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.311"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.456"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.382"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.382"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Physical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.463"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.358"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.433"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.242"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.242"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Electrical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.515"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.303"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.358"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.152"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.152"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test Equipment Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.336"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.210"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.177"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98178-59.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Physical Instruments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2007"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CALSETS Software Environment and Calibration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2007"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Electrical Instruments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2007"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Test Equipment Modernization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}