{
    "id": "97c1363fe5e4155c4dfa4ebc535d1ce56627c50f",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA3_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603007A"
        },
        "ProgramElementTitle": {
            "val": "Manpower, Personnel and Training Advanced Technology"
        },
        "R1LineNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "11.677"
            },
            "CurrentYear": {
                "val": "12.636"
            },
            "BudgetYearOne": {
                "val": "14.417"
            },
            "BudgetYearOneBase": {
                "val": "14.417"
            },
            "BudgetYearTwo": {
                "val": "14.695"
            },
            "BudgetYearThree": {
                "val": "15.123"
            },
            "BudgetYearFour": {
                "val": "15.422"
            },
            "BudgetYearFive": {
                "val": "15.730"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates advanced behavioral and social science technologies that enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., culture of dignity, respect, and inclusion).  These technologies provide advanced personnel measures that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective training and mentoring methods to ensure Soldiers, leaders, and units have the knowledge, skills, and abilities to sustain positive unit climates and meet mission requirements in uncertain and complex environments. This PE validates new selection measures and performance metrics, assesses innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Research in this PE will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.\n\nEfforts in this PE support the Army Science and Technology Soldier portfolio.\n\nWork in this PE complements and is fully coordinated with and PE 0602785A (Manpower\/Personnel\/Training Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Human Capital Strategy.\n\nWork in this PE is performed by the Army Research Institute (ARI) for the Behavioral and Social Sciences in Ft. Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.574"
                },
                "CurrentYear": {
                    "val": "12.636"
                },
                "BudgetYearOne": {
                    "val": "14.417"
                },
                "BudgetYearOneBase": {
                    "val": "14.417"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.677"
                },
                "CurrentYear": {
                    "val": "12.636"
                },
                "BudgetYearOne": {
                    "val": "14.417"
                },
                "BudgetYearOneBase": {
                    "val": "14.417"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.897"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.397"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "792"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Performance & Training"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.677"
                        },
                        "CurrentYear": {
                            "val": "12.636"
                        },
                        "BudgetYearOne": {
                            "val": "14.417"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.417"
                        },
                        "BudgetYearTwo": {
                            "val": "14.695"
                        },
                        "BudgetYearThree": {
                            "val": "15.123"
                        },
                        "BudgetYearFour": {
                            "val": "15.422"
                        },
                        "BudgetYearFive": {
                            "val": "15.730"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced behavioral and social science technologies that enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., culture of dignity, respect, and inclusion).  These technologies provide advanced personnel measures that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective training and mentoring methods to ensure Soldiers, leaders, and units have the knowledge, skills, and abilities to sustain positive unit climates and meet mission requirements in uncertain and complex environments. This Project validates new selection measures and performance metrics, assesses innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Research in this Project will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.\n\nEfforts in this Project support the Army Science and Technology Soldier portfolio.\n\nWork in this Project complements and is fully coordinated with and Program Element (PE) 0602785A (Manpower\/Personnel\/Training Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Human Capital Strategy.\n\nWork in this PE is performed by the Army Research Institute (ARI) for the Behavioral and Social Sciences in Ft. Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel Assessment"
                                    },
                                    "Description": {
                                        "val": "This effort matures and assesses Soldier selection measures, techniques and tools to better predict behavior and performance to provide the Army the flexibility to adapt to changing recruiting environments.  The Army's current selection measures primarily focus on a candidate's cognitive (e.g., technical and analytical) ability which does not predict attrition, discipline, and motivation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.653"
                                            },
                                            "Text": {
                                                "val": "Validated non-cognitive measures as predictors of success (e.g., attrition, performance, attitudes) for enlisted Soldiers as well as non-commissioned officers (NCOs) in special assignments;  identified strategies for conducting classification analyses. Initiated research to develop enhanced suitability screening for military positions of trust (e.g., Sexual Harassment\/Assault Response and Prevention Coordinators, Drill Sergeants)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.348"
                                            },
                                            "Text": {
                                                "val": "Continuing validation and refinement of non-cognitive predictors of success (e.g., attrition, performance, attitudes) for enlisted Soldiers and non-commissioned officers at accession and selection for special assignments; conducting classification analyses to aid person-job match."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Will validate expanded enlisted screens and non-cognitive assessments as predictors for success in military occupational specialties (MOS) and in-service assignments (e.g., Recruiters, Instructors). This research is on-going validation of non-cognitive assessments for valued Army outcomes (e.g., attrition, performance) across a Soldier’s first term of enlistment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Personnel Readiness, Performance, and Conduct"
                                    },
                                    "Description": {
                                        "val": "This effort matures methods to assess, enhance, and sustain individual and unit readiness, resilience, and effectiveness to improve Soldier and unit performance. This effort also develops efficient and empirically valid measures to assess command climate and associated outcomes, and matures methods to enable leaders and units to maintain or create climates of respect, dignity and inclusion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.024"
                                            },
                                            "Text": {
                                                "val": "Initiated research to prevent sexual harassment and assault through more effective training and mentoring methods. Initiated research on valid measures of command climates of dignity, respect, and inclusion. Validated Army instructor methods and techniques to improve instructor skills."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.288"
                                            },
                                            "Text": {
                                                "val": "Developing measures of conduct and performance as indicators of unit climate of dignity, respect, and inclusion; designing and developing measures of collective performance;  developing methods and measures to identify and develop high quality Army instructors;  developing training methods that allow Soldiers to better use and control highly automated training systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.417"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.417"
                                            },
                                            "Text": {
                                                "val": "Will mature research to develop training and leader development methods to develop unit climate of dignity, respect, and inclusion and unit resilience (e.g., prepare Leaders to assess, enhance, and sustain individual and unit resilience); will mature research to develop measures and strategies to optimize small unit performance and individual training performance (e.g., how best to obtain optimal performance while using highly automated training systems)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}