{
    "id": "99054182fba2a2a27ae0df565eae0c58d9b977f1",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA7_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0305208A"
        },
        "ProgramElementTitle": {
            "val": "Distributed Common Ground\/Surface Systems"
        },
        "R1LineNumber": {
            "val": "203"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.155"
            },
            "CurrentYear": {
                "val": "25.592"
            },
            "BudgetYearOne": {
                "val": "32.284"
            },
            "BudgetYearOneBase": {
                "val": "32.284"
            },
            "BudgetYearTwo": {
                "val": "39.537"
            },
            "BudgetYearThree": {
                "val": "50.756"
            },
            "BudgetYearFour": {
                "val": "49.143"
            },
            "BudgetYearFive": {
                "val": "46.535"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Distributed Common Ground Systems - Army (DCGS-A) is a designated Major Automation Information System (MAIS) program."
        },
        "ProgramElementMissionDescription": {
            "val": "Distributed Common Ground System - Army (DCGS-A) is the Intelligence, Surveillance and Reconnaissance (ISR) System of Systems (SoS) for Joint, Interagency, Allied, Coalition, and National data analysis, sharing and collaboration.  The core functions of DCGS-A are:  the vertical and horizontal synchronization of ISR Processing, Exploitation and Dissemination (PED) efforts; operations in a networked environment at multiple security levels; the control of select Army and joint sensor systems; the fusion of all acquired data and information, and distribution of relevant red (threat), gray (non-aligned), and environmental (weather and terrain) information; and providing the Warfighters' early warning, targeting, and sensor ground station capabilities.  DCGS-A provides a single integrated ISR ground processing system composed of common components that are interoperable with sensors, other information sources, all Warfighting Functions, and the Defense Information & Intelligence Enterprise (DI2E) and Intelligence Community Information Technology Enterprise (ICITE).  DCGS-A is fielded in Fixed, Mobile, and embedded configurations emphasizing the use of reach and split based operations by improving accessibility of data in order to reduce forward deployed footprint.  As enhanced capabilities are developed and tested, a continuing series of software releases will be integrated into Army Common\/commodity hardware and fielded to units IAW the Army Resourcing Priority List (ARPL) process.\n\nThe Army Acquisition Executive designated PEO IEW&S and DCGS-A as the Command Post Computing Environment (CPCE) Lead.  As such, DCGS-A is defining the architecture to fit within the Common Operating Environment (COE) as described by the Assistant Secretary of the Army (Acquisition, Logistics, and Technology) (ASA(ALT)) COE Implementation Plan.  This is in accordance with the G-3\/5\/7 priority to align all Army networks, procurements, and enhancements under one COE and one vision leveraging intelligence community investments.\n\nDCGS-A consolidated, enhanced, and modernized the Tasking, Processing, Exploitation, and Dissemination (TPED) capabilities formerly found in nine Army intelligence programs of record (Common Ground Station (CGS), Guardrail Common Sensor (GRCS), Counterintelligence & Interrogation Operations Workstation (CI&I OPS WS), All Source Analysis System (ASAS), Enhanced TrackWolf (ETW), Digital Topographic Support System (DTSS), Integrated Meteorological System (IMETS), Tactical Exploitation System (TES), and Prophet Control) and two Quick Reaction Capabilities (Joint Intelligence Operations Center – Iraq (JIOC-I) and Imagery Work Station(IWS)).  DCGS-A provides these technologically advanced PED capabilities in tailored and scalable mobile, fixed, and embedded configurations in all maneuver and maneuver support units from Company Intelligence Support Team to Army Service Component Command, and in select maneuver sustainment units battalion and above.  The program develops software packages to be embedded in mission command and other select systems to provide required ISR\/analytic capabilities.  DCGS-A is one of the Army's top modernization priorities.\n\nDCGS-A software is tailored by echelon and scalable to each unit's mission.  DCGS-A provides commanders and staffs the ability to maintain an accurate and up to date understanding of the operational environment.  The DCGS-A contribution to commanders' visualization and situational awareness, rapid planning, and the synchronization of all warfighting functions, enable Army units to operate within the enemy's decision cycle.  This capability enhances tactical and operational maneuver and the conduct of full spectrum operations across the range of military operations from humanitarian to major combat operations and campaigns through all phases of the Joint Continuum of Military Operations.\n\nThe DCGS-A configurations range from laptops to systems integrated in tactical shelters and mounted on tactical vehicles to large commodity servers operating in a sanctuary based processing environment.  The fundamental intent and tenet of this approach is to reduce forward deployed equipment\/footprint by co-locating the advanced analytics capabilities within the DCGS-A baseline with the regional data centers, where the data is stored.  This infrastructure consolidation simultaneously reduces processor and communications requirements in tactical units by limiting the number of large data files transported across tactical communications systems.  Following a successful operational assessment and Milestone C in 2QFY12\/Full Deployment Decision in 1QFY13, the program is deploying DCGS-A Increment 1 Release 1 Software Baseline capability throughout the Army.\n\nProject 956 does not have funds in FY17.\n\nFY17 Base funding in the amount of $32.284 million for D07, will continue the iterative DCGS-A software releases that will increase the Processing, Exploitation, and Dissemination capability our Army requires.  Increment 2 of the DCGS-A program will continue critical updates to the Army's ISR PED and multi-intelligence planning, analysis, and production capabilities through the exploitation of Cloud Computing and advanced analytics capabilities.  This approach will achieve Information Technology efficiencies through alignment with the Intelligence Community Information Technology Environment, while developing the incremental software updates required to remain current."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.155"
                },
                "CurrentYear": {
                    "val": "25.592"
                },
                "BudgetYearOne": {
                    "val": "25.777"
                },
                "BudgetYearOneBase": {
                    "val": "25.777"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.155"
                },
                "CurrentYear": {
                    "val": "25.592"
                },
                "BudgetYearOne": {
                    "val": "32.284"
                },
                "BudgetYearOneBase": {
                    "val": "32.284"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "6.507"
                },
                "BudgetYearOneBase": {
                    "val": "6.507"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "6.507"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.507"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The $6.507M  adjustment will resource the continued development and testing of Increment 2, Project D07."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "956"
                    },
                    "ProjectTitle": {
                        "val": "Distributed Common Ground System (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.570"
                        },
                        "CurrentYear": {
                            "val": "8.923"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Distributed Common Ground System - Army (DCGS-A) is designated a Major Automation Information System (MAIS) program."
                        },
                        "ProjectMissionDescription": {
                            "val": "Distributed Common Ground System - Army (DCGS-A) is the Intelligence, Surveillance and Reconnaissance (ISR) System of Systems (SoS) for Joint, Interagency, Allied, Coalition, and National data analysis, sharing and collaboration.  The core functions of DCGS-A are:  the vertical and horizontal synchronization of ISR Processing, Exploitation and Dissemination (PED) efforts; operations in a networked environment at multiple security levels; the control of select Army and joint sensor systems; the fusion of all acquired data and information, and distribution of relevant red (threat), gray (non-aligned), and environmental (weather and terrain) information; and providing the Warfighters' early warning, targeting, and sensor ground station capabilities.  DCGS-A provides a single integrated ISR ground processing system composed of common components that are interoperable with sensors, other information sources, and all Warfighting Functions. DCGS-A is fielded in Fixed, Mobile, and embedded configurations emphasizing the use of reach and split based operations by improving accessibility of data in order to reduce forward deployed footprint.  As enhanced capabilities are developed and tested, a continuing series of software releases will be integrated into Army common\/commodity hardware and fielded to units in accordance with the Dynamic Army Resourcing Priority List (DARPL) process.\n\nThe Army Acquisition Executive designated PEO IEW&S and DCGS-A as the Command Post Computing Environment (CPCE) Lead.  As such, DCGS-A is defining the architecture to fit within the Common Operating Environment (COE) as described by the Assistant Secretary of the Army (Acquisition, Logistics, and Technology) (ASA(ALT)) COE Implementation Plan.  This is in accordance with the G-3\/5\/7 priority to align all Army networks, procurements, and enhancements under one COE and one vision leveraging intelligence community investments.\n\nDCGS-A consolidated, enhanced, and modernized the Tasking, Processing, Exploitation, and Dissemination (TPED) capabilities formerly found in nine Army intelligence programs of records (Common Ground Station (CGS), Guardrail Common Sensor (GRCS), Counterintelligence & Interrogation Operations Workstation (CI&I OPS WS), All Source Analysis System (ASAS), Enhanced TrackWolf (ETW), Digital Topographic Support System (DTSS), Integrated Meteorological System (IMETS), Tactical Exploitation System (TES), and Prophet Control) and two Quick Reaction Capabilities (Joint Intelligence Operations Center – Iraq (JIOC-I) and Imagery Work Station(IWS)).  DCGS-A provides these technologically advanced PED capabilities in tailored and scalable mobile, fixed, and embedded configurations in all maneuver and maneuver support units from Company Intelligence Support Team to Army Service Component Command, and in select maneuver sustainment units battalion and above.  The program also develops software packages to be embedded in mission command and other select systems to provide required ISR\/analytic capabilities.  DCGS-A is one of the Army's top modernization priorities.\n\nDCGS-A software is tailored by echelon and scalable to each unit's mission.  DCGS-A provides commanders and staffs the ability to maintain an accurate and up to date understanding of the operational environment.  The DCGS-A contribution to commanders' visualization and situational awareness, rapid planning, and the synchronization of all warfighting functions, enable Army units to operate within the enemy's decision cycle.  This capability enhances tactical and operational maneuver and the conduct of full spectrum operations across the range of military operations from humanitarian to major combat operations and campaigns through all phases of the Joint Continuum of Military Operations.\n\nThe DCGS-A configurations range from laptops to systems integrated in tactical shelters and mounted on tactical vehicles to large commodity servers operating in a sanctuary based processing environment.  The fundamental intent and tenet of this approach is to reduce forward deployed equipment\/footprint by co-locating the advanced analytics capabilities within the DCGS-A baseline with the regional data centers, where the data is stored.  This infrastructure consolidation simultaneously reduces processor and communications requirements in tactical units by limiting the number of large data files transported across tactical communications systems.  Following a successful operational assessment and Milestone C in 2QFY12\/Full Deployment Decision in 1QFY13, the program is deploying DCGS-A Increment 1 Release 1 Software Baseline capability throughout the Army.\n\nProject 956 has no funds in FY17."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Design and Development of DCGS-A enterprise level net-centric architecture"
                                    },
                                    "Description": {
                                        "val": "Continue design and development of DCGS-A enterprise level net-centric architecture to include: Development & Integration of DCGS-A Software;  Developmental Test\/Operational Test, Mobile Basic Contract Deliverables, and Program Management support costs.  Global Unified Data Environment (Cloud) - development - to create direct Data Ingest of varying intelligence data types and development of analytical tools to exploit single intelligence data, further enhancing Cloud Enterprise Account Management load distribution of enterprise level complex searches. Development of Cloud to Cloud Data Synchronization technologies and enhanced data management applications between Cloud and Edge nodes."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.530"
                                            },
                                            "Text": {
                                                "val": "Fund will be used to correct of deficiencies discovered during the Follow-On Operational Test and Evaluation (FOT&E) and to integrate software baselines that will begin fielding in 2016 on both SIPR and TS\/SCI networks"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Matrix support including systems integration lab software support."
                                    },
                                    "Description": {
                                        "val": "Matrix support including systems integration lab software support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.356"
                                            },
                                            "Text": {
                                                "val": "Performed matrix support including systems integration lab software support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will utilize matrix support for systems integration lab software requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army and Joint Testing\/Development\/Operational Test Support\/Software Fixes"
                                    },
                                    "Description": {
                                        "val": "Ongoing Army and Joint interoperability testing and evaluation to include Operational Assessment (Network Integration Evaluation (NIE) Operational Assessment), Joint Interoperability Test Command, and Operational Test and Software Fixes"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.321"
                                            },
                                            "Text": {
                                                "val": "Supported the Limited User Test (LUT) at NIE 15.2 and funded software fixes once complete."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Will support completion of software fixes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support Costs and Management Services"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort\/Project Management Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.893"
                                            },
                                            "Text": {
                                                "val": "Provided program management office support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.893"
                                            },
                                            "Text": {
                                                "val": "Will support program management office requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "DCGS-A (MIP) Procurement"
                                    },
                                    "Title": {
                                        "val": "BZ7316 - Procurement"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "192.038"
                                        },
                                        "CurrentYear": {
                                            "val": "304.408"
                                        },
                                        "BudgetYearOne": {
                                            "val": "275.546"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "242.514"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "33.032"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "273.518"
                                        },
                                        "BudgetYearThree": {
                                            "val": "283.944"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Theater Net-Centric Geolocation TNG"
                                    },
                                    "Title": {
                                        "val": "Theater Net-Centric Geolocation (TNG) RDTE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.350"
                                        },
                                        "CurrentYear": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.410"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.606"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "1.698"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Distributed Common Ground System-Army (DCGS-A) program was created in response to the Department of Defense (DoD) Distributed Common Ground\/Surface System (DCGS) Mission Area Initial Capabilities Document (MA ICD) dated 13 Aug 2004, which captured the overarching requirements for an Intelligence, Surveillance, and Reconnaissance (ISR) Family of Systems (FoS) that will contribute to Joint and combined Warfighter needs. That ICD was updated as the Distributed Common Ground\/Surface System (DCG\/SS) Enterprise ICD, and approved by the Joint Requirements Oversight Council (JROC) 27 Feb 2009. The Army requirements were refined in the DCGS-A Capabilities Development Document (CDD), and approved by the JROC 31 Oct 2005. The DCGS-A program is currently in the Production and Deployment phase and was designated as a Major Automated Information System (MAIS) in OSD (AT&L) Memorandum, 29 Mar 2010. \n\nDCGS-A is following an evolutionary acquisition approach to develop and field system capabilities over time to satisfy the requirements of the DCGS-A Capability Development Document (CDD). Following this approach, the first increment was defined and a Capability Production Document (CPD) was created with full consideration of all of the preceding supporting documents and analysis. As part of its initial staffing, a Cost Benefit Analysis was completed in support of the DCGS-A CPD. This analysis projected a significant cost avoidance\/savings over the life cycle by not limiting the hardware configuration to a one size fits all unit types design but rather integrating the DCGS-A Software capabilities into common servers and other IT components fielded at that echelon. This approach was validated during the Milestone C and Full Deployment Decision process in FY2012 through the Office of the Secretary of Defense (OSD) Cost Assessment and Program Evaluation (CAPE) approval of the Economic Analysis.  This Economic Analysis validated the cost savings achieved utilizing the acquisition approach outlined above. \n\nPM DCGS-A has been designated as the Command Post Computing Environment (CPCE) Lead for PEO IEW&S. As such, DCGS-A is currently aligning it's architecture to fit within the Common Operating Environment (COE) as described by the ASA(ALT) COE Implementation Plan. This alignment is in accordance with the G-3\/5\/7 priority to align all Army networks, procurements, and enhancements under one COE and one vision. Our acquisition strategy supports this initiative as we continue to collapse PORs and reduce footprint following our capability migration path and iterative development of software releases which continue to increase capabilities to satisfy the remaining CPD requirements beyond Initial Minimal Capability. As DCGS-A continues the path through Increment 1 and beyond, each release will focus on the COE and continually align the Command Post activities with POR migration activities.  The program office expects to continue as the DCGS-A System Integrator for software development and hardware integration for Increment 1, and will continue to access multiple vendors by leveraging a variety of competitively awarded contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM, DCGS-A"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "28.882"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.893"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.893"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Metadata Catalog"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.865"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Design & Develop DCGS-A Architecture"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman, Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Linthicum, MD, Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "247.877"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "247.877"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Design & Develop DCGS-A Incr 1 Software"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.964"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Secure Common Data Link (SCDL)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CUBIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, Fla."
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.788"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Global Unified Data Environment (Cloud) Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC\/SEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "21.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Fixes"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.530"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.830"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Design & Develop DCGS-A Architecture (CPCE & Sensor CE)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Matrix Support Government Test & Integration Lab"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "CECOM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.816"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.356"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Operational Test Support for DCGS-A Rel 2"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC, OTC, Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD, EPG, Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.149"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Integration\/Fixes"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.894"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.394"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Developmental Testing for Sensor CE"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "I2WD, Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD, Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.127"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.127"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "NIE for Rel 2 and CPCE COE V2"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NIE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Bliss"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.087"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Operational Assessments\/Joint Demo for Inc 1  and CPCE"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Empire Challenge, ULCHI Freedom Guardia, Unified Vision"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "AZ, KO, EU"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.100"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.100"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Certification Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC\/CTSF"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "ATEC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.616"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.616"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98191-77.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Inc 1 Rel 1 - 2 Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Developmental Test\/Operational Test\/Log Demo  Inc 1 Rel 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding & Training Inc 1 Rel 1 IAW DARPL Rotations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding & Training Inc 1 Rel 2 IAW DARPL Rotations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D07"
                    },
                    "ProjectTitle": {
                        "val": "DCGS-A Common Modules (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.585"
                        },
                        "CurrentYear": {
                            "val": "16.669"
                        },
                        "BudgetYearOne": {
                            "val": "32.284"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.284"
                        },
                        "BudgetYearTwo": {
                            "val": "39.537"
                        },
                        "BudgetYearThree": {
                            "val": "50.756"
                        },
                        "BudgetYearFour": {
                            "val": "49.143"
                        },
                        "BudgetYearFive": {
                            "val": "46.535"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Distributed Common Ground System - Army (DCGS-A) is designated a Major Automation Information System (MAIS) program."
                        },
                        "ProjectMissionDescription": {
                            "val": "Distributed Common Ground System - Army (DCGS-A) is the Intelligence, Surveillance and Reconnaissance (ISR) System of Systems (SoS) for Joint, Interagency, Allied, Coalition, and National data analysis, sharing and collaboration.  The core functions of DCGS-A are:  the vertical and horizontal synchronization of ISR Processing, Exploitation and Dissemination (PED) efforts; operations in a networked environment at multiple security levels; the control of select Army and joint sensor systems; the fusion of all acquired data and information, and distribution of relevant red (threat), gray (non-aligned), and environmental (weather and terrain) information; and providing the Warfighters' early warning, targeting, and sensor ground station capabilities.  DCGS-A provides a single integrated ISR ground processing system composed of common components that are interoperable with sensors, other information sources, all Warfighting Functions, compliant with standards providing the Defense Information & Intelligence Enterprise (DI2E) and Intelligence Community Information Technology Enterprise (ICITE).  DCGS-A is fielded in Fixed, Mobile, and embedded configurations emphasizing the use of reach and split based operations by improving accessibility of data in order to reduce forward deployed footprint.  As enhanced capabilities are developed and tested, a continuing series of software releases will be integrated into Army Common\/commodity hardware and fielded to units IAW the Army Resourcing Priority List (ARPL) process.\n\nThe Army Acquisition Executive designated PEO IEW&S and DCGS-A as the Command Post Computing Environment (CPCE) Lead.  As such, DCGS-A is defining the architecture to fit within the Common Operating Environment (COE) as described by the Assistant Secretary of the Army (Acquisition, Logistics, and Technology) (ASA(ALT)) COE Implementation Plan.  This is in accordance with the G-3\/5\/7 priority to align all Army networks, procurements, and enhancements under one COE and one vision leveraging intelligence community investments.\n\nDCGS-A provides technologically advanced Processing, Exploitation, and Dissemination (PED) capabilities through iterative software releases delivered in tailored and scalable mobile, fixed, and embedded configurations in all maneuver and maneuver support units from Company Intelligence Support Team to Army Service Component Command, and in select maneuver sustainment units battalion and above.  The program develops software packages to be embedded in mission command and other select systems to provide required ISR\/analytic capabilities.  DCGS-A is one of the Army's top ten modernization priorities.\n\nFY17 Base funding in the amount of $32.284 million will continue the iterative DCGS-A software releases that will increase the Processing, Exploitation, and Dissemination capability our Army requires.  Increment 2 of the DCGS-A program will continue critical updates to the Army's ISR PED and multi-intelligence planning, analysis, and production capabilities through the exploitation of Cloud Computing and advanced analytics capabilities.  This approach will achieve Information Technology efficiencies through alignment with the Intelligence Community Information Technology Environment, while developing the incremental software updates required to remain current."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Design & Develop DCGS-A Inc 2 Software"
                                    },
                                    "Description": {
                                        "val": "Continue efforts to design & develop DCGS-A Inc 2 software. Increment 2 expands on the capabilities provided by Increment 1 by adding capabilities at the Army and below echelons while developing new, enhanced, and leap-ahead Intelligence, Surveillance, and Reconnaissance (ISR) and Standard and Shareable Geospatial Foundation (SSGF) enterprise capabilities to align with the Intelligence Community (IC) and Army's Common Operating Environment (COE) and transformation objectives.  Increment 2 and beyond will leverage the investment made in previous DCGS-A increments and include emerging technologies related to: Tasking of sensors; controlling select Army sensor systems; Processing, fusing, and Exploiting data and information; supporting knowledge generation; providing ground station capabilities; automated support to intelligence product generation; Disseminating information and intelligence about the threat, weather, and terrain at all echelons; automating intelligence synchronization, including ISR planning, reconnaissance and surveillance integration and assessment; supporting situation understanding; supporting targeting and effects; providing the Standard and Sharable Geospatial Foundation (SSGF) to COE Computing Environments (CEs). These requirements will be defined in the DCGS-A Requirements Data Package (RDP) and Capability Drops (CDs) as necessary to ensure DCGS-A provides the data, information, intelligence, situation awareness, and interoperability needed to support the Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.836"
                                            },
                                            "Text": {
                                                "val": "Designed & developed DCGS-A Inc 2 software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.085"
                                            },
                                            "Text": {
                                                "val": "Continue to design & develop DCGS-A Inc 2 software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.791"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.791"
                                            },
                                            "Text": {
                                                "val": "Will continue to design & develop DCGS-A Inc 2 software."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System reconfiguration\/redesign"
                                    },
                                    "Description": {
                                        "val": "System Reconfiguration to enhance the systems to deliver higher performance to leverage industry enhancements\/innovation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.720"
                                            },
                                            "Text": {
                                                "val": "Initiated System Reconfiguration to enhance the systems delivered higher performance to leverage industry enhancements\/innovation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Text": {
                                                "val": "Completing System Reconfiguration to enhance the systems to deliver higher performance to leverage industry enhancements\/innovation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Matrix Support Government for Software Development and Integration"
                                    },
                                    "Description": {
                                        "val": "Matrix Support Government for Software Development and Integration support for software integration to the target platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.657"
                                            },
                                            "Text": {
                                                "val": "Initiated Matrix Support Government for Software Development and Integration support for software integration to the target platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.148"
                                            },
                                            "Text": {
                                                "val": "Continuing Matrix Support Government for Software Development and Integration support for software integration to the target platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.131"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.131"
                                            },
                                            "Text": {
                                                "val": "Will continue Matrix Support Government for Software Development and Integration support for software integration to the target platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Project Management"
                                    },
                                    "Description": {
                                        "val": "Project Management support to manage the cost, schedule, and performance metrics for the program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.054"
                                            },
                                            "Text": {
                                                "val": "Initiated Project Management support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.136"
                                            },
                                            "Text": {
                                                "val": "Continuing Project Management support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.641"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.641"
                                            },
                                            "Text": {
                                                "val": "Will continue Project Management support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army and Joint Testing\/Development\/Operational Test Support"
                                    },
                                    "Description": {
                                        "val": "Development and Testing of Increment 2"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will begin development and testing of Increment 2"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Milestone preparation"
                                    },
                                    "Description": {
                                        "val": "Milestone preparation; Activities; Analyze, define, and document the acquisition approach and achieve a successful Materiel Development Decision for the Increment 2 program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.318"
                                            },
                                            "Text": {
                                                "val": "Analyzed, defined, and documented the acquisition approach and achieved a successful Materiel Development Decision for the Increment 2 program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training Development"
                                    },
                                    "Description": {
                                        "val": "Training development  - embedded computer based training (CBT) for the Inc 2 software."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.316"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.316"
                                            },
                                            "Text": {
                                                "val": "Will initiate training development  - embedded computer based training (CBT) for the Inc 2 software."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Logistics Documentation"
                                    },
                                    "Description": {
                                        "val": "Logistics activities including task maintenance task analysis, level of repair analysis, user manual, training support package, and MANPRINT activities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.405"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.405"
                                            },
                                            "Text": {
                                                "val": "Will initiate logistics activities including task maintenance task analysis, level of repair analysis, user manual, training support package, and MANPRINT activities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BZ7316 - DCGS-A Procurement"
                                    },
                                    "Title": {
                                        "val": "BZ7316 - DCGS-A (MIP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "192.038"
                                        },
                                        "CurrentYear": {
                                            "val": "304.408"
                                        },
                                        "BudgetYearOne": {
                                            "val": "275.546"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "242.514"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "33.032"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "273.518"
                                        },
                                        "BudgetYearThree": {
                                            "val": "283.944"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Theater Net-Centric Geolocation TNG"
                                    },
                                    "Title": {
                                        "val": "Theater Net-Centric Geolocation (TNG) RDTE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.350"
                                        },
                                        "CurrentYear": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.410"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.606"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "1.698"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "DCGS-A Increment 2 is an ACAT IAM, Major Automated Information System (MAIS) program entering Milestone B decision for the Engineering and Manufacturing Development (EMD) acquisition phase. The DCGS-A Increment 2 program will consist of multiple software releases structured to meet DCGS-A Increment 2 Requirements Definition Package (RDP) requirements. These releases will be referred to as DCGS-A Increment 2, Releases 1, 2, etc. as defined by the Army Requirements Oversight Council (AROC) Process Review Board (APRB).  The APRB will identify the capabilities associated with each release in a Capability Drop (CD) document.  The DCGS-A Increment 2 program will follow the Information Technology (IT) Box concept for an agile acquisition strategy to iteratively develop and field Intelligence, Surveillance, and Reconnaissance (ISR) capabilities, hosted on Commercial off the Shelf (COTS) equipment\/hardware, providing a low risk, efficient, time-phased releases of capability to satisfy the Army’s operational needs.  \n\nThe DCGS-A capabilities developed under Increment 1 will be leveraged to the maximum extent where applicable to meet the Increment 2 requirements set.  The DCGS-A Increment 2 will also leverage the Increment 1 configuration platforms fielded across the Army.\n\nDCGS-A Increment 2 is a collection of software packages (developmental, COTS, and GOTS products) selected to provide each Army echelon (from Battalion up to Echelon Above Corps (EAC)) the capability to synthesize and exploit intelligence data.  DCGS-A Increment 2 delivers these software packages on COTS and GOTS hardware components, tailored to meet each Army Echelon’s intelligence mission requirements. DCGS-A Increment 2 will deliver these capabilities by fielding software releases with incremental increases in capabilities with each release.  DCGS-A Increment 2 is the Army's ISR Foundation Layer for Tasking, Processing, Exploitation, Dissemination (TPED) and development of situation understanding using intelligence information about the threat, weather, and terrain at all Army Echelons. DCGS-A Increment 2 provides the capabilities necessary for Commanders to access information, task organic sensors, and synchronize non-organic sensor assets with their organic assets. DCGS-A Increment 2 will continuously acquire and synthesize data and information from Joint, Interagency, Intergovernmental, and Multi-national (JIIM) sources to maintain an updated and accurate understanding of the operational environment to inform critical and time sensitive command decisions.\n\nThe DCGS-A Increment 2 software baseline will be updated and fielded every 24-36 months to address emerging and prioritized operational requirements as approved by the APRB.  PM DCGS-A, in coordination with the operational user community, chose the 24-36 month release time phasing to align releases with the technological readiness of targeted enhancements, and to support low-risk development and test cycle times in accordance with an agile acquisition approach. The time phasing of planned content of each release will be based upon an assessment of available and projected technological solution sets; this assessment will result in the approach to complete additional releases beyond Release 1 of Initial Minimum Capability (IMC) to satisfy the entire DCGS-A Increment 2 RDP.  The DCGS-A Increment 2 software design will be hardware agnostic that the software is virtualized and can be deployed in any processing hardware equipment.  This allows the DCGS-A Increment 2 software to be scalable and deployable in different hardware system configurations, as required by the Army at different echelons.  The implementation of the Virtual Machine technology also allows leveraging of the latest COTS hardware server technology and procurement through the Army Common Hardware System (CHS) program with the established post-deployment hardware sparing, sustainment, and maintenance provisions, resulting in significant cost efficiencies."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.054"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.136"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.641"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.641"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Milestone preparation; Activities; Trade Space Analysis (TSA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.318"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.318"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Design & Develop DCGS-A Inc 2 software"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.836"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.085"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "27.791"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "27.791"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System reconfiguration\/redesign"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.720"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Matrix Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.657"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.148"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.131"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.131"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Training Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.316"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.316"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Logistics Documentation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.405"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.405"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Test & Integration Lab"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98191-78.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Acquisition Requirements Package Dev, Source Selection, & Risk Reduction Inc 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development and Test Inc 2 Rel 1 Software"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development and Test Inc 2 Rel 2 Software"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Operational Test Inc 2 Rel 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 2 MDD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development RFP Release Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RFP Release Increment 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development Contract Award Increment 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding Inc 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}