{
    "id": "9b61e9c12474ff9941b0c6a0f85e30701f31922f",
    "meta": {
        "filename": "dod-2017_RDTE_2017_DLA_U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603712S"
        },
        "ProgramElementTitle": {
            "val": "Logistics Research and Development Technology (Log R&D)"
        },
        "R1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "82.806"
            },
            "PriorYear": {
                "val": "22.224"
            },
            "CurrentYear": {
                "val": "15.537"
            },
            "BudgetYearOne": {
                "val": "11.011"
            },
            "BudgetYearOneBase": {
                "val": "11.011"
            },
            "BudgetYearTwo": {
                "val": "11.230"
            },
            "BudgetYearThree": {
                "val": "11.520"
            },
            "BudgetYearFour": {
                "val": "11.834"
            },
            "BudgetYearFive": {
                "val": "12.133"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Logistics Agency is responsible for providing to the Military Services, and other Federal Agencies, as well as combined and allied forces the full spectrum of logistics, acquisition and technical services. DLA sources and provides nearly 100 percent of the consumable items the military forces need to operate – including food, fuel and energy, uniforms, medical supplies as well as construction and barrier equipment. DLA supplies more than 85 percent of the military’s spare parts, provides logistics information data and products, manages the reutilization of military equipment, and offers document automation and production services. DLAs Research and Development (R&D) program helps ensure that advanced logistics concepts and business processes are available in order to accomplish the agency’s mission with the leanest possible infrastructure, using the best commercial and government sources and applying most effective business processes. The Logistics R&D program develops and demonstrates high risk, high payoff technology that provides a significantly higher level of support at lower costs than would be otherwise attainable. The program has a proven track record of implementation and benefits. \n\nIn December 2013, the DLA Director called for greater flexibility within the R&D program in support of the agency’s efforts to achieve its mission. As a result, the R&D program is evolving from single supply chain efforts to Strategic Focus Areas (SFAs). The SFAs will support DLA’s efforts to make the improvements needed to maintain mission readiness rates in a constrained budget environment. \n\nThe three Strategic Focus Areas were renamed in FY 17-FY 21 to more clearly capture their focus and scope:  \n\n1. Enhancing Analysis, Modeling, and Decision Support (formerly Analytic and Decision Support): R&D efforts to develop decision support tools, such as modeling, simulation, and other analytics to improve operational strategy decision-making, forecasting, and procurement, which support more effective and efficient responses to emerging market and customer requirements.\n2. Improving Logistics Processes (formerly Logistics Processes): R&D efforts to develop and implement advanced technology in logistics processes over and above current baseline systems.\n3. Emergent Logistics R&D Requirements (formerly Innovative Products and Services for Customers): R&D Efforts to support emergent Logistics R&D requirements that arise out of the budget cycle. These out of cycle requirements always occur.  The SFA begins new projects in a timely manner without disrupting ongoing projects by funds reallocation.  This SFA includes all DLA supply chains and logistics processes."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.836"
                },
                "CurrentYear": {
                    "val": "16.543"
                },
                "BudgetYearOne": {
                    "val": "16.949"
                },
                "BudgetYearOneBase": {
                    "val": "16.949"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "22.224"
                },
                "CurrentYear": {
                    "val": "15.537"
                },
                "BudgetYearOne": {
                    "val": "11.011"
                },
                "BudgetYearOneBase": {
                    "val": "11.011"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "5.388"
                },
                "CurrentYear": {
                    "val": "-1.006"
                },
                "BudgetYearOne": {
                    "val": "-5.938"
                },
                "BudgetYearOneBase": {
                    "val": "-5.938"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-1.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.005"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "4.500"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.485"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.592"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY17 Fund Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.646"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.646"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.006"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "AT&L Top-Line Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.200"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.200"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation for Non-Pay\/Non-Fuel purchases"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.092"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.092"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "During FY 2017 – FY 2021  funds were realigned from PE LOG R&D (0603712S) to the Industrial Preparedness – Manufacturing Technology Program (PE 0708011S). This realignment was needed to accommodate high priority requirements within DLA to improve the industrial base that supports critical weapon systems. In FY17, $4.646M was realigned from LOG R&D to MANTECH for these high priority requirements. \n\nThe consequences to the realignment include: The Medical On-Demand Business Analytics (ODBA) capability will be delayed depriving DLA end-users the ability to easily access and navigate the data from a single interface without requiring the knowledge of database access language (SQL). The Supply Chain management project reductions means additional anti-counterfeiting technology will not be fully developed and implemented, increasing the risk that counterfeit parts will enter the DOD supply system. Reductions to the Energy readiness program mean cost increases to the Services for fuel because fewer alternative fuel additives will be available. Modeling and Simulation tools will not be available for DLA to optimize operations and logistics processes."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Medical Logistics Network (MLN)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.382"
                        },
                        "PriorYear": {
                            "val": "1.952"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "FY2016-FY2020 funding for this effort is split and realigned to Strategic Focus Areas #7, Analytic and Decision Support, and #8, Logistics Processes, depending on the nature of the specific R&D activity being performed.  \n\nThe Medical Logistics Network (MLN)  program supports the Medical Directorate’s mission to develop and implement the critical logistics and medical supply chain business practices that ensure the cost-effective and efficient distribution of medical materiel to the full range of Military Health System operations.\n\nThe Medical Logistics Network (MLN) program anticipates future medical logistical requirements and develops strategies and tools to meet these requirements.  Operating in the unique DoD-Commercial medical logistics environment, the Medical Logistics Network program develops processes for management of DoD Medical Logistics to ensure effective and safe medical supplies support the warfighter. These business process improvements may have potential extensions to other supply chains."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical Logistics Network Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.952"
                                            },
                                            "Text": {
                                                "val": "In FY2015 work continued on the On-Demand Business Analytics (ODBA) project, the Fair and Reasonable Evaluation (FRE) project, and the Clinical Standardization project. Additionally, Advancing Cold Chain Management (ACCM) executed a sub-project in FY2015.\n\nMLN Success: The Trade Agreement Act (TAA) requires the Government to acquire end-products which are Manufactured or Substantially Transformed in either the U.S. or a Qualifying or Designated Country, unless there are no offers of such end-products or the offers of such end- products are insufficient to fulfill the Government’s requirements. In FY2015 MLN undertook the development of an improved and comprehensive web based custom software solution to automate and support the TAA Compliance Management business function of Customer Pharmacy Operations Center (CPOC) team."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts related to MLN have been moved to the Analytic and Decision Support (A&DS) and Logistics Processes Strategic Focus Areas. \n\nOn-Demand Business Analytics (ODBA), in year 3 of 3, is planned to transition in FY2016. \n\nAdditionally, the Medical Object Oriented Data Sustainment (MOODS) Project will be initiated in FY2016. MOODS will improve processes and tools to sustain Joint Task-Time-Treater (JTTF) data which will be used by military services to create medical supply forecasts that are based on expected patient treatments. The JTTF helps to define supplies and equipment to treat a population at risk in terms of specific medical conditions.  The current processes to sustain JTTF are extremely complex, improvement will help to optimize the standard of care that Warfighters receive."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The On-Demand Business Analytics (ODBA) project was competitively bid as a task order on the Defense Logistics Standard Support Blanket Purchase Agreement (DMLSS-W BPA).  All new project execution work is being solicited through the DLA R&D Emergent Requirements 2 Broad Agency Announcement (BAA)."
                        },
                        "PerformanceMetrics": {
                            "val": "Defense Medical Logistics Transformation (DMLT):  1) The percentage of requirements supported by architecture products – 100% of the MedSurg Prime Vendor Program’s Gen IV Requirements were supported by architecture products.  2) Measurement of compliance with laws and regulations (e.g. Clinger-Cohen Act) that require complete enterprise architecture- 93.0% of required products passed first certification review (based on MS-B and CDR)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2"
                    },
                    "ProjectTitle": {
                        "val": "Weapon System Sustainment (WSS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "23.991"
                        },
                        "PriorYear": {
                            "val": "5.634"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "FY2016-FY2020 funding for this effort is split and realigned to Strategic Focus Areas #7, Analytic and Decision Support, and #8, Logistics Processes, depending on the nature of the specific R&D being performed.  \n\nSupport Defense Logistics Agency (DLA) Strategic Plans Goals 1.)  Warfighter Support) and 2.)  Stewardship Excellence.  The program spans multiple weapon systems and supply chains to improve internal processes, provide new methods, reduce costs and lead times, and ultimately, improve readiness for DLA customers.  \n\nThe program is focused in three initiatives:\n1.)  Planning Process Improvement:  The program improves elements of current inventory policy models, assesses potential benefits of new technologies and seeks more efficient approaches to deliver customer requirements while reducing inventory and order fulfillment costs.  \n\n2.)  Technical\/Quality Process Improvement:  The program improves internal efficiency and customer satisfaction through new tools and methods to proactively address supply issues resulting from current technical\/quality processes.  \n\n3.)  Procurement Process Improvement:  The program will demonstrate tailored data collection and business processes for well-defined subsets of suppliers and procurement types to improve supplier responsiveness, cycle time and cost."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Weapon System Sustainment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.634"
                                            },
                                            "Text": {
                                                "val": "Planning Process Improvements: The Supplier Initiated Orders (SIO) project was completed and transitioned to DLA Aviation, which is using the SIO method with Boeing and GE.  Substantial cost reductions and improved performance are being realized.  Transition to other Aviation weapon systems is on hold until DLA J6 resources are available to move forward with the implementation of the SIO automated workflow. The FINISIM, Returns and Peak\/Next Gen enhancements projects were completed and transition efforts started by J343.  Peak\/Next Gen is being used to set inventory levels for more than 500,000  items, and continues to allow PLFAs to meet stringent Material Availability goals.  A project was initiated to improve the accuracy of PLT estimates which will improve support to warfighters and reduce overstocking. A project was initiated to pilot the use of Vendor Owned Inventory, a commercial practice known to reduce costs through more effective inventory management. A new project will develop techniques to link parts in indentured bills of materials to Service maintenance and parts usage data, and use modeling and simulation to provide a better estimate of demand for those parts.  A Weapon System Demand Mapping project was established to link sales, orders and requisition information to the weapon system the ordered items are used on, which will enable improved collaboration among DLA, its suppliers and its customers. Collaborative efforts were continued with the Planning team to develop new projects for FY 2016 awards. \n\nTechnical\/Quality Process Improvements: Three new projects were started in FY 2015. Technical Data Availability will initiate an  attack on the problem of lengthy delays in determining if technical data is current by assessing Services’ systems for configuration          management could be automatically accessed by EBS or some other method. As part of DLA’s initiative in Additive Manufacturing\n(AM), a project was awarded to take parts from identification of applicability through final approval by the appropriate Service, which will clarify the issues associated with obtaining Service approvals and identify some approaches to resolving those issues. The Cost of Quality in Procurement project will identify and document the specific contractor\/bidder characteristics that distinguish the need for oversight, the appropriate oversight actions, and the associated cost of performing the actions. Collaborative efforts were continued with the Technical\/Quality team to develop new projects for FY 2016 awards.\n\nProcurement Process Improvements: The Performance-Based Logistics (PBL) Process Improvement project provided recommendations to DLA senior leadership for how to improve DLA’s use of PBL in its operations. A project was initiated to determine the issues and potential benefits of moving PBL storage and distribution functions from commercial sites to DLA Distribution Centers. A project was awarded to develop improvements to the automated bid evaluation process to reduce the number of manual reviews in order to reduce cost of DLA’s operations and reduce the time to award purchase orders.  Collaborative efforts were continued with the Procurement Process Owner and his team to develop new projects for FY 2016 awards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Funding and efforts related to Weapon Systems Sustainment transferred to Analytic and Decision Support and Logistics Processes."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A competitive BAA was issued and awarded in FY 14.  Delivery orders will be placed against the contract."
                        },
                        "PerformanceMetrics": {
                            "val": "The WSS program supports the Director’s strategic goals of Warfighter First, Strategic Engagement, Financial Stewardship and Process Excellence.  Projects completed in FY2015 reduced material costs, improved the efficiency of the Material Returns process, reduced backorders, and reduced procurement workload.\n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3"
                    },
                    "ProjectTitle": {
                        "val": "Supply Chain Management (SCM)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.844"
                        },
                        "PriorYear": {
                            "val": "5.730"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DLA operates in a very dynamic environment.  To meet customer expectations DLA must be able to address problems in a timely manner and be able to respond to emerging opportunities.  The Supply Chain Management Program within R&D provides the Agency with the resources needed to quickly take advantage of new ideas emerging from the Center Commanders, Process Owners, or Staff Directors."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Supply Chain Management Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.730"
                                            },
                                            "Text": {
                                                "val": "During FY2015 Supply Chain Management will invest in the technologies to implement advanced Supply Chain Management techniques into DLA’s Supply Chains.  DLA is expecting to reduce the production lead-time needed to produce critical DLA Land and Maritime items. Supply Chain Management initiated an out of cycle requirement to assure the supply of critical carbon fiber for strategic systems and new starts in additive manufacturing.  \n\nR&D awarded Strategic Materials R&D projects on DLA’s Emerging R&D Requirements BAA for critical initial manufacturing technology requirements in domestic high strength carbon fiber material testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Funding and effort related to Supply Chain Management transferred to Innovative Products and Services for Customers"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects are awarded following competitive Broad Agency Announcement acquisition processes and delivery orders against competitively awarded IDIQ contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "SCM is measured on the ability to meet emerging needs that occur out of phase with the budget cycle.  \n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "4"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Distribution & Disposition (SDD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "17.345"
                        },
                        "PriorYear": {
                            "val": "2.051"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program improves DLA’s distribution and disposition capabilities, operational effectiveness, and efficiency in support of the Services, COCOMs, and DOD in CONUS, OCONUS, and deployed locations. Its long-range objectives include but are not limited to: 1) Continued improvement and integration of DLA, TRANSCOM, and Joint Service logistics planning, visibility, and Command and Control (C2) capabilities for military and humanitarian deployments; 2) Development and integration of advanced deployable distribution and disposition capabilities, reducing DLA’s expeditionary footprint while improving Warfighter support and resource stewardship;\n3) Improvements to DLA Distribution centers and DLA Disposition Services through insertion of state-of-the-art technologies, including intelligent material handling equipment, communications, and workload forecasting tools; 4) Distribution and Disposition workforce developments through advanced training methods and technologies; and 5) Intelligent end-to-end supply chain management from DLA’s inventory control points, through its distribution centers to customers' and back to DLA Disposition for final disposition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Distribution & Disposition (SDD) Accomplishments \/ Planned Program"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.051"
                                            },
                                            "Text": {
                                                "val": "Completed a DEMIL “C” vehicle sales project culminating in a Business Case Analysis (BCA) that identified three models of HMMWV suitable for public sale after DEMIL. Courses of action are anticipated to yield up to $155.9M in vehicle sales.\n\nBegan work on Distribution Automation\/Robotics Project designed to improve warehouse performance by incorporating cutting- edge technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts related to the SDD Program have been moved to the Enhancing Analysis, Modeling, and Decision Support and Improving Logistics Processes Strategic Focus Areas (SFA)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "SDD improves DLA distribution and disposition capabilities. At least 30% of the completed projects will transition. OSD-C financial metrics (obligation and disbursement) will be achieved.\n\nSDD Analytic and Decision Support (A&DS): planned technical performance metrics include completed CAD 2D\/3D modeling and simulation analyses of the layout\/design of the EDC in New Cumberland, PA, and a completed Feasibility Study\/BCA to determine the need, location, resources, and equipment requirements for a DLA Disposition Customer Kiosk prototype.\n\nSDD Logistics Processes (LP): planned technical performance metrics include a completed survey of technology (report) identifying technology applicable to DLA’s warehouse and distribution operations and leveraging Logistics R&D to test commercial applications via the Warehouse Automation and Robotics Exploratory Project (WAREP).\n\nAdditionally, SDD will test and document new methodologies and technologies for maintaining DLA Distribution batteries and decreasing battery corrosion due to sulfation. Performance metrics include completed and documented methodologies and test plans as well as completed test results (reports)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "5"
                    },
                    "ProjectTitle": {
                        "val": "Energy Readiness Program (ERP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.735"
                        },
                        "PriorYear": {
                            "val": "5.061"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Program Management Office Support (PMO) for developing program strategies and goals, preparing documentation for the program, and performing quick reaction studies, including Congressionally Mandated Studies (CMS) and analysis.  Alternate Energy Development (AED) to include test and certification to support the addition of synthetic and alternative fuels to mobility fuel specifications and acquisition plan; renewable fuels studies and planning; continued study of directives related to the implementation of alternative fuels and renewable energy.  Improving Class IIIB supply chain through Current Product Improvement (CPI) (such as the study and development of fuel additives and studies to increase sources of supply) and Infrastructure & Process Improvement (such as the development of analytical tools)."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Innovative industrial practices for the co-production of fuels, chemicals, and wood fiber products to meet DoD bulk fuel requirements"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Needs to be updated"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Energy Readiness Program (ERP) Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.061"
                                            },
                                            "Text": {
                                                "val": "Continued PMO support in program implementation and planning. Continued support of alternative\/renewable energy solution study, test, and demonstration. Continued support Class IIIB supply chain through product improvement to increase sources, improve quality, and reduce cost. Continue to support infrastructure & process improvements.\n\nProjects successfully completed projects during FY 15 included “Field Evaluation of Automatic Particle Counters for Aviation Fuels” and “Characterization of Light Cycle Oil Contaminants in Fuels”, both of which have yielded results which will enhance DLA Energy’s capabilities in delivering quality on-spec fuel products to the services and significantly decrease instances of product failures, replacements and military services equipment maintenance efforts which result in mission delays or failures.  Transitioning of the results of these project efforts into DLA and DoD specifications, standards and quality surveillance\/assurance procedures is currently ongoing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts funding related to Energy Readiness have been moved to the Innovative Products and Services for Customers Strategic Focus area. Continued PMO support in program implementation and planning. Continued support of alternative\/renewable energy solution study, test, and demonstration.  Continued support Class IIIB supply chain through product improvement to increase sources, improve quality, and reduce cost. Continue to support infrastructure & process improvements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "At least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved.\n\nTechnical Achievements: 1. Development of improved test methods for the detection of unstable light cycle oil contaminants in jet fuels; 2. Development of improved test methods to determine the long-term storage stability of diesels fuels per MILSPEC requirements; 3. Development of acceptable lubricity limits\/requirements for jet fuels derived from alternative (non-petroleum) sources)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "6"
                    },
                    "ProjectTitle": {
                        "val": "Defense Logistics Information Research (DLIR)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.509"
                        },
                        "PriorYear": {
                            "val": "1.796"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "FY2016-FY2020 funding for DLIR have been reprogrammed to the DLA Manufacturing Technology Program (P.E. 0708011S). This change will better align the technical work with the OSD Manufacturing Technology Program initiative for the Model Based Enterprise (MBE). The MBE will help DOD move to a completely digital environment for design and engineering data needed to conceive, design, build and support weapon systems.\n\nThe Defense Logistics Information Research (DLIR) program objective is to research, identify, and implement potential or existing technologies using high-risk, high payoff tools, methods, techniques, and products. The DLIR program partners with commercial industry to perform short-term projects (STPs) in various logistics business areas which align with the DLA strategic vision. DLIR improves functional and business processes using the latest technologies available to support the nation’s warfighter. The technical areas of interest is the development of Logistics Data Interoperability & Availability. Enhances the functionality and compatibility of data in a complex data environment using supply chain relationships and lifecycle management to allow flexible visibility.\n\nDLIR is working several short term projects in the area of interest. These efforts are positioning DLA to move towards a model-based enterprise (MBE), using and acquiring 3-Dimensional model-based data instead of 2-Dimensional hardcopy for weapon system sustainment and support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Logistics Information Research (DLIR) Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.796"
                                            },
                                            "Text": {
                                                "val": "Completed the concept of operations (CONOPS) for using Model based technical data in Procurement.  Develop automated tools and methodologies to store and deliver 3 Dimensional model data to customers so they can use Additive Manufacturing to make the part. The goal is that DLA will store, stock, and ship the model, not the part."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts related to DLIR have been moved to the Industry and Customer Collaboration Strategic Focus Area.  P.E. 0708011S"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts related to DLIR have been moved to the Industry and Customer Collaboration Strategic Focus Area.  P.E. 0708011S"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "\" Transition may include two scenarios:\n1) Transition applications behind the J6 firewall IAW the J6 Front door process.\n2) Transition applications as a contractor hosted web based  Software as a Service model \"\n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "7"
                    },
                    "ProjectTitle": {
                        "val": "Enhancing Analysis, Modeling, and Decision Support (formerly Analytic & Decision Support)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.423"
                        },
                        "BudgetYearOne": {
                            "val": "2.371"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.371"
                        },
                        "BudgetYearTwo": {
                            "val": "2.617"
                        },
                        "BudgetYearThree": {
                            "val": "2.681"
                        },
                        "BudgetYearFour": {
                            "val": "2.750"
                        },
                        "BudgetYearFive": {
                            "val": "2.818"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "R&D efforts undertaken to develop and implement advanced analytical tools, modeling, and simulation of logistics and supply chain processes.  These tools will improve DLA forecasting and procurement strategy decisions and lead to faster and more flexible response to emerging market and customer requirements. Currently there are three major analytical thrusts: Planning Processes, Medical Supply Chain, and Distribution\/Disposition.  Planning processes model and simulate item and customer demand patterns to improve customer support, lower inventories, acquisition costs, and acquisition lead-times for hardware (Class IX items).  Medical Supply Chain Modeling will provide DLA the capability to integrate DLA logistics data and commercial data with satellite and political maps; it will automate for DLA Medical planners the ability to identify entities such as suppliers, customers and vendor distribution centers to enhance spatial awareness of incidents such as catastrophic events and military contingencies.  The Distribution\/Disposition thrust will develop and implement analytical tools, models, and simulations of logistics and supply chain processes related to distribution and disposition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhancing Analysis, Modeling, and Decision Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "New start in FY 16"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.423"
                                            },
                                            "Text": {
                                                "val": "Planning Process will focus on initial capabilities of supply chain risk management, examine the potential benefits of alternative ownership strategies for inventory and address ways to improve collaboration among DLA, its suppliers and its customers for more effective inventory management.  \n\nMedical Supply Chain will transition the On-Demand Business Analytics (ODBA) capability.\n\nStrategic Distribution and Disposition (SDD) will conduct a current state simulation of DLA’s East Coast Distribution Center (EDC). The current state simulation will be compared to new potential redesigns of the EDC. The most promising new designs will be simulated and compared to the current state for labor savings, reduction in fulfillment time\/cycle, and reduction of Material Handling Equipment (MHE).\n\nSDD will also complete Phase I of the Warehouse Automation and Robotics Exploratory Project and provide an initial ROM BCA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.371"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.371"
                                            },
                                            "Text": {
                                                "val": "MLN will transition the Clinical Standardization application to sustainment. A new project in Medical 3D Printing could be undertaken this year.\n\nPlanning Process will focus on initial capabilities of Supply chain risk management, examine the potential benefits of alternative ownership strategies for inventory and address ways to improve collaboration among DLA, its suppliers and its customers for more effective inventory management. Collaborative efforts will be continued with the Planning Process Owner and his team to develop new projects for FY 2017 awards.\n\nStrategic Distribution and Disposition (SDD) will update the Warehouse Automation and Robotics BCA to include results of the East Coast Distribution Center (EDC) study. Additionally, SDD will assist in the economic analysis of new Lithium-Ion battery technology."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Delivery orders will be issued against competitively awarded contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "At least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved.\n\nAdditional and planned A&DS technical achievements include:\n\nWSS -\nImprovements in the planning processes for DLA managed items, more accurate estimates of the cost of medical material and improvements will be made in DLA’s capability to plan for contingencies.  Improvements in the planning process focus on objectives in the Director’s Strategic Goals of Warfighter First (Objective 1:  anticipate, assess and meet current and future Warfighter requirements) and Strategic Engagement (Objective 1:  collaborate with providers to incentivize productivity and innovation, eliminate unproductive business processes, and address industrial base vulnerabilities).\n\nSDD -\nPlanned technical performance metrics include completed CAD 2D\/3D modeling and simulation analyses of the layout\/design of the EDC in New Cumberland, PA, and a completed Feasibility Study\/BCA to determine the need, location, resources, and equipment requirements for a DLA Disposition Customer Kiosk prototype. Additionally, SDD will assist in the economic analysis of new Lithium-Ion battery technology.\n\nMLN - \nImproved data access and navigation abilities from a single interface without requiring the knowledge of database access language (SQL) - ODBA.\n\nDeveloping applications to effectively identify new contracting\/sourcing opportunities for medical products based upon best-value criteria such as price, market share, and clinical attributes - Clinical Standardization."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "8"
                    },
                    "ProjectTitle": {
                        "val": "Improving Logistics Processes (formerly Logistics Process)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "7.042"
                        },
                        "BudgetYearOne": {
                            "val": "5.236"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.236"
                        },
                        "BudgetYearTwo": {
                            "val": "5.757"
                        },
                        "BudgetYearThree": {
                            "val": "5.901"
                        },
                        "BudgetYearFour": {
                            "val": "6.051"
                        },
                        "BudgetYearFive": {
                            "val": "6.201"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Logistics Processes are R&D efforts undertaken to develop and implement advanced technology in the internal DLA logistics processes. To qualify for R&D funding, the R&D effort must develop and apply technology and processes over and above current baseline IT systems and continuous improvements efforts. \nThis strategic focus area has 4 thrusts: Technical\/Quality Process Improvements, Selected Process Improvements, Medical Processes, and Distribution\/Disposition Processes.  \n\nT\/Q process improvements to reduce material and internal costs and improve support to warfighters.  Services have engineering responsibility for most Class IX parts. Many T\/Q sub-processes involve interactions with Service engineering functions, which often are time-consuming and costly.  Other key T\/Q sub-processes are essential to the procurement function, such as analysis of parts content, source capabilities and problem resolution.\n\nSelected process improvements cover processes outside the scope of the Technical\/Quality (T\/Q) function. Although all DLA processes are in scope, the focus for FY 2016 is on the Procurement process, especially aspects driving internal costs and delays in awards.\n\nMedical Processes will expand work in critical mechanisms to guarantee product quality of temperature-sensitive medical materiel distributed to our customers, and identify the most efficient and cost-effective means to deliver those medical products in accordance with FDA-labeled and other regulatory requirements.  \n\nDistribution and Disposition logistics processes deal with improving distribution and disposition capabilities, operational effectiveness, and efficiency. While numerous technologies and applications have been developed and exploited, DLA has not kept pace with the commercial industry in regards to modernizing its technology systems infrastructure, processes, or mobilizing information for personnel, customers, and processes."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Logistics Processes (LP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "New Start in FY 16"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.042"
                                            },
                                            "Text": {
                                                "val": "T\/Q efforts will include transition of the Quality cost, organic manufacturing process and Critical Application item projects initiated in FY 15.  In addition, a new effort will begin in expanding DNA Marking and developing methods to guard against malicious code entering the supply system through acquired items.  \n\nSelected Process initiatives for FY 16 in the T\/Q area include Cost of Quality in Procurement, Technical Data Availability, processes for Service approval of substituting Additive Manufacturing for selected parts, develop and demonstrate and approach to making information systems containing data on chemical content of parts interoperable to aid in identifying material risk, and creation of a decision support tool to identify problematic parts procurement much earlier.Initiatives in the Procurement area include Reducing Manual Reviews to cut cost and time, Proactive No-Bid Modeling to reduce time to award and improve support to warfighters, and eCommerce to cut internal and parts costs and reduce Production Lead Time.\n\nMedical Processes will continue to execute projects that support Advancing Cold Chain Management (ACCM).\n \nThe Distribution and Disposition initiative will leverage emerging distribution and disposal technologies and state of the art reverse logistics. One promising new project is the DLA Disposition Customer Kiosk. The project will explore the feasibility of using self-service unmanned kiosk type collection points to improve efficiency, and eliminate and\/or reduce appointment wait times for customers that use this new service, thereby creating just-in-time disposition services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.236"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.236"
                                            },
                                            "Text": {
                                                "val": "Medical Processes will continue to execute projects that support Advancing Cold Chain Management (ACCM). Additionally, a new project in Medical 3D Printing could be undertaken this year.\n\nT\/Q efforts will include transition of the Cost of Quality in Procurement and Agile Logistics for Acquisition and Regulated Materials Projects initiated in FY 15 and FY16, respectively.  In addition, a new effort will begin in developing methods to guard against malicious code entering the supply system through acquired items.  Additional new projects will be awarded as a result of collaborative planning efforts during FY16.  Collaborative efforts will be continued with the Procurement and T\/Q Process Owners and their teams to develop new projects for FY 2016 awards.\n\nStrategic Distribution and Disposition (SDD) will continue beta testing commercial automation and robotics applications as approved by DLA Distribution."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "At least 30% of the completed projects will transition. OSD-C financial metrics (obligation and disbursement) will be achieved. Additional technical achievements will include providing extreme ambient profiles for selected shipping lanes to assist in the thermal design of temperature controlled systems.\n\nWSS -\nT\/Q and Procurement process improvement projects focus on objectives in the Director’s Strategic Goals of Financial Stewardship (Objective 4: reduce overall DLA operation and maintenance  costs) and Process Excellence (Objective 2: implement and integrate end-to-end process management to optimize enterprise initiatives.\n\nSDD -\nPlanned technical performance metrics include a completed survey of technology (report) identifying technology applicable to DLA’s warehouse and distribution operations and leveraging Logistics R&D to test commercial applications via the Warehouse Automation and Robotics Exploratory Project (WAREP). \n\nAdditionally, SDD will test and document new methodologies and technologies for maintaining DLA Distribution batteries and decreasing battery corrosion due to sulfation. Performance metrics include completed and documented methodologies and test plans as well as completed test results (reports).\n \nMLN -"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9"
                    },
                    "ProjectTitle": {
                        "val": "Emergent Logistics R&D Requirements (formerly Innovative Products & Services for DLA Customers)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "5.072"
                        },
                        "BudgetYearOne": {
                            "val": "3.404"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.404"
                        },
                        "BudgetYearTwo": {
                            "val": "2.856"
                        },
                        "BudgetYearThree": {
                            "val": "2.938"
                        },
                        "BudgetYearFour": {
                            "val": "3.033"
                        },
                        "BudgetYearFive": {
                            "val": "3.114"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Innovative Products and Services for Customers Strategic Focus Area includes R&D efforts to develop new products and services for DLA customers.  The Energy Roadmap helps to achieve the operational energy strategy goals of increasing sources of supply, developing and implementing alternative fuels.  The Supply Chain Management Roadmap addresses emerging and out of cycle requirements that always occur and new products and services developed by DLA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Emergent Logistics R&D Requirements"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "New start in FY 16"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.072"
                                            },
                                            "Text": {
                                                "val": "Supply Chain Management addresses the emerging technology opportunities that occur out of the budget cycle.  This allows DLA to get a head start undertaking new technological advances without disrupting ongoing programs.  In the past DLA R&D has been able to cut 12 to 24 months off the project starting lead-times.  Saving the lead-time allows the Agency to begin to realize the benefits of implementing new technology sooner than would otherwise be the case and maintain continuity of funding and activity for baseline programs. \n\nEnergy Readiness will focus on providing additional alternatives for military unique fuels, working with the Service customers to improve specifications and standards for fuel quality, engage in modeling and simulation of the energy supply chain and identifying alternative energy sources for Military Customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.404"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.404"
                                            },
                                            "Text": {
                                                "val": "Supply Chain Management addresses the emerging technology opportunities that occur out of the budget cycle.  This allows DLA to get a head start undertaking new technological advances without disrupting ongoing programs.  In the past DLA R&D has been able to cut 12 to 24 months off the project starting lead-times.  Saving the lead-time allows the Agency to begin to realize the benefits of implementing new technology sooner than would otherwise be the case and maintain continuity of funding and activity for baseline programs.\n\nAdditional targeted requirements will be determined with DLA Strategic Materials. Targeted requests for proposals will be conducted to address specific needs and opportunities to ensure that critical strategic materials are available from domestic sources and that process innovations are in place to efficiently produce strategic materials. Manufacturing technologies and capabilities are expected to transition to Title III or specific Weapon System Program funds for industrial base qualification. Funding will be reallocated based on project requirements and reclassified into the Strategic Material Thrust.\n\nEnergy Readiness will continue to focus on providing additional alternatives for military unique fuels, working with the Service customers to improve specifications and standards for fuel quality, engage in modeling and simulation of the energy supply chain and identifying alternative energy sources for Military Customers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive awards against a DLA BAA or Delivery Orders against MILSVC IDIQ contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "Implementing new fuel supply technology into the industrial base and meeting emerging requirements and opportunities for logistics technologies that will provide better support to the DLA mission.  \n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                }
            ]
        }
    }
}