{
    "id": "9dfad17910c64dcb6678318b9315db6a0298440c",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA1_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601104A"
        },
        "ProgramElementTitle": {
            "val": "University and Industry Research Centers"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "105.766"
            },
            "CurrentYear": {
                "val": "104.340"
            },
            "BudgetYearOne": {
                "val": "94.280"
            },
            "BudgetYearOneBase": {
                "val": "94.280"
            },
            "BudgetYearTwo": {
                "val": "94.903"
            },
            "BudgetYearThree": {
                "val": "98.297"
            },
            "BudgetYearFour": {
                "val": "98.660"
            },
            "BudgetYearFive": {
                "val": "100.589"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) fosters university and industry based research to provide a scientific foundation for enabling technologies for future force capabilities.  Broadly, the work in this PE falls into three categories: Collaborative Technology Alliances \/ Collaborative Research Alliances (CTAs\/CRAs), University Centers of Excellence (COE), and University Affiliated Research Centers (UARCs).  The Army formed CTAs to leverage large investments by the commercial sector in basic research areas that are of great interest to the Army.  CTAs are industry-led partnerships between industry, academia, and the Army Research Laboratory (ARL) to incorporate the practicality of industry, the expansion of the boundaries of knowledge from universities, and Army scientists to shape, mature, and transition technology relevant to the Army mission.  CTAs have been competitively established in the areas of Micro Autonomous Systems Technology (MAST), Network Sciences, Robotics, and Cognition and Neuroergonomics. CRAs are academia-led partnerships, which leverage the cutting-edge innovation found in the academic environment.  CRAs have been established in the areas of Multi-Scale Materials Modeling (electronic materials and materials in extreme environments) and in cyber security.  The COEs focus on expanding the frontiers of knowledge in research areas where the Army has enduring needs, and couples state-of-the-art research programs at academic institutions with broad-based graduate education programs to increase the supply of scientists and engineers in automotive and rotary wing technology.  Also included are Army Educational Outreach Program (AEOP) and activities to stimulate interest in science, math, and technology among middle and high school students.  This PE includes support for basic research at three Army UARCs, which have been created to exploit opportunities to advance new capabilities through a sustained long-term multidisciplinary effort.  The Institute for Soldier Nanotechnologies focuses on Soldier protection by emphasizing revolutionary materials research for advanced Soldier protection and survivability.  The Institute for Collaborative Biotechnologies focuses on enabling network centric-technologies, and broadening the Army's use of biotechnology for the development of bio-inspired materials, sensors, and information processing.  The Institute for Creative Technologies is a partnership with academia and the entertainment and gaming industries to leverage innovative research and concepts for training and simulation.  Examples of specific research of mutual interest to the entertainment industry and the Army are technologies for realistic immersion in synthetic environments, networked simulation, standards for interoperability, and tools for creating simulated environments.  This PE also includes the Historically Black Colleges and Universities and Minority Institution (HBCU\/MI) Centers of Excellence that address critical research areas for Army Transformation. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering science and technology focus areas and the Army Modernization Strategy.  \n \nWork in this PE is performed by the ARL in Adelphi, MD; the Army Tank Automotive Research, Development, and Engineering Center (TARDEC) in Warren, MI; the Army Aviation and Missile Research, Development and Engineering Center (AMRDEC), in Huntsville, AL, and the Army Research, Development and Engineering Command (RDECOM), in Aberdeen, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "108.782"
                },
                "CurrentYear": {
                    "val": "100.340"
                },
                "BudgetYearOne": {
                    "val": "101.725"
                },
                "BudgetYearOneBase": {
                    "val": "101.725"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "105.766"
                },
                "CurrentYear": {
                    "val": "104.340"
                },
                "BudgetYearOne": {
                    "val": "94.280"
                },
                "BudgetYearOneBase": {
                    "val": "94.280"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.016"
                },
                "CurrentYear": {
                    "val": "4.000"
                },
                "BudgetYearOne": {
                    "val": "-7.445"
                },
                "BudgetYearOneBase": {
                    "val": "-7.445"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "4.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.850"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.866"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-7.445"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.445"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EA6"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Collaborative Research Alliance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.039"
                        },
                        "CurrentYear": {
                            "val": "3.234"
                        },
                        "BudgetYearOne": {
                            "val": "3.281"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.281"
                        },
                        "BudgetYearTwo": {
                            "val": "3.338"
                        },
                        "BudgetYearThree": {
                            "val": "4.887"
                        },
                        "BudgetYearFour": {
                            "val": "4.984"
                        },
                        "BudgetYearFive": {
                            "val": "5.084"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project fosters research performed through the Cyber Security Collaborative Research Alliance (CSEC CRA), a competitively selected consortium, formed to advance the theoretical foundations of cyber science in the context of Army networks.  This CRA consists of academia, industry and government researchers working jointly with the objective of developing a fundamental understanding of cyber phenomena so that fundamental laws, theories, and theoretically grounded and empirically validated models can be applied to a broad range of Army domains, applications, and environments.  This research focuses on three interrelated aspects of cyber security and is conducted using a trans-disciplinary approach that takes into account the human element of the network.  The three aspects of cyber that are addressed are: 1) vulnerabilities and risks of cyber networks to malicious activities, 2) anticipating, detecting, and analyzing malicious activities, and 3) agile cyber maneuver to thwart and defeat malicious activities.  Overarching goals of cyber security are to significantly decrease the adversary's return on investment when considering cyber attack on Army networks, and minimizing the impact on (Army) network performance related to implementing cyber security.  The CRA research creates a framework that effectively integrates the knowledge of cyber assets and potential adversary capabilities and approaches, and provides defense mechanisms that dynamically adjust to changes related to mission, assets, vulnerability state, and defense mechanisms.\n\nWork in this project supports key Army needs and provides the technical underpinnings to Program Element (PE) 0602782A (Command, Control, Communications Technology)\/Project H92 (Communications Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL) in Adelphi and Aberdeen Proving Grounds, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security Collaborative Research Alliance"
                                    },
                                    "Description": {
                                        "val": "The Cyber Security Collaborative Research Alliance (CSEC CRA) supports basic research to enable capabilities for rapid development and adaptation of cyber tools for dynamically assessing cyber risks, detecting hostile activities on friendly networks, and supporting agile maneuver in cyber space in spite of the continuous evolution and emergence of novel threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.039"
                                            },
                                            "Text": {
                                                "val": "Developed theories and models relating fundamental properties and features of dynamic risk assessment algorithms to the fundamental properties of dynamic cyber threats, Army's networks, and defensive mechanisms taking into account the context of the mission; developed theories and models relating properties and capabilities of cyber threat detection and recognition processes\/mechanisms to properties of malicious activity and of Army networks; developed theories and models to support planning and control of cyber maneuver (i.e., \"maneuver\" in the space of network characteristics and topologies) that would describe how control and the end-state of the maneuver are influenced by fundamental properties of threats - such as might be rapidly inferred from limited observations of a new, recently observed threat; and developed a theoretical understanding of the socio-cognitive factors that impact the decision making of the user\/Soldier, defender\/analyst, and adversary."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.234"
                                            },
                                            "Text": {
                                                "val": "Develop theories and models relating fundamental properties of dynamic cyber threats to dynamic risk assessments and defensive maneuver algorithms; develop a mathematical formalism for representing cyber tasks or missions that will provide a common framework for reasoning about risk, maneuver, detection and the underlying socio-cognitive factors; develop approaches to assessment of aggregate risk in such a dynamic hostile environment; develop diagnosis-enabling detection algorithms that can go from symptoms to root causes; develop and validate computational cognitive models that represent human processes of threat detection; and develop multi-party game-theory etic models and computational algorithms leading to pragmatic defense strategies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.281"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.281"
                                            },
                                            "Text": {
                                                "val": "Will extend fundamental theories and models of dynamic cyber threats and defense developed in Fiscal Year (FY) 2015 and 2016, leading to practical defense strategies via analytical models of collaborative and composite risk, and appropriate communication of risk metrics; user\/defender\/attacker feedback models to capture interactions; optimized evidence collection and introspective detection; model-based generation and verification of cyber maneuvers; multi-party stealth games; and extensive validation on realistic data-sets and test-beds."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F17"
                    },
                    "ProjectTitle": {
                        "val": "Neuroergonomics Collaborative Technology Alliance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.838"
                        },
                        "CurrentYear": {
                            "val": "5.254"
                        },
                        "BudgetYearOne": {
                            "val": "5.332"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.332"
                        },
                        "BudgetYearTwo": {
                            "val": "4.924"
                        },
                        "BudgetYearThree": {
                            "val": "4.721"
                        },
                        "BudgetYearFour": {
                            "val": "4.832"
                        },
                        "BudgetYearFive": {
                            "val": "4.945"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project fosters research through the Cognition and Neuroergonomics Collaborative Technology Alliance (CTA), a competitively selected industry and university consortium, to leverage world-class research in support of future force and Army transformation needs.  Escalating levels of complexity and uncertainty on the current and future battlefield present conditions which have never existed before now.  Solution strategies and approaches must be developed or tailored.  The emerging field of neuroergonomics, which seeks to understand the brain at work and to leverage that understanding to optimize system design, offers tremendous potential for providing the solutions needed to meet the needs of Army forces in the future.  This CTA addresses the solution strategies and approaches needed to design systems to fully exploit investments in revolutionary technological advances in areas such as robotics, microelectronics, and computer and network information systems.  These technologies present significant opportunities to enhance Army mission capabilities, but impose significant burdens on the human brain, which will ultimately limit Soldier-system effectiveness, sustainability, and survivability.  The technical barriers associated with this project include: immature knowledge base to guide the neuroergonomic approach to human-system integration; inadequate capabilities to sense and extract information about brain activity in dynamic, operational environments; lack of valid measures to robustly and uniquely characterize operationally-relevant cognitive performance; lack of techniques for integrating advanced understandings of brain activity into systems designs, including real-time use of measures of cognitive behavior as system inputs and the capability to account for individual differences in maximizing Soldier-system performance.  This CTA conducts an intensive and accelerated program to formulate, validate, and transition basic research findings through multi-dimensional approaches focused in three areas: understanding fundamental principles underlying Soldier neurocognitive performance in operational environments, advancing computational approaches for the analysis and interpretation of neural functioning, and fundamental advancement in neurotechnologies that enhance Soldier-system interactions and performance. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Neurocognitive performance in operational environments"
                                    },
                                    "Description": {
                                        "val": "This effort is intended to understand fundamental principles underlying Soldier neurocognitive performance in operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.463"
                                            },
                                            "Text": {
                                                "val": "Evaluated neurocognitive performance using novel scenarios of increasing military relevance to determine feasibility of military applications; and identified methods of mathematical processing and evaluate utility for interpreting brain activity recordings under conditions that demand complex neural functioning of operationally relevant tasks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.941"
                                            },
                                            "Text": {
                                                "val": "Develop novel set of algorithmic principles and approaches for integrating multiple, concurrently record data streams to enable interpretation and use of brain-based recordings in complex conditions; and enhance estimates of confidence in environmental and human states for improved reliability of sensor information."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.970"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.970"
                                            },
                                            "Text": {
                                                "val": "Will develop models of neural activity to characterize performance in Army-relevant tasks; and investigate relationships between brain activity recorded on the scalp and brain activity recorded within the skull to improve understanding of how the skull and scalp affect recorded brain signals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Computational neural analysis"
                                    },
                                    "Description": {
                                        "val": "This effort advances computational approaches for the analysis and interpretation of neural functioning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.148"
                                            },
                                            "Text": {
                                                "val": "Used information obtained from data mining explorations of large-scale simulation for development of improved algorithms for brain computer interaction technologies that better account for variability among individuals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.599"
                                            },
                                            "Text": {
                                                "val": "Develop algorithms that use adaptive approaches to account for the gradual changes in the mean and variance of the underlying neural signatures that occur when participants perform the same task for an extended period of time.  Adapting to these time-on-task effects will increase the performance of brain computer interaction technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.622"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.622"
                                            },
                                            "Text": {
                                                "val": "Will develop algorithms for reliable comparisons between simple experimental tasks and operationally-relevant tasks; and develop analytical methods for automated characterization of within-subject, cognitive state fluctuations during long-term task performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neurotechnologies"
                                    },
                                    "Description": {
                                        "val": "This effort provides a fundamental advancement in neurotechnologies that enhance Soldier-system interactions and performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.227"
                                            },
                                            "Text": {
                                                "val": "Pursued adaptation of neuroimaging technologies to enhance functionality in complex environments; and developed technical capabilities for identification of brain activity in realistic environments, including hardware and software algorithms robust to environmental and user-induced signal noise."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.714"
                                            },
                                            "Text": {
                                                "val": "Develop experimental mobile applications to monitor and track real-world fluctuations in sleep patterns and perceived levels of stress and fatigue in order to examine how these behavioral variations effect neural data; and develop novel big data mining methods to unite data on this effort that are collected at different research centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.740"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.740"
                                            },
                                            "Text": {
                                                "val": "Will investigate performance of dry electrode systems in high noise conditions inherent to real-world tasks for applications in mobile environments; and develop a combined hardware-software solution for mitigation of noise in the signal for enhanced interpretation of brain data."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H04"
                    },
                    "ProjectTitle": {
                        "val": "HBCU\/MI Programs"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.024"
                        },
                        "CurrentYear": {
                            "val": "1.887"
                        },
                        "BudgetYearOne": {
                            "val": "1.486"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.486"
                        },
                        "BudgetYearTwo": {
                            "val": "1.536"
                        },
                        "BudgetYearThree": {
                            "val": "1.591"
                        },
                        "BudgetYearFour": {
                            "val": "1.630"
                        },
                        "BudgetYearFive": {
                            "val": "1.671"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Fiscal Year (FY) 2014 Office of the Secretary of Defense (OSD) funding for Historically Black Colleges and Universities and Minority Institutions (HBCU\/MI)was realigned from the Research, Development, Test, and Evaluation (RDTE), Army appropriation to RDTE, Defense-wide appropriation.  Army specific efforts continue to be funded in this project."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports basic research through the Partnership in Research Transition (PIRT) program, the Army's research initiative focused on partnerships with HBCU\/MI, and provides support to Department of Defense (DoD) HBCU\/MI program providing support for research and collaboration with DoD facilities and personnel for research and collaboration with DoD facilities and personnel.  The focus of this effort is to enhance programs and capabilities of high-interest scientific and engineering disciplines through innovative research performed: 1) at Centers of Excellence (CoE) established at HBCU\/MIs, and 2) through Collaborative Technology Alliances and Collaborative Research Alliances (CTA\/CRAs).  The COEs and CTA\/CRAs work with Army, industry, and other academic partners to transition research to technology demonstration.  In addition, the CoEs and CTA\/CRA partnerships provide opportunities to recruit, educate, and train outstanding students and post-doctoral researchers in science and technology areas relevant to the Army.\n\nWork in this project if fully coordinated with the OSDprogram manager for HBCU\/MI programs.\n\nWork performed in this project supports key Army needs and is coordinated with one or more of the following Projects: 0601104A (University and Industry Research Center)\/Project EA6 (Cyber CRA), \/Project F17 (Neuroergonomics CTA), \/Project H09 (Robotics CTA), \/Project H50 (Network Sciences CTA), Micro Autonomous Systems Technology CTA), and \/Project VS2 (Multiscale Modeling of Materials). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n    \nWork on this project is performed by the Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Centers of Excellence for Battlefield Capability Enhancements (BCE)"
                                    },
                                    "Description": {
                                        "val": "Five new Partnership in Research Transition (PIRT) Centers of Excellence were established in 2011 at: Hampton Univ. (Lower Atmospheric Research Using Light Detection and Ranging (Lidar) Remote Sensing); NCA&T State Univ. (Nano to Continuum Multi-Scale Modeling Techniques and Analysis for Cementitious Materials Under Dynamic Loading); Delaware State Univ. (Center for Advanced Algorithms); Howard Univ.(2) (Bayesian Imaging and Advanced Signal Processing for Landmine and Improvised Explosive Device (IED) Detection Using Ground Penetrating Radar (GPR), and Extracting Social Meaning From Linguistic Structures in African Languages).  These Centers were selected to: enhance programs and capabilities through Army-relevant, topic-focused, near-transition-ready innovative research; strengthen the capacity of the HBCUs to provide excellence in education; and to conduct research critical to the national security functions of the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.024"
                                            },
                                            "Text": {
                                                "val": "Continued to support research at PIRT Centers of Excellence and collaboration with Army Labs and other institutions of higher learning to transition science and innovation to enhance warfighting capabilities of U.S. Soldiers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.887"
                                            },
                                            "Text": {
                                                "val": "Conclude support of research at the five PIRT Centers of Excellence; and continue research investigations with HBCU\/MIs universities, either through follow-on activity with PIRT Centers to enable research\/technology transition or fund new high interest research with HBCU\/MIs through single-investigator efforts, new centers of excellence, or other grant or cooperative research mechanisms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.486"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.486"
                                            },
                                            "Text": {
                                                "val": "Will conduct new research efforts with HBCU\/MIs through ARL’s CTA\/CRAs.  Projects will be within the scope of CTA\/CRAs and will represent opportunities to pursue new, high quality research in areas of strategic importance to the Army.   Areas of research will include: network science, cognition and neuroergonomics, multiscale modeling of materials, robotics, and\/or cyber security."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H05"
                    },
                    "ProjectTitle": {
                        "val": "Institute For Collaborative Biotechnologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.692"
                        },
                        "CurrentYear": {
                            "val": "6.485"
                        },
                        "BudgetYearOne": {
                            "val": "6.595"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.595"
                        },
                        "BudgetYearTwo": {
                            "val": "6.727"
                        },
                        "BudgetYearThree": {
                            "val": "6.870"
                        },
                        "BudgetYearFour": {
                            "val": "7.008"
                        },
                        "BudgetYearFive": {
                            "val": "7.148"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports research at the Army's Institute for Collaborative Biotechnologies (ICB), led by the University of California-Santa Barbara, and two major supporting partners, the California Institute of Technology and the Massachusetts Institute of Technology.  The ICB was established as a University Affiliated Research Center (UARC) to support leveraging biotechnology for: advanced sensors; new electronic, magnetic, and optical materials; and information processing and bioinspired network analysis. The objective is to perform sustained multidisciplinary basic research supporting technology to provide the Army with biomolecular sensor platforms with unprecedented sensitivity, reliability, and durability; higher-order arrays of functional electronic and optoelectronic components capable of self-assembly and with multi-functions; and new biological means to process, integrate, and network information.  These sensor platforms will incorporate proteomics (large scale study of proteins) technology, DNA sequence identification and detection tools, and the capability for recognition of viral pathogens.  A second ICB objective is to educate and train outstanding students and post-doctoral researchers in revolutionary areas of science to support Army Transformation.  The ICB has many industrial partners, such as International Business Machine (IBM) and Science Applications International Corporation (SAIC), and has strong collaborations with Argonne, Lawrence Berkley, Lawrence Livermore, Los Alamos, Oak Ridge, and Sandia National Laboratories, the Army's Institute for Soldier Nanotechnologies, the Institute for Creative Technologies, and Army Medical Research and Materiel Command (MRMC) laboratories.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed extramurally by the Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Institute for Collaborative Biotechnologies"
                                    },
                                    "Description": {
                                        "val": "Perform sustained multidisciplinary basic research supporting technology to provide the Army with bio-inspired materials and biomolecular sensor platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.926"
                                            },
                                            "Text": {
                                                "val": "Showed independent tuning of the temperature coefficient of resistance and noise to improve signal to noise ratio of room temperature infrared detectors; showed electrically injected, high-speed 1.55 µm nanoscale lasers on a silicon (Si) platform for potential gains in energy efficiency of computational and sensor systems;  showing that plasmonic antennas can mitigate efficiency degradation for efficient data communications and energy harvesting; and created and investigated a novel sensor based on optical dark modes in nanorods for use in biomolecule, chemical sensing, and near-field imaging."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.773"
                                            },
                                            "Text": {
                                                "val": "Assess bacterial viability using ultra-high precision mass sensing for enhancement in Soldier protection against bacterial pathogens; experimentally engineer controlled biofeedback capability within cells to regulate cellular metabolic pathways and provide a basis for biosensing and environmental remediation; experimentally engineer scalable biological circuits in yeast cells that can provide sense-and-respond capabilities against harmful chemical and biological agents; experimentally design and synthesize soft, hydrogel microparticles and characterize their properties as cell mimics in vascular networks as a potential vehicle for drug delivery; show how the hierarchical and anisotropic structure of trabecular bone leads to its mechanical properties and translate such understanding to the fabrication of artificial bone; elucidate and translate mechanisms of biological, hierarchical self-assembly to synthetic, stimuli-responsive, optoelectronic materials that can provide responsive antireflective capabilities for the Soldier; experimentally test the ability of modified bacterial genes to enhance electron transfer within bacteria toward a novel means of energy generation; and using bio-inspired models, understand how shape, optical anisotropy and quasi-ordering at the nano-scale allow for control of the broad-band optical response of material interfaces toward improvements in infrared detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.872"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.872"
                                            },
                                            "Text": {
                                                "val": "Will conduct basic research efforts in systems and synthetic biology, photonic and electronic materials, cellular structural materials, and biotechnology tools; and increase research efforts in understanding and engineering microbial consortia for potential biological processing and manufacturing.  Understanding microbial consortia and engineering them for biological processing\/manufacture could provide the Army with the ability to produce complex chemical intermediates\/feed stocks for material synthesis, bioremediation of toxic materials in the environment, probiotics for enhanced Solider health\/performance, waste mitigation, and novel routes to energy generation for reduced logistics loads."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Perform multidisciplinary basic research in the area of neuroscience."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.766"
                                            },
                                            "Text": {
                                                "val": "Utilized psychophysics, mathematical modeling and cutting-edge neuroscientific measurements to explore the neural components underlying perceptual decision making, indecisiveness, learning capabilities and attentional states while performing complex visual tasks, which may ultimately lead to new methods, tools, and models to enhance warfighter performance; and explored the organizational principles governing the structure and topology of brain networks and analyzed brain imaging data that, in the long term, may enable the design of improved training protocols to reduce unwanted maladaptive behaviors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.712"
                                            },
                                            "Text": {
                                                "val": "Investigate the potential of multi-brain computing and EEG to better understand group decision making, to predict the outcome of future human group decisions in complex tasks, and to track collective cognitive and emotional responses when presented with a common visual stimulus; investigate whether neural markers can be used to indicate biases that may affect optimal decision making; assess the variable influences of physical fatigue on cognition and on decisions that require complex motor behavior; and develop an understanding of the effects of stress on cognition and adaptive decision-making on the neural level toward a characterization of the interaction between decision-making and attentional mechanisms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.723"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.723"
                                            },
                                            "Text": {
                                                "val": "Will continue supporting basic cognitive neuroscience research efforts to better understand decision-making, the effect of fatigue on cognition, and identification of neural indicators\/biomarkers for optimal decision making; understand how the brain achieves accurate classification under high stress; and develop neuro-engineering techniques to make inferences about human’s cognitive and attentional states that are particularly relevant to challenges faced by the Soldier."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H09"
                    },
                    "ProjectTitle": {
                        "val": "Robotics CTA"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.619"
                        },
                        "CurrentYear": {
                            "val": "5.557"
                        },
                        "BudgetYearOne": {
                            "val": "4.040"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.040"
                        },
                        "BudgetYearTwo": {
                            "val": "4.136"
                        },
                        "BudgetYearThree": {
                            "val": "4.241"
                        },
                        "BudgetYearFour": {
                            "val": "2.958"
                        },
                        "BudgetYearFive": {
                            "val": "3.077"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports a collaborative effort between the competitively selected industry and university consortium, the Robotics Collaborative Technology Alliance (CTA), and the Army Research Laboratory (ARL) for the purpose of leveraging world-class research in support of the future force and Army transformation needs.  This project conducts basic research in areas that will expand the capabilities of intelligent mobile robotic systems for military applications with a focus on enhanced, innate intelligence, ultimately approaching that of a dog or other intelligent animal, to permit unmanned systems to function as productive members of a military team.  Research is conducted in machine perception, including the exploration of sensor phenomenology, and the investigation of basic machine vision algorithms enabling future unmanned systems to better understand their local environment for enhanced mobility and tactical performance; intelligent control, including the advancement of artificial intelligence techniques for robot behaviors permitting future systems to autonomously adapt, and alter their behavior to dynamic tactical situations; understanding the interaction of humans with machines focusing upon intuitive control by Soldiers to minimize cognitive burden; dexterous manipulation of the environment by unmanned systems; and unique modes of mobility to enable unmanned systems to seamlessly navigate complex or highly constrained three dimensional environments.  The program will conduct both analytic and validation studies.  \n\nWork in this projects builds fundamental knowledge for and complements the companion applied technology program, Program Element (PE) 0602120A, project TS2 (Robotics).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Army Research Laboratory (ARL) at the Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Explore opportunities enabling revolutionary, autonomous, and highly mobile systems for the future force.  Research focuses on unmanned systems operating as a team with human supervisors and displaying a high degree of adaptability to dynamic environmental and tactical situations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.619"
                                            },
                                            "Text": {
                                                "val": "Expanded upon utilization of learning to conduct semantic labeling of objects and behaviors; expanded upon the concept of a hybrid cognitive-metric architecture, including perceptual and reasoning skills, to enable teaming of humans and unmanned systems; and explored novel modes of mobility, including legs and snake-like motion, to enable efficient, effective mobility in complex three-dimensional (3D) environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.557"
                                            },
                                            "Text": {
                                                "val": "Explore concepts and create algorithms to enable “peer-to-peer” teaming between humans and robots focusing upon a flexible multi-agent teaming architecture, problem solving at a cognitive level, and dialog to engender trust; examine mechanisms for creating social and tactical “understanding” and fast, adaptive, on-line, and on-the-fly learning and interaction with complex 3D environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.040"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.040"
                                            },
                                            "Text": {
                                                "val": "Will develop “peer-to-peer” teaming between humans and robots through expanded fine grained semantic perception especially through the inclusion of contextual information, exploration of deep-learning techniques and techniques for learning based upon sparse data, modeling of basic human behaviors, and exploration of techniques for energy efficient mobility in complex environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H50"
                    },
                    "ProjectTitle": {
                        "val": "Network Sciences Cta"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.057"
                        },
                        "CurrentYear": {
                            "val": "11.065"
                        },
                        "BudgetYearOne": {
                            "val": "9.166"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.166"
                        },
                        "BudgetYearTwo": {
                            "val": "9.037"
                        },
                        "BudgetYearThree": {
                            "val": "8.824"
                        },
                        "BudgetYearFour": {
                            "val": "8.708"
                        },
                        "BudgetYearFive": {
                            "val": "8.686"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports a competitively selected university and industry consortium, the Network Sciences Collaborative Technology Alliance (NS CTA), formed to leverage commercial research investments to provide solutions to Army's requirements for robust, survivable, and highly mobile wireless communications networks, while meeting the Army's needs for a state-of-the-art wireless mobile communications networks for command-on-the-move.  The NS CTA performs foundational, cross-cutting network science research leading to: a fundamental understanding of the interplay and common underlying science among social\/cognitive, information, and communications networks; determination of how processes and parameters in one network affect and are affected by those in other networks; and prediction and control of the individual and composite behavior of these complex interacting networks.  This research will lead to optimized human performance in network-enabled warfare and greatly enhanced speed and precision for complex military operations.  The CTA facilitates the exchange of people among the collaborating organizations to provide cross-organizational perspectives on basic research challenges, as well as the use of state-of-the-art facilities and equipment at the participating organizations.  \n\nWork in this project builds fundamental knowledge for and accelerates the transition of communications and networks technology to Program Element (PE) 0602783A (Computer and Software Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Network Sciences Collaborative Technology Alliance (NS CTA)"
                                    },
                                    "Description": {
                                        "val": "The Network Sciences CTA focuses on four major research areas: Information Networks, Communication Networks, Social\/Cognitive Networks, and Interdisciplinary Research to develop a fundamental understanding of the ways that information, social\/cognitive, and communications networks can be designed, composed, and controlled to dramatically increase mission effectiveness and ultimately enable humans to effectively exploit information for timely decision-making.  Information Networks research develops the fundamental understanding of autonomous network activities and its linkage to the physical and human domains as related to human decision making within the networked command and control (C2) structure.  Social\/Cognitive Networks research is developing the fundamental understanding of the interplay of the various aspects of the social and cognitive networks with information and communications.  Communications Networks research is developing the foundational techniques to model, analyze, predict, and control the behavior of secure tactical communication networks as an enabler for information and C2 networks.  Integration is focused on achieving an integrated Information Networks, Social\/Cognitive Networks, Communications Networks research program that significantly enhances the fundamental understanding of the underlying science of networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.057"
                                            },
                                            "Text": {
                                                "val": "Developed an understanding and associated metrics representative of the relationship between security and network performance in the context of tactical and coalition networks by developing models of socio-cognitive trust and quantification of trust relationships and risk management; developed theories of quality of information, employing human-in-the-loop analysis, to model the tradeoffs between quality of information and efficiency of analysis on affecting the accuracy of analysis and data interpretation; and developed mathematical representations for the quality of information of static and dynamic data and its effectiveness for situational awareness.  These efforts resulted in the identification of data for more accurate situational awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.128"
                                            },
                                            "Text": {
                                                "val": "Develop an analytical framework for modeling the dynamics and evolution of interacting multi-genre networks , such as interacting communications, information, and socio-cognitive network components of a tactical network (this will lead to new models for group-to-group interactions and algorithms and performance metrics for discovering unusual patterns); develop approaches for controlling networks with time-varying structures; develop a foundational science to model, characterize and control information delivered through multi-genre networks (based on the semantics and context of information requests and requisite composite quality-of-information measures); develop fundamental understanding of how to transform data and observations from multi-genre networks into relevant situational understanding for the users in a highly constrained environment; and develop mathematical and computational models of human networks, leading to models for influencing individuals and communities within and between cultures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.133"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.133"
                                            },
                                            "Text": {
                                                "val": "Will model dynamics and co-evolution of inter-genre networks and discovery, inference, and prediction in inter-genre networks; generate models for optimal design and decentralized control of time-varying, non-linear, composite networks; derive algorithms for context-aware knowledge synthesis and analytics over multi-genre (communications, information and socio-cognitive) networks that model uncertainty in distributed processing and user interactions for better situational understanding; create a unifying semantic framework, in the context of multi-genre needs, to address information capacity across multi-genre networks, and to characterize and control the trade-offs in semantic information delivery; and generate predictive models of social-cognitive aspects of multi-genre networks, and mechanisms for influencing networks across cultures, and augmentation of human performance in networked operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Network Modeling Institute"
                                    },
                                    "Description": {
                                        "val": "This research focuses on novel computational models, data structures, computational architectures and techniques that enable predictions of performance and stability of large, complex communications networks.  It takes into account the impact of Soldiers' information needs and modalities of access and use of communication networks in complex adversarial environments, high mobility, and adversarial effects such as jamming or cyber attacks.  Also considered are computational modeling approaches that capture dynamics of information that flows through the network and\/or is stored within the network, and undergoes continual changes as new information arrives and other information ages or is refuted\/superseded by newly arrived information; and the impact of clouds and local tactical cloudlets on network behaviors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Investigated approaches to computational modeling of large-scale networks that incorporate alternative routing techniques, such as trust-based or quality-based routing schemes; used computational experiments to inform study of pathological phenomena that might be induced in large-scale network behaviors by such novel schemes with unknown ramifications; explored impact of such models on existing computational architectures and their performance; and identified constraints on potential uses of alternative routing schemes on applicability of available computational modeling techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.937"
                                            },
                                            "Text": {
                                                "val": "Develop high-fidelity scalable live-virtual simulation\/emulation methods for large-scale networks on emerging large-scale high performance computing architectures; investigate uncertainty quantification methods to evaluate and improve highly dynamic live-virtual network modeling; and develop new validation mathematical methods and investigate how these methods can assist in training communication systems for Soldiers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.033"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.033"
                                            },
                                            "Text": {
                                                "val": "Will validate high-fidelity scalable simulation methods for large-scale networks on emerging large-scale high performance computing architectures; use large-scale network experiments to observe and identify atypical behaviors with unknown ramifications; document methods for quantifying uncertainty (for large-scale networking modeling); and derive new mathematical algorithms on emerging heterogeneous computing that can assist in training communication systems for Soldiers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H53"
                    },
                    "ProjectTitle": {
                        "val": "Army High Performance Computing Research Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.184"
                        },
                        "CurrentYear": {
                            "val": "5.658"
                        },
                        "BudgetYearOne": {
                            "val": "4.404"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.404"
                        },
                        "BudgetYearTwo": {
                            "val": "4.469"
                        },
                        "BudgetYearThree": {
                            "val": "4.544"
                        },
                        "BudgetYearFour": {
                            "val": "4.621"
                        },
                        "BudgetYearFive": {
                            "val": "4.742"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports critical research at the Army High Performance Computing Research Center (AHPCRC).  Research at the AHPCRC is focused on the Lightweight Combat Systems Survivability, computational nano- and bio-sciences, computational battlefield network and information sciences including evaluating materials suitable for armor\/anti-armor and sensor applications, defense from chemical and biological agents, and associated enabling technologies requiring computationally intensive algorithms in the areas of combat systems survivability, battlefield network sciences, chemical and biological defense, nanoscience and nanomechanics, and computational information sciences, scientific visualization enabling technologies that support the future force transition path.    \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army High Performance Computing Research Center (AHPCRC)"
                                    },
                                    "Description": {
                                        "val": "The AHPCRC research mission is to advance computational science and its application to critical Army technologies through an Army-university-industry collaborative research program in such areas as combat systems survivability, and chemical and biological defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.184"
                                            },
                                            "Text": {
                                                "val": "The goal of the reduced order modeling (ROM) for underbody blast project is to develop predictive capability for practical underbody blast applications.  Earlier work demonstrated feasibility by adopting Department of Defense (DoD) engineering software Conventional Weapons Effects.  Developed highly non-linear mathematical formulations and implemented fully coupled, high-fidelity blast-structure interaction problem-solving.  Developed and implemented new energy conserving algorithms in the context of ROM; validated, verified and transitioned research software working with Army partners; continued exascale algorithms development under LISZTFE (domain specific finite element code) environment; investigated a new class of direct solvers, called fast direct solvers (FDS), which use low-rank-matrix approximations to reduce the computational complexity; transitioned software developed for blood transfusion; and continued new scalable algorithmic development research for simulating inhalation of toxic agents for realistic patient-specific geometric features."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.658"
                                            },
                                            "Text": {
                                                "val": "Validate the innovative Model Order Reduction (MOR) method for underbody blast application with experimental data and show two orders of magnitude increased efficiency of MOR method; develop new programming models for emerging heterogeneous memory hierarchies for tactical High Performance Computing (HPC); and develop domain specific languages for mesh based and graph problems and explore these algorithmic approaches for exascale computers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.404"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.404"
                                            },
                                            "Text": {
                                                "val": "Will investigate new scalable methods for data intensive sciences, specifically exploring next generation computing architectures (scalable algorithms development for data intensive sciences);  research next generation computing and programming models and battle command software for emerging heterogeneous memory and storage hierarchies; and develop algorithmic approaches for exascale computers for physics based modeling."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H54"
                    },
                    "ProjectTitle": {
                        "val": "Micro-Autonomous Systems Technology (MAST) CTA"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.021"
                        },
                        "CurrentYear": {
                            "val": "7.679"
                        },
                        "BudgetYearOne": {
                            "val": "6.792"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.792"
                        },
                        "BudgetYearTwo": {
                            "val": "6.678"
                        },
                        "BudgetYearThree": {
                            "val": "6.572"
                        },
                        "BudgetYearFour": {
                            "val": "6.733"
                        },
                        "BudgetYearFive": {
                            "val": "6.898"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project fosters basic research through the Micro Autonomous Systems and Technology (MAST) Collaborative Technology Alliance (CTA), a competitively selected industry-university consortium which leverages world-class research necessary to address future force and Army Transformation needs.  The CTA links a broad range of government technology agencies, as well as industrial and academic partners with the Army Research Laboratory (ARL).  The MAST CTA focuses on innovative research in four main technical areas related to the coherent and collaborative operation of multiple micro autonomous platforms: microsystem mechanics, processing for autonomous operation, microelectronics, and platform integration.  Payoff to the warfighter will be advanced technologies to support future force requirements in situational awareness.  The CTA facilitates the exchange of people among the collaborating organizations to provide cross-organizational perspectives on basic research challenges, and to make available to the Alliance state-of-the-art facilities and equipment at the participating organizations.   \n\nWork in this project complements and is fully coordinated with the U.S. Army Tank and Automotive Research, Development, and Engineering Center (TARDEC); the U.S. Army Natick Soldier Research, Development, and Engineering Center (NSRDEC); and the U.S. Special Operations Command (SOCOM).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the ARL in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Micro-Autonomous Systems Technology (MAST) CTA"
                                    },
                                    "Description": {
                                        "val": "Enhance tactical situational awareness in urban and complex terrain by enabling the autonomous operation of a collaborative ensemble of multifunctional mobile microsystems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.021"
                                            },
                                            "Text": {
                                                "val": "Investigated bio-inspired air and ground robotic platform mobility and control methods (for Micro-Autonomous Systems (MAS) in real world environments), sensors (for on-board state estimation and perception for size, weight, power, and processing constrained MAS), and architectures and algorithms (for heterogeneous teaming, communications, and navigation); studied trades between increased risk, uncertainty and increased operational tempo; and conducted joint experiments on emerging MAS technology to assess the ability to support rapid and mobile Intelligence, Surveillance, and Reconnaissance for the Soldier in complex three-dimensional (3D) environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.679"
                                            },
                                            "Text": {
                                                "val": "Investigate 1) bio-inspired optic flow, sensors, and control algorithms for micro aerial platforms with goal of increasing platform stability and agility, 2) principles of transitions between surfaces for MAST-scale ambulatory robots to operate in complex 3D terrains, and 3) an advanced 5 gram sub-millimeter radar for use in obstacle detection and platform navigation.  Determine methods to enable 1) cooperative control for teams of micro autonomous platforms, 2) rapid deployment of heterogeneous robot teams for exploration of unknown environments, 3) robust estimation and path planning for navigation in 3D environments, and 4) bio-inspired landing, perching and grasping for micro aerial vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.792"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.792"
                                            },
                                            "Text": {
                                                "val": "Will analyze, integrate and experimentally validate bio-inspired optic flow and gust detection sensors and control algorithms for MAST-scaled aerial platforms; analyze, integrate, and experimentally validate increased platform stability and bio-inspired agility concepts for MAST-scale ambulatory robots in complex 3D terrains; characterize and experimentally validate an advanced 5 gram submillimeter radar concept for obstacle detection and platform navigation; develop and experimentally validate advanced optical methods to enable cooperative control for teams of MAST-scaled platforms; characterize methods and experimentally validate rapid deployment of heterogeneous robot teams for exploration of unknown environments and bio-inspired landing, perching, and grasping for micro-aerial vehicles; and develop and experimentally validate concepts for robust communications in complex RF environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H59"
                    },
                    "ProjectTitle": {
                        "val": "International Tech Centers"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.745"
                        },
                        "CurrentYear": {
                            "val": "6.978"
                        },
                        "BudgetYearOne": {
                            "val": "6.563"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.563"
                        },
                        "BudgetYearTwo": {
                            "val": "6.676"
                        },
                        "BudgetYearThree": {
                            "val": "6.798"
                        },
                        "BudgetYearFour": {
                            "val": "6.933"
                        },
                        "BudgetYearFive": {
                            "val": "7.072"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds the International Technology Centers (ITCs), the Foreign Technology (and Science) Assessment Support (FTAS) program, and the Basic Research Center for Network Science located at the United States Military Academy (USMA).  \n\nThe nine ITCs located in Australia, the United Kingdom, Canada, France, Germany, Japan, Chile, Argentina, and Singapore support the Army's goals of providing the best technology in the world to our Warfighters by leveraging the Science and Technology (S&T) investments of our international partners.  The ITCs perform identification and evaluation of international technology programs to assess their potential impact on the Army's S&T investment strategy.  ITC 'technology finds' are submitted as technology information papers (TIPs) to various Army S&T organizations for evaluation and consideration for further research and development.  The FTAS program builds upon the TIPs submitted by the ITCs.  In some cases the TIP is truly unique and may well meet an Army requirement or potentially support ongoing Army S&T investments.  In such cases, the FTAS program can provide initial resources (seed money) to fund basic research in these technology areas identified by the TIPs as having potential relevance to the Army.  The research will provide information useful in making early assessments of the technology's potential contributions to the Army's S&T strategy.  \n\nWork in this project related to the USMA Basic Research Center for Network Science is fully coordinated with and complementary to PE 0601104A (University and Industry Research Centers)\/Project H50 (Network Science CTA). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n       \nWork in this project is performed by Headquarters, Army Research, Development and Engineering Command (RDECOM), the Army Research Laboratory (ARL) in Adelphi, MD, and the United States Military Academy, NY."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Technology Centers (ITC)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.351"
                                            },
                                            "Text": {
                                                "val": "Solicited projects and built on the success of the FTAS Program; continued to enhance and refine technology search capabilities using customer feedback (U.S. Army Research, Development and Engineering Centers (RDECs), Program Managers (PMs)  and labs) to focus on near and long term capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.469"
                                            },
                                            "Text": {
                                                "val": "Continue to solicit projects and build on the success of the FTAS Program; continue to enhance and refine technology search capabilities using customer feedback (RDECs, PMs and labs) to focus on near and long term capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.563"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.563"
                                            },
                                            "Text": {
                                                "val": "Will continue to solicit projects and build on the success of the FTAS Program; continue to enhance and refine technology search capabilities using customer feedback (RDECs, PMs and labs) to focus on near and long term capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Research Center in Network Science at the United States Military Academy (USMA)"
                                    },
                                    "Description": {
                                        "val": "Network science research at USMA in coordination with the Network Science CTA (0601104A\/Project H50)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.394"
                                            },
                                            "Text": {
                                                "val": "Continued to refine algorithms based on the convergence of \"vertex probabilities\" to improve the ability to \"influence\" networks; and continued to refine advances in cooperation networks to include how these theoretical frameworks can improve systems and organizations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.509"
                                            },
                                            "Text": {
                                                "val": "Building academic impact networks and military information networks (unit teams) and refining process algorithms that produce and enhance advances in performance, collaboration and cooperation; validating systems using operational data to design and optimize network frameworks and processes to improve military systems and unit organizations.  Theoretical work is connected with intelligence, surveillance, and reconnaissance and command and control systems (mission command) and results are used in Army Training and Doctrine Command (TRADOC)-supported exercises; research subgroup measures, topological models and information security algorithms to support the use of network science in cyber and intelligence processing systems; and refining economic development models and cultural and logical networks in Africa to assist military decision makers and diplomatic policy makers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H73"
                    },
                    "ProjectTitle": {
                        "val": "Automotive Research Center (ARC)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.040"
                        },
                        "CurrentYear": {
                            "val": "3.133"
                        },
                        "BudgetYearOne": {
                            "val": "3.180"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.180"
                        },
                        "BudgetYearTwo": {
                            "val": "3.234"
                        },
                        "BudgetYearThree": {
                            "val": "3.294"
                        },
                        "BudgetYearFour": {
                            "val": "3.359"
                        },
                        "BudgetYearFive": {
                            "val": "3.426"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project fosters basic research in novel, high payoff technologies that can be integrated into Army ground platforms.  The Center of Excellence for Automotive Research is part of the basic research component of the National Automotive Center (NAC), a business group within the Army Tank-Automotive Research, Development, and Engineering Center (TARDEC).  The Center of Excellence for Automotive Research is an innovative university\/industry\/government consortium leveraging commercial technology for potential application in Army vehicle systems through ongoing and new programs in automotive research, resulting in significant cost savings and performance enhancing technological opportunities.  The research performed in this project contributes to formulating and establishing the basic scientific and engineering principles for these technologies.  \n\nWork in this project complements and is fully coordinated with work under Program Element (PE) 0602601A (Combat Vehicle and Automotive Technology).  Selected university partners include:  University of Michigan, Virginia Tech, Wayne State University, University of Iowa, Oakland University, and Clemson University.  Key industry partners include all major US automotive manufacturers and suppliers.  The Automotive Research Center (ARC) formulates and evaluates advanced automotive technologies and advances state-of-the-art modeling and simulation for the Army's future ground vehicle platforms. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by TARDEC, Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automotive Research Center (ARC)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.040"
                                            },
                                            "Text": {
                                                "val": "Developed valid predictive simulations tools that integrate design strategies that include reliability, product life management and human\/machine interactions; improved characterization and representation of human attributes, capabilities, responses, tolerance, and behaviors and employ this knowledge; and pursued occupant centric vehicle structures that provide safety from explosive threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.133"
                                            },
                                            "Text": {
                                                "val": "Research and develop modeling and simulation methodologies for enabling autonomy in ground vehicle systems and increased force protection\/survivability; research tire and track modeling necessary for terramechanics advancements.  Research thrust areas focus on dynamics and control of vehicles with emphasis on autonomy-enabled systems, human-centered modeling and simulation, high performance structures and materials, advanced and hybrid power trains, and vehicle system integration, optimization and robustness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.180"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.180"
                                            },
                                            "Text": {
                                                "val": "Will expand research and further develop modeling and simulation methodologies for enabling autonomy in ground vehicle systems and increased force protection\/survivability focused on real-time obstacle avoidance, latency compensation and shared human-machine control; research tire and track modeling and other off-road mobility related topics necessary for terramechanics advancements.  Research thrust areas will focus on dynamics and control of vehicles with emphasis on autonomous and autonomy-enabled systems, human-centered modeling and simulation, high performance structures and materials as it pertains to lightweighting\/advanced battery systems\/lubricants\/fuels, next-generation propulsion systems, advanced and hybrid power trains, and vehicle system integration, multi-objective and multi-disciplinary design optimization and robustness focused on modular systems that are expeditionary in nature."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J08"
                    },
                    "ProjectTitle": {
                        "val": "Institute For Creative Technologies (ICT)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.210"
                        },
                        "CurrentYear": {
                            "val": "6.080"
                        },
                        "BudgetYearOne": {
                            "val": "6.186"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.186"
                        },
                        "BudgetYearTwo": {
                            "val": "6.309"
                        },
                        "BudgetYearThree": {
                            "val": "6.442"
                        },
                        "BudgetYearFour": {
                            "val": "6.572"
                        },
                        "BudgetYearFive": {
                            "val": "6.703"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports simulation and training technology research at the Army's Institute for Creative Technologies (ICT) at the University of Southern California.  The ICT was established as a University Affiliated Research Center (UARC) to support Army training and readiness through research into simulation, mixed and virtual reality, artificial intelligence, computer graphics, and learning sciences. ICT applies the results of this research and proves its value in Army relevant applications such as training, mission rehearsal, leadership development, cultural awareness, negotiation, health and medical, and distance learning.  The ICT actively performs research and engages industry and academic institutions internationally to incorporate the latest research results and hardware and software into its research program and application development and exploit dual-use technology. The ICT serves as a means for the military to learn about, benefit from, and facilitate the transfer of applicable technologies into military systems.  In addition the ICT works with creative talent from the entertainment industry to advance and leverage techniques and capabilities and adapt concepts of story and character to increase the degree of participant immersion in synthetic environments in order to improve the realism and usefulness of these experiences.  In developing a true synthesis of the creativity, research, technology, and capability of industry and the research and development community, the ICT is revolutionizing capabilities for the Army by making it more effective in terms of cost, time, range of experiences and the quality of the result and by producing research and applications that will benefit the Army of the 21st century. Resulting research, techniques, and technologies are transitioned for maturation to Program element (PE) 0602308A\/project D02 (Modeling and Simulation for Training and Design).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immersive Environments"
                                    },
                                    "Description": {
                                        "val": "Conduct basic research in immersive environments, to include virtual humans, three-dimensional (3D) sound and visual media, to achieve more efficient and affordable training, modeling, simulation and application solutions and tools. Research includes investigation of techniques and methods to address the rapid development of synthetic environments and the study of perception and cognition to help direct the development of new technologies and techniques that evoke more realistic responses from users. Perform research into auditory aspects of immersion to provide the sound stimulus for increasing the realism for military training and simulation devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.770"
                                            },
                                            "Text": {
                                                "val": "Investigated techniques for creating immersive environments and interactions with virtual humans on computing platforms with limited computational resources such as tablet computers and mobile devices; and assessed effectiveness of techniques across a variety of contexts (e.g., training, mission rehearsal)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.307"
                                            },
                                            "Text": {
                                                "val": "Continue investigation of techniques for creating immersive environments using mobile computing platforms such as tablet computers, smart phones, and other mobile devices for the purpose of training and mission rehearsal; and explore the creation of novel virtual reality training platforms using mixed reality techniques and coordinated quadrotor robots to expand virtual training operating space."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.347"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.347"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies with immersive virtual reality environments to identify ways to induce users to react in realistic and naturalistic ways to support more effective training and learning experiences in virtual spaces; investigate research technologies to automatically recognize nonverbal behaviors and interpersonal dynamics in groups for improved human-computer and human-robot interactions; and investigate the use of machine learning techniques to acquire automatically through interaction with users a variety of linguistic features that support more natural and fluid language interaction."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Graphics and Animations"
                                    },
                                    "Description": {
                                        "val": "Conduct basic research to identify new computational techniques in graphics for achieving real-time photo-realistic rendering of physical and synthetic environments for training and simulations. Research innovative methods for automatically generating animations and gestures for virtual humans based on what is being communicated. Research new technologies for scanning real people and rapidly generating virtual humans which look like these people significantly reducing the time, expense and effort required to develop virtual humans and virtual environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.668"
                                            },
                                            "Text": {
                                                "val": "Researched and developed new methods and algorithms in multi-view optical flow triangulation to align laser-scanned geometry with photographs to reconstruct missed data from previous data capture pipelines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.409"
                                            },
                                            "Text": {
                                                "val": "Develop finite element models to improve facial capture performance and animation of eyes and lips for virtual humans allowing for enhanced non-verbal communications in social interactive training environments; and develop techniques to display life-sized, 3D virtual humans resulting in a high-fidelity, simulated social interactions for training and leader development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.434"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.434"
                                            },
                                            "Text": {
                                                "val": "Will research new technologies for developing life-like, high definition novel performances that include the rapid synthesis of a wide range of facial animations by digital characters allowing for the creation of new performances even when the original (real) subject is no longer available; investigate methods and techniques for the autostereoscopic rendering and display of virtual humans in 3D shared spaces such that they can be viewed by multiple simultaneous viewers without the need for special glasses or headwear; research computational camera system techniques for the purpose of rapidly capturing photorealistic digital characters and authoring performance-driven animations; conduct experiments to determine effectiveness of the human-virtual human interaction at varying levels of fidelity; and extend virtual character capture methods to extract and model hair and cloth to improve the photorealism of dynamic virtual characters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Techniques and Human-Virtual Human Interaction"
                                    },
                                    "Description": {
                                        "val": "Will conduct basic research to investigate methods and techniques for creating virtual humans — computer-generated characters that look, communicate and behave like real people meaning virtual humans will be autonomous, use verbal and non-verbal communication, exhibit emotions, model their own beliefs, desires and intentions as well as those of others, and reason using advanced artificial intelligence. Investigate methods and techniques for improving the perception, communication, understanding, and responsiveness of virtual humans when interacting with live humans and explore how people relate to virtual humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.772"
                                            },
                                            "Text": {
                                                "val": "Conducted evaluations and developed theoretical design frameworks to identify the most cost-effective balance between virtual human fidelity and training effectiveness and investigate an individual's response to the human-like behaviors (e.g., persuasion, cultural biases, etc.) of virtual role-players; extended virtual human cognitive architecture research to recognize various human behaviors and learn from the agent's past experiences; and investigated the use of linguistics and machine learning for automated knowledge acquisition allowing for the creation of more intelligent and communicative artificial agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.364"
                                            },
                                            "Text": {
                                                "val": "Develop and validate theoretical framework to increase the effectiveness of human interactions with virtual humans and robots; develop algorithms and models for virtual humans to engage in multiple activities extending their conversational ability to beyond one specific scenario; and continue development of human cognitive architecture supporting virtual human learning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.405"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.405"
                                            },
                                            "Text": {
                                                "val": "Will explore strategic use of emotion and how emotional displays can be used to manipulate negotiation outcomes and develop a dynamic computer model representation; extend research to explore in depth differences between how people respond to virtual humans, real humans and robots; create meta-dialogue strategies for controlling interactions between people and virtual humans and use online learning to enhance speech synthesis so that virtual humans engage in human-like interaction with people and other virtual human agents; and refine conceptual virtual humans architecture to validate advanced and more natural emotional behaviors, reasoning, and interactions via natural language and speech."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J12"
                    },
                    "ProjectTitle": {
                        "val": "Institute For Soldier Nanotechnology (ISN)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.454"
                        },
                        "CurrentYear": {
                            "val": "6.080"
                        },
                        "BudgetYearOne": {
                            "val": "6.185"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.185"
                        },
                        "BudgetYearTwo": {
                            "val": "6.308"
                        },
                        "BudgetYearThree": {
                            "val": "6.445"
                        },
                        "BudgetYearFour": {
                            "val": "6.574"
                        },
                        "BudgetYearFive": {
                            "val": "6.705"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports sustained multidisciplinary research at the Army's Institute for Soldier Nanotechnologies (ISN) at the Massachusetts Institute of Technology.  The ISN was established as a University Affiliated Research Center (UARC) to support research to devise nanotechnology-based solutions for the Soldier.  The ISN emphasizes revolutionary materials research for advanced Soldier protection and survivability.  The ISN works in close collaboration with the U.S. Army Research Laboratory (ARL), the Army Natick Soldier Research, Development and Engineering Center (NSRDEC), and other U.S. Army Research Development and Engineering Command (RDECOM) elements, as well as several major industrial partners, including Raytheon and DuPont, in pursuit of its goals.  This project emphasizes revolutionary materials research toward an advanced uniform concept.  The future uniform will integrate a wide range of functionality, including ballistic protection, responsive passive cooling and insulating, screening of chemical and biological agents, biomedical monitoring, performance enhancement, and extremities protection.  The objective is to lighten the Soldier's load through system integration and multifunctional devices while increasing survivability.  The new technologies will be compatible with other Soldier requirements, including Soldier performance, limited power generation, integrated sensors, communication and display technologies, weapons systems, and expected extremes of temperature, humidity, storage lifetimes, damage, and spoilage. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n    \nWork in this project is performed by the ARL in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Nanomaterials"
                                    },
                                    "Description": {
                                        "val": "Nanomaterials research efforts focus on light-weight, multifunctional nanostructured fibers and materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.620"
                                            },
                                            "Text": {
                                                "val": "Modeled, synthesized, and studied nanoscale objects with tailored composition, size, and geometry that may lead to future applications in obscurant and optical broadband communications; designed releasable layer-by-layer, assemblies of stabilized lipid nanocapsules on microneedles that may ultimately enable dynamic monitoring of disease states and enhanced vaccine delivery; modeled and synthesized nanotube-adsorbed polymer complexes that may provide completely synthetic analogues of antibodies and aptamers capable of detecting and recognizing neurotransmitters and other biologically relevant molecules; and modeled, synthesized, and characterized scalable and flexible nanoscale patterned metamaterial objects and photonic topological insulators that are able to dynamically respond to electromagnetic fields ranging from optical to microwave wavelengths, potentially providing future materials for integrated sensing or communication elements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.487"
                                            },
                                            "Text": {
                                                "val": "Design and chemically synthesize colloidal nanoparticles to efficiently convert ultra violet (UV) to Short Wavelength Infrared (SWIR) light to enable night vision and secure communications with one, inexpensive device and to add capability to current SWIR commercial, off-the-shelf devices; devise novel chemistry for synthesis and functionalization of thin core-shell nanoparticle constructs to enable economical, highly efficient SWIR emission devices; develop piezo-electric fibers and fiber arrays for acoustic sensing and potential use in sniper detection; create crystalline semi-conductors from high melting materials using novel lower temperature fiber drawing technology to enable novel, in-uniform fiber devices for communications and sensing; design and produce by fiber thermal drawing methods all-in-fiber electrical capacitors of prescribed architectures for use in electric power and electronics applications in the uniform and in devices of unusual shape and size; and develop and apply new computational modeling and simulation tools to enable tractable design of high efficiency optical obscurant particles to enable better obscurant capabilities in smoke grenades."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.540"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.540"
                                            },
                                            "Text": {
                                                "val": "Will continue to fund basic nanomaterials research efforts, including functional nanocrystals for spectral applications, graphene integration for infrared (IR) detection, and nanoparticles with specified optical resonances for obscurant applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast Effects on Soldier"
                                    },
                                    "Description": {
                                        "val": "Blast Effects on Soldier research involves the areas of Battle Suit Medicine and Blast and Ballistic Protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.224"
                                            },
                                            "Text": {
                                                "val": "Evaluated and validated advanced large-scale modeling capabilities that may enable high-fidelity, full-scale simulations of the effect of blast and ballistic impact loading on soldier protection systems; computationally probe the physical mechanisms leading to the failure of bone tissue under dynamic compressive loading (may provide predictive models of blast injuries and improve the development of protective foot gear); and objectively defined and modeled the neural correlates of mild traumatic brain injury (mTBI) produced by blast waves (may provide new methods to detect cognitive disorders resulting from mTBI)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.063"
                                            },
                                            "Text": {
                                                "val": "Design, fabricate and test experimental graphene polymer composites to provide lighter weight and higher strength protective materials for the Soldier; perform experiments, mathematical modeling and simulation studies (to enable the design and production of light weight, high strength nanocrystalline and superelastic metal alloys for blast and ballistic protection and damping of mechanical energy); develop improved fundamental understanding of the physics, biology and physiology of blast-induced trauma and of the strengths and limitations of various materials to protect against blast related injuries; and develop computational tools for high-fidelity three-dimensional (3D) simulations of blast and ballistic impacts on human protective materials including crack formation and propagation, and materials failure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Will continue basic research to improve understanding of the physics, biology and physiology of blast-induced trauma and the strengths and limitations of various materials to protect against blast related injuries. Support efforts to develop computational tools for high-fidelity 3D simulations of blast and ballistic impacts on human protective materials, including crack formation and propagation, and materials failure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Protection"
                                    },
                                    "Description": {
                                        "val": "Soldier Protection research efforts focused on Soldier Survivability and Protection and Nanosystems Integration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.610"
                                            },
                                            "Text": {
                                                "val": "Modeled and synthesized nanocomposite, metamaterial architectures and examine if and how these materials can guide and dissipate energy, potentially providing a method to dissipate blast energy for soldier protection; modeled, synthesized, and characterized nanostructured protein hydrogels under physiologically relevant conditions which may ultimately lead to a rapid field treatment option for hemorrhagic shock or other trauma; and explored and modeled the rate-dependent response of biological and synthetic gels to intense loadings over a broad range of length and time scales, which will guide the future design of compliant, protective materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.530"
                                            },
                                            "Text": {
                                                "val": "Design, construct and assess compact devices to allow storage and rapid administration of pain relief and agents to treat battlefield injuries; devise compact, high sensitivity hollow-core photonic band gap fiber devices to extend the detection limits and range of improvised explosive devices that can be detected with compact hand held and robot-borne devices; exploit the novel electronic properties of chemically and biologically functionalized nanocarbon structures to design compact, low power devices to sense food pathogens and to sense chemical-biological agents or other hazardous materials; create nanostructured capabilities to treat battlefield wounds including engineered hydrogels to rapidly stop bleeding, engineered bacteriophages and nanoparticles to combat antibiotic resistant wound pathogens, and nanoparticles to deliver anti-inflammatory agents into cells; perform theoretical, computational and experimental studies of how photonic crystals interact with light waves that may enable the development of all optical integrated circuits for more robust devices; design, build, and assess advanced thermo-photo-voltaic power generation devices that exploit nanostructured photonic crystals to achieve much higher fuel-to-electricity conversion efficiencies and thus enable efficient portable power; employ analytical theory, high-fidelity computation, and experiments to enable practical applications of a recently discovered photonic crystal phenomenon, that may ultimately enable novel sensing applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.545"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.545"
                                            },
                                            "Text": {
                                                "val": "Will continue funding basic research efforts that could lead to development of novel therapeutic multifunctional materials and drug delivery vehicles. Support efforts in synthesis of nanoscale superelastic alloys and other novel nanomaterial systems for potential flexible protection application."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J13"
                    },
                    "ProjectTitle": {
                        "val": "UNIVERSITY AND INDUSTRY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.100"
                        },
                        "CurrentYear": {
                            "val": "4.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for University and Industry Initiatives."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6.100"
                                        },
                                        "Text": {
                                            "val": "Congressional increase for basic research efforts."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Congressional increase for basic research efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J14"
                    },
                    "ProjectTitle": {
                        "val": "Army Educational Outreach Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.182"
                        },
                        "CurrentYear": {
                            "val": "9.670"
                        },
                        "BudgetYearOne": {
                            "val": "9.864"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.864"
                        },
                        "BudgetYearTwo": {
                            "val": "10.048"
                        },
                        "BudgetYearThree": {
                            "val": "10.274"
                        },
                        "BudgetYearFour": {
                            "val": "10.470"
                        },
                        "BudgetYearFive": {
                            "val": "10.679"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports science activities that encourage elementary\/middle\/high school and undergraduate youths to develop an interest in and pursue education and employment in the Science, Technology, Engineering, and Math (STEM) fields. These activities are consolidated within the Army Educational Outreach Program (AEOP) that links and networks appropriate components to derive the best synergies to present the Army to a larger pool of technical talent and to provide students with Army-unique practical experiences at Army laboratories, centers, and institutes to fill future Army Science and Technology workforce needs. AEOP increases interest and involvement of students and teachers across the nation in STEM at all proficiency levels and backgrounds to include under-represented and economically disadvantaged groups through exposure to Army sponsored research, education, competitions, internships, and practical experiences. This project utilizes Army STEM assets to contribute to a STEM literate citizenry as well as enhances the national pool of science and engineering personnel that in turn supports defense industry and Army laboratory and research, development, and engineering center needs.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus area, the Army Modernization Strategy, the Federal STEM Strategic Plan, and the President's \"Educate to Innovate\" campaign for STEM education.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), the Army Research Institute (ARI) for the Behavioral and Social Sciences, the Army Corps of Engineers' Engineer Research and Development Center (ERDC), the Army Medical Research and Materiel Command (MRMC), the Army Space and Missile Defense Command (SMDC), and the United States Military Academy (USMA)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "eCYBERMISSION"
                                    },
                                    "Description": {
                                        "val": "This program supports a nation-wide, web-based STEM competition for students in grades 6 through 9, designed to stimulate interest and encourage continued education in these areas among middle and high school students nationwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.459"
                                            },
                                            "Text": {
                                                "val": "Continued STEM activities with a concentrated effort in underserved populations; increased geographic diversity; sustained eCYBERMISSION; and implemented program enhancements based on lessons learned from previous years."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.766"
                                            },
                                            "Text": {
                                                "val": "Continue STEM activities with concentrated effort in reaching out to students from underserved populations; increase geographic diversity; sustain program growth; and implement program enhancements based on prior years’ evaluations outcomes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.822"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.822"
                                            },
                                            "Text": {
                                                "val": "Will continue STEM activities with concentrated effort in reaching out to students from underserved populations; increase geographic diversity; sustain program growth; and will implement program enhancements based on prior years’ evaluations outcomes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Educational Outreach and Workforce Development"
                                    },
                                    "Description": {
                                        "val": "This effort aims to broaden STEM competencies through various outreach and workforce development initiatives at participating Army labs and research centers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.328"
                                            },
                                            "Text": {
                                                "val": "Continued AEOP support to reach under-represented and economically disadvantaged areas to enhance STEM education through student experiences in Army labs and academic partner institutions; and mentored students to broaden their interest in and their development of STEM education."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Text": {
                                                "val": "Continue AEOP support and outreach to under-represented and economically disadvantaged areas to enhance STEM education through student experiences in Army labs and academic partner institutions, and mentor students to broaden their interest in and their development of STEM education"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Text": {
                                                "val": "Will continue AEOP support and outreach to under-represented and economically disadvantaged areas to enhance STEM education through student experiences in Army labs and academic partner institutions, and mentor students to broaden their interest in and their development of STEM education."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Educational Outreach Program Cooperative Agreement"
                                    },
                                    "Description": {
                                        "val": "The Army Educational Outreach Program Cooperative Agreement encompasses a variety of outreach activities under AEOP.  This activity supports a strong partnership with government, academia and industry to address the shortfall of clearable STEM skilled talent preparing for the workforce.  These activities include Army-sponsored research, education, competitions, internships and practical experiences designed to engage and guide students and teachers in Army sponsored STEM programs. AEOP has targeted efforts to reach and engage underserved and underrepresented communities in STEM initiatives to build the pool of diverse STEM competitive talent."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.095"
                                            },
                                            "Text": {
                                                "val": "Continued Army lab and research center sponsorship of students and STEM education opportunities; provided incentives in STEM competitions that include scholarships, experiences and mentorships as well as expose students to Department of Defense (DoD) career opportunities; streamlined processes, leverage funding and build educational partnerships; and performed annual comprehensive review and educational assessments to support future decisions and best practices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.199"
                                            },
                                            "Text": {
                                                "val": "Continue Army lab and research center sponsorship of students and STEM education opportunities; provide incentives in STEM competitions that include scholarships, experiences and mentorships as well as expose students to DoD career opportunities; streamline processes, leverage funding and build educational partnerships; and perform annual comprehensive review and educational assessments to support future decisions and best practices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.332"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.332"
                                            },
                                            "Text": {
                                                "val": "Will continue Army lab and research center sponsorship of students and STEM education opportunities; provide incentives in STEM competitions that include scholarships, experiences and mentorships as well as expose students to DoD career opportunities; streamline processes, leverage funding and build educational partnerships; and perform annual comprehensive review and educational assessments to support future decisions and best practices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "West Point Cadet Research"
                                    },
                                    "Description": {
                                        "val": "The West Point Cadet Research Program provides West Point Cadets an opportunity to work on Army research projects alongside Army and industry scientists and engineers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Conducted West Point cadet research internship program to enhance cadet training through field experience in Army research labs and centers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.305"
                                            },
                                            "Text": {
                                                "val": "Conduct West Point cadet research internship program to enhance cadet training through field experience in Army research labs and centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.310"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.310"
                                            },
                                            "Text": {
                                                "val": "Will conduct West Point cadet research internship program to enhance cadet training through field experience in Army research labs and centers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J15"
                    },
                    "ProjectTitle": {
                        "val": "Network Sciences ITA"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.712"
                        },
                        "CurrentYear": {
                            "val": "4.070"
                        },
                        "BudgetYearOne": {
                            "val": "4.078"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.078"
                        },
                        "BudgetYearTwo": {
                            "val": "4.083"
                        },
                        "BudgetYearThree": {
                            "val": "4.112"
                        },
                        "BudgetYearFour": {
                            "val": "4.152"
                        },
                        "BudgetYearFive": {
                            "val": "4.235"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports research at a competitively selected United States (U.S.)\/United Kingdom (U.K.) government, university, and industry consortium established to perform fundamental network and information science investigations in the areas of network theory, system-of-systems security, sensor processing and delivery, and distributed coalition planning and decision making.  The focus is on enhancing distributed, secure, and flexible decision-making to improve coalition operations, and developing the scientific foundations for complex and dynamic networked systems-of-systems to support the complex human, social, and technical interactions anticipated in future coalition operations with the emphasis on integration of multiple technical disciplines in an international arena.  The Army Research Laboratory (ARL) and the U.K. Ministry of Defense (MOD) established the jointly funded and managed U.S. and U.K. consortium, known as the International Technology Alliance (ITA) on Network and Information Sciences, in Fiscal Year (FY) 2006. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the ARL at Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Network and Information Science Basic Research for U.S.\/U.K. Coalition Operations Information"
                                    },
                                    "Description": {
                                        "val": "This research will address the fundamental science underpinning the complex information network issues that are vital to future U.S.\/U.K. coalition military operations and to fully exploit the joint development of emerging technologies necessary to enable coalition operations.  These efforts provide enhanced ability to perform projective analysis on hybrid networks for the purpose of improving security and information distribution in coalition operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.712"
                                            },
                                            "Text": {
                                                "val": "Developed integrated analysis algorithms of data derived from hybrid networks to aid analysts in performing projective analysis; developed techniques to provide risk averse and security conscious analysis capabilities to distributed mobile devices among coalition partners; and developed secure energy-aware and resource-aware access to distributed computing resources.  These efforts enhanced network and security analysis while improving the effective use of coalition resources available to the Warfighter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.070"
                                            },
                                            "Text": {
                                                "val": "Develop projective analysis techniques for hybrid networks that consider limitations on controllability; develop secure, content-based networking approaches that allow distributed information discovery, resiliency, and adaptability in heterogeneous coalition networks; develop abstract, physical, spatio-temporal analytical models and representations that support distributed processing of information; and develop distributed techniques for dynamically assembling information services in dynamic coalition environments to enable distributed analytics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.078"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.078"
                                            },
                                            "Text": {
                                                "val": "Will cultivate a fundamental understanding of using distributed services to support coalition information processing in dynamic environments for building composite information infrastructures; develop information-centric networking that supports secure coalition operations via logically distributed and decentralized architectures across heterogeneous coalition networks; formulate dynamic policy-based autonomous management techniques to jointly control both coalition information and infrastructural services that dynamically adjust to mission changes, network dynamics and policy changes; develop formal theories, frameworks and mechanisms to dynamically match operational tasks to information resources for complex coalition operations; and investigate formal theories and techniques to enable multi-level integrated fusion of disparate information sources in context of decision support objectives for coalitions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J17"
                    },
                    "ProjectTitle": {
                        "val": "Vertical Lift Research Center Of Excellence"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.774"
                        },
                        "CurrentYear": {
                            "val": "3.031"
                        },
                        "BudgetYearOne": {
                            "val": "3.076"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.076"
                        },
                        "BudgetYearTwo": {
                            "val": "3.130"
                        },
                        "BudgetYearThree": {
                            "val": "3.187"
                        },
                        "BudgetYearFour": {
                            "val": "3.250"
                        },
                        "BudgetYearFive": {
                            "val": "3.315"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project fosters research to provide vertical lift capability and engineering expertise for the Army.  The focus of the Vertical Lift Research Center of Excellence (VLRCOE) is to couple state-of-the-art research programs with broad-based graduate education programs at academic institutions with the goal of increasing the supply of scientists and engineers who can contribute to Army Transformation.  Work will provide research into technologies that can improve tactical mobility, reduce the logistics footprint, and increase survivability for rotary wing vehicles.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.    \n  \nWork in this project is performed extramurally by the Aeroflightdynamics Directorate of the Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC) (located at the National Aeronautics and Space Administration (NASA) Ames Research Center, Moffett Field, CA)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vertical Lift Research Center of Excellence (VLRCOE)"
                                    },
                                    "Description": {
                                        "val": "VLRCOE agreements with Penn State University, University of Maryland, and Georgia Institute of Technology to supplement a robust experimental and analytic basic research program in rotorcraft technologies including: Aeromechanics, Structures, Flight Dynamics and Control, Rotorcraft Design and Concepts, Vibration and Noise Control, Propulsion, Affordability, Safety and Survivability, and Naval Operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.774"
                                            },
                                            "Text": {
                                                "val": "Implemented year four of VLRCOE agreements with Penn State University, University of Maryland, and Georgia Institute of Technology to conduct a robust experimental and analytic basic research program in rotorcraft technologies including: Aeromechanics, Structures, Flight Dynamics and Control, Rotorcraft Design and Concepts, Vibration and Noise Control, Propulsion, Affordability, Safety and Survivability, and Naval Operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.031"
                                            },
                                            "Text": {
                                                "val": "Complete the final year of the VLRCOE technology interchange agreements by executing a robust experimental and analytic basic research program in rotorcraft technologies including: aeromechanics, structures, flight dynamics and control, rotorcraft design and concepts, vibration and noise control, propulsion, affordability, safety and survivability, and Naval operations.  Identify research thrust areas of interest to Army Aviation for a new Center of Excellence (COE) program that will support future vertical lift in the long term."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.076"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.076"
                                            },
                                            "Text": {
                                                "val": "Will initiate a new, five year COE program that supports the Future Vertical Lift program and focuses on graduate education and a robust experimental\/computational\/analytical basic research program in rotorcraft technologies including: aeromechanics, structures, flight dynamics and control, rotorcraft design and concepts, vibration and noise control, propulsion, affordability, safety and survivability, and Naval operations.  Specific areas of interest and proposals will be selected based on evaluations by a consensus of government subject matter experts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VS2"
                    },
                    "ProjectTitle": {
                        "val": "Multi-Scale Materials Modeling Centers"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.268"
                        },
                        "CurrentYear": {
                            "val": "9.296"
                        },
                        "BudgetYearOne": {
                            "val": "8.851"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.851"
                        },
                        "BudgetYearTwo": {
                            "val": "9.048"
                        },
                        "BudgetYearThree": {
                            "val": "9.256"
                        },
                        "BudgetYearFour": {
                            "val": "9.493"
                        },
                        "BudgetYearFive": {
                            "val": "9.692"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports two competitively awarded Collaborative Research Alliances (CRAs) to provide the Army with next generation multi-functional materials for ballistic and electronic applications and to address the extreme challenges associated with understanding and modeling materials subject to Army operational environments.  The Materials in Extreme Dynamic Environments consortium, led by Johns Hopkins University partnered with CalTech, Rutgers University, and University of Delaware, focuses on understanding materials under high strain rates.  The Multiscale Multidisciplinary Modeling of Electronic Materials consortium, led by University of Utah partnered with Boston University and Rensselaer Polytechnic Institute, focuses on microscale properties to design macroscale behavior for electronics.  Research at both CRAs will address the modeling and experimental challenges associated with developing multidisciplinary physics simulations across multiple length scales for materials to include: a limited ability to relate materials chemistry, structure, and defects to materials response and failure under extreme conditions; an inadequate ability to predict the roles of materials structure, processing, and properties on performance in relevant extreme environments and designs; and the lack of experimental capabilities to quantify multiscale response and failure of materials under extreme conditions.\n\nWork in this project supports key Army needs and is coordinated with work performed in Program Element (PE) 0601102A (Defense Research Sciences)\/Project H44 (Adv Sensor Research) and H42 (Materials and Mechanics).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL) in Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Collaborative Research Alliances in Materials in Extreme Dynamic Environments and Multiscale Multidisciplinary Modeling of Electronic Materials."
                                    },
                                    "Description": {
                                        "val": "Research will focus on the following areas: two-way multiscale modeling for predicting performance and designing materials, investigating analytical and theoretical analyses to effectively define the interface physics across length scales; advancing experimental capabilities for verification and validation of multiscale physics; and modeling and strategies for the synthesis of high loading rate tolerant materials so that all of the latter lead to the development of a comprehensive set of metrics that define high loading rate tolerant material systems.  The multiscale modeling capability will be applied across multiple disciplines to facilitate revolutionary advances in materials for coupled environments (electromagnetic, high rate, high pressure and other extreme environments)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.268"
                                            },
                                            "Text": {
                                                "val": "Conducted research to achieve a comprehensive \"materials-by-design\" capability to include designing materials and predicting key properties for materials in extreme dynamic environments through the integration of novel experimental methodologies and multiscale computational approaches; validated material characteristics and properties at length scales that govern high rate deformation, fracture and failure phenomena in metallic, polymeric, ceramic and composite material systems through both computational and experimental techniques; researched fabrication technology for optimized polymeric, metallic, ceramic and composite systems; and investigated interface physics (with regards to strain, polarization, piezoelectric, electromagnetic phenomena and solid\/liquid boundaries).  Results advance the state-of-the art in multiscale modeling for electronic materials to create a capability for \"materials optimization\" and \"materials by design\" supporting increased efficiency, source and detector lifetimes, increased power density (in electrochemical energy storage devices), and advancing the understanding of electronic materials to include interactions of electrons, photons, phonons, defects and impurities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.296"
                                            },
                                            "Text": {
                                                "val": "Advance the state of the art in multi-scale modeling for electronic materials by creating a capability to tailor properties and ultimately enable an increase in efficiency, lifetimes of sources and detectors and power density in electrochemical energy storage devices; develop complex multi-scale modeling techniques which are validated and verified across critical scales in time and space for tailored electronic materials and optimized band structure; develop algorithms\/theories that further advance the state of the art of electronic materials with regards to interactions of electrons, photons, phonons, defects and impurities; and advance the state of the art in interface physics with regards to strain, polarization, piezoelectric, electromagnetic phenomena and solid\/liquid boundaries to predict electronic materials' behavior focused on Army relevant devices.  Develop a proof-of-concept \"materials-by-design\" capability in designing materials and predicting key properties for materials in extreme dynamic environments based on the fundamental properties of the atomic and molecular components; synchronize novel experimental methodologies with multiscale computational approaches to enable unprecedented microstructure control and predictive capabilities; validate the comprehensive set of material characteristics and properties at length scales that govern high rate deformation (ballistic effects), fracture and failure phenomena in metallic, polymeric, ceramic and composite material systems through both computational and experimental techniques using representative materials; and begin development of the fabrication technology for optimized polymeric, metallic, ceramic and composite systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.851"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.851"
                                            },
                                            "Text": {
                                                "val": "Will continue to advance the state-of-the-art in multi-scale modeling for electronic materials by further validation of the capability to tailor electronic materials’ properties; develop the validation and verification techniques for models that cross or tie-together critical scales in time and space for tailored electronic materials and optimized band structure; develop additional algorithms\/theories to advance the state-of-the-art of electronic materials with regards to interactions carriers and impurities; and further advance the state of the art in interface physics with regards to strain, polarization, piezoelectric, electromagnetic phenomena and solid\/liquid boundaries to map and to predict electronic materials' behavior within Army relevant devices.  Continue to develop and refine a proof-of-concept \"materials-by-design\" capability to predict key properties for materials in extreme dynamic environments based on the fundamental properties of the atomic and molecular components; assess the learning from the novel high rate experimentation results especially when combined with multiscale computational approaches and key visualization techniques; begin confirmation of the ability to predict and control microstructure; validate that we have defined the comprehensive set of material characteristics and properties at length scales that govern high rate deformation (ballistic effects), fracture and failure phenomena in metallic, polymeric, ceramic and composite material systems through both computational and experimental techniques using representative materials; and begin development of the fabrication technology for optimized polymeric, metallic, ceramic and composite systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VS3"
                    },
                    "ProjectTitle": {
                        "val": "Center For Quantum Science Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.807"
                        },
                        "CurrentYear": {
                            "val": "5.183"
                        },
                        "BudgetYearOne": {
                            "val": "5.201"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.201"
                        },
                        "BudgetYearTwo": {
                            "val": "5.222"
                        },
                        "BudgetYearThree": {
                            "val": "6.239"
                        },
                        "BudgetYearFour": {
                            "val": "6.383"
                        },
                        "BudgetYearFive": {
                            "val": "6.511"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports an extramural research consortium, which will bring together a critical mass of preeminent university and industry researchers to explore and develop critical emerging concepts in Quantum Information Science (QIS).  The focus will be on establishing a first of its kind, multi-site distributed quantum network based on quantum memories.  The Center for Distributed Quantum Information will study and demonstrate both the physical backbone and network layer for a robust quantum information network that will provide secure and tamper-proof communications and exponentially greater information processing capabilities for the future Army.  The Center for Distributed Quantum Information will perform collaborative research with Army in-house scientists and engineers to help accelerate the transition of the research.  In addition to providing the required expertise and critical mass to the effort, the  consortium will also bring together a broad but unified multi-disciplinary research team needed to accelerate progress in the field of quantum information sciences. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas, and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Center for Distributed Quantum Information"
                                    },
                                    "Description": {
                                        "val": "This work supports critical quantum science basic research at the U.S. ARL exploiting quantum effects to greatly enhance computing, communications, imaging, sensing, and security ensuring Army dominance on the future battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.807"
                                            },
                                            "Text": {
                                                "val": "Researched mapping between model quantum systems and the system whose properties need to be understood and controlled using atoms in optical lattices, ions in radio frequency (RF) traps, atoms in cavities with and without mechanical resonators, and other approaches; and conducted research to elucidate the role and creation of quantum resources such as superposition, entanglement, and entanglement swapping (including long-range and long-time as needed for quantum repeaters), in overcoming the limitations of classical systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.183"
                                            },
                                            "Text": {
                                                "val": "Advance the development of the physical layer and networking theory needed for a robust distributed quantum network, including investigation of novel network protocols, teleportation between quantum nodes and memories, quantum node-to-node communication along fibers, quantum node-to-node communication through free space, photon encoding protocols, frequency conversion, single photon detection, and entanglement verification protocols."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.201"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.201"
                                            },
                                            "Text": {
                                                "val": "Will research and refine quantum network protocols and algorithms, as well as experimentally and theoretically investigate entanglement between two quantum nodes, entanglement verification protocols, teleportation of quantum state between two nodes, and frequency conversion to connect hybrid platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}