{
    "id": "a22fdacbb2aebd03d0cfe3d4408f757d4bda009f",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA4_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603747A"
        },
        "ProgramElementTitle": {
            "val": "Soldier Support and Survivability"
        },
        "R1LineNumber": {
            "val": "59"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.633"
            },
            "CurrentYear": {
                "val": "4.301"
            },
            "BudgetYearOne": {
                "val": "10.506"
            },
            "BudgetYearOneBase": {
                "val": "10.506"
            },
            "BudgetYearTwo": {
                "val": "12.840"
            },
            "BudgetYearThree": {
                "val": "10.651"
            },
            "BudgetYearFour": {
                "val": "10.847"
            },
            "BudgetYearFive": {
                "val": "10.459"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element supports component development and prototyping for organizational equipment, improved individual clothing and equipment that enhance Soldier battlefield effectiveness, survivability, and sustainment.  This program element also supports the component development and prototyping of joint service food and combat feeding equipment designed to reduce logistics burden."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.997"
                },
                "CurrentYear": {
                    "val": "7.758"
                },
                "BudgetYearOne": {
                    "val": "13.528"
                },
                "BudgetYearOneBase": {
                    "val": "13.528"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.633"
                },
                "CurrentYear": {
                    "val": "4.301"
                },
                "BudgetYearOne": {
                    "val": "10.506"
                },
                "BudgetYearOneBase": {
                    "val": "10.506"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.364"
                },
                "CurrentYear": {
                    "val": "-3.457"
                },
                "BudgetYearOne": {
                    "val": "-3.022"
                },
                "BudgetYearOneBase": {
                    "val": "-3.022"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-3.457"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.364"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.022"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.022"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "610"
                    },
                    "ProjectTitle": {
                        "val": "Food Adv Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.348"
                        },
                        "CurrentYear": {
                            "val": "0.021"
                        },
                        "BudgetYearOne": {
                            "val": "5.299"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.299"
                        },
                        "BudgetYearTwo": {
                            "val": "6.579"
                        },
                        "BudgetYearThree": {
                            "val": "4.830"
                        },
                        "BudgetYearFour": {
                            "val": "4.508"
                        },
                        "BudgetYearFive": {
                            "val": "4.631"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the advanced component development and prototyping of joint service food and combat feeding equipment designed to reduce the logistics burden and Operation and Support (O&S) costs of subsistence support to service personnel. Project supports development of rations and rapidly deployable field food service equipment.  Project conducts demonstration and validation of improved subsistence and subsistence support items used to enhance soldier effectiveness and quality of life in all four Services, as part of an integrated Department of Defense (DoD) Food Research, Development, Test, Evaluation and Engineering Program. The Program is reviewed and validated twice annually by the DoD Combat Feeding Research and Engineering Board (CFREB) as part of the Joint Service Food Program.  This project develops critical enablers that support the Joint Future Force Capabilities and the Joint expeditionary mindset by maintaining readiness through fielding and integrating new equipment. This equipment enhances the field soldier's well-being and provides the soldier with usable equipment, in addition to reducing sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, combat zone footprint, and costs for logistical support.\n\nThis PE\/Project supports Field Feeding Programs for all the services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fielded Individual Ration Improvement Project (FIRIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement project for the Meal, Ready to Eat (MRE)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Continued to conduct in-house product development of food components and identified suitable commercial off-the-shelf (COTS) \/ non-developmental item (NDI) candidate items for fielded individual operational rations (e.g. MRE 2018 date of pack) to enhance Warfighter acceptability, increase consumption and improve nutritional intake; conducted pilot scale in-house production to support engineering design, technology insertion, and commercial producibility; developed, integrated and validated state-of-the art science and technology, food processing and primary\/secondary packaging innovations into individual ration platforms to increase operational effectiveness; optimized food component processing and packaging to introduce targeted items\/capabilities into individual ration platforms for enhanced acceptability, nutrition and performance; transition to 6.5 for testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.895"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.895"
                                            },
                                            "Text": {
                                                "val": "Will continue to conduct in-house product development of food components and identify suitable COTS\/NDI candidate items for fielded individual operational rations (e.g. MRE 2020 date of pack) to enhance Warfighter acceptability, increase consumption and improve nutritional intake. Will conduct pilot scale in-house production to support engineering design, technology insertion, and commercial producibility. Will develop, integrate and validate state-of-the art science and technology, food processing and primary\/secondary packaging innovations into individual ration platforms to increase operational effectiveness. Will optimize food component processing and packaging to introduce targeted items\/capabilities into individual ration platforms for enhanced acceptability, nutrition and performance. Will transition to 6.5 for operational testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assault\/Special Purpose Ration Improvement Project (ASPIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement of special purpose rations by the insertion of new technologies in nutrition, processing and packaging."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.130"
                                            },
                                            "Text": {
                                                "val": "Based on user feedback, focus groups, emerging products and technologies and user requirements, identified COTS\/NDI components for the Meal, Cold Weather\/Long Range Patrol (MCW\/LRP), First Strike Ration (FSR) and Modular Operational Ration Enhancement (MORE) to enhance acceptability, variety, consumption and nutritional value of scenario-specific combat rations. Conducted accelerated and long term storage studies on candidate components. Worked with industry partners to facilitate producibility and technology transition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.519"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.519"
                                            },
                                            "Text": {
                                                "val": "Will continue to identify COTS\/NDI components for the MCW\/LRP, FSR and\/or MORE to enhance acceptability, variety, consumption and nutritional value of scenario-specific combat rations based on user feedback, focus groups, emerging products and technologies and user requirements. Will conduct accelerated and long term storage studies on candidate components. Will transition to 6.5 for operational testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fielded Group Ration Improvement Project (FGRIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement project to continuously update\/improve group ration components, menus, and packaging by integrating state-of-the-art military\/commercial packaging and technology base transitions. The family of Unitized Group Rations (UGRs) includes the Unitized Group Ration - Heat & Serve (UGR-H&S), Unitized Group Ration - Express (UGR-E), Unitized Group Ration - A (UGR-A), and Unitized Group Ration - M (UGR-M)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.208"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to update\/improve components, menus and packaging to increase consumption and overall nutritional intake of the family of UGRs for UGR-A (fiscal year (FY) 17 menus), M, E and H&S (2016 date of pack). Identified COTS\/NDIs and developed new food components in-house, conducted in-house testing, down-selected items and developed test menus for Warfighter evaluation. Developed, integrated and validated state-of-the-art science and technology, food processing and primary\/secondary packaging innovations into group ration platforms to increase operational effectiveness, functionality and improve logistics. Transitioned to 6.5 for operational testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.831"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.831"
                                            },
                                            "Text": {
                                                "val": "Will continue efforts to update\/improve components, menus and packaging to increase consumption and overall nutritional intake of the family of Unitized Group Rations for UGR-A (FY19 menus), M, E and H&S (2018 date of pack). Will identify COTS\/NDIs and\/or develop new food components in-house, conduct in-house testing, down-select items and develop test menus for Warfighter evaluation. Will develop, integrate and validate state-of-the-art science and technology, food processing and primary\/secondary packaging innovations into group ration platforms to increase operational effectiveness, functionality and improve logistics. Will transition to 6.5 for operational testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "US Navy Standard Core Menu (NSCM) Continuous Product Improvement Project"
                                    },
                                    "Description": {
                                        "val": "Provide recommendations for upgrading\/improving Navy Standard Core Menu components by introducing new preparation techniques to enhance menu acceptance and effectiveness while reducing labor requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.160"
                                            },
                                            "Text": {
                                                "val": "Continued to identify and validate COTS\/NDI candidate enhancement to the NSCM. Provided recommendations for improving menu components by introducing new commercial items and state-of-the-art food preparation and feeding techniques to enhance menu acceptance and reduce labor requirements. Transitioned product summaries and results\/recommendations to Naval Supply Systems Command (NAVSUP) for adoption and procurement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.344"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.344"
                                            },
                                            "Text": {
                                                "val": "Will continue to identify and validate COTS\/NDI candidate enhancements to the NSCM. Will test and evaluate new products and techniques using Navy Galley equipment. Will provide recommendations for improving menu components by introducing new commercial items and state-of-the-art food preparation and feeding techniques to enhance menu acceptance and reduce labor requirements. Will transition product summaries and results\/recommendation to NAVSUP for adoption and procurement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Barrier Coating for Optimized Package Performance"
                                    },
                                    "Description": {
                                        "val": "Provides low-cost, non-foil, high performance packaging materials for incorporation into existing and future combat ration packaging systems, such as the UGR-H&S and MRE."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.080"
                                            },
                                            "Text": {
                                                "val": "Delivered prototype entrée and non-retort MRE pouches along with performance documentation\/specifications and cost analysis.  Presented coating technologies to milestone decision authority, Joint Service Operational Ration Forum (JSORF) and the ration supply community for use as an alternative non-foil ration packaging material."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Containerized Ice Making System (CIMS)"
                                    },
                                    "Description": {
                                        "val": "Develop a containerized ice making system to support a 600 person base camp for cooling drinking water in extreme arid conditions and support other ice requirements for those on the base camp and for soldiers going out on missions\/patrols."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.518"
                                            },
                                            "Text": {
                                                "val": "Conducted evaluation of integrated technologies in a realistic operating environment to include: modified commercial items, developmental prototypes and commercial industry technology demonstrators. Mitigated identified weaknesses in transportable ice bagging technologies with development of ruggedized, reliable system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transition of Advanced Appliances for Field Kitchens"
                                    },
                                    "Description": {
                                        "val": "Provide the Warfighter with Jet Propellant 8 (JP-8) fueled appliances that save fuel, are simple to use, provide a safe kitchen environment, and can easily be moved into buildings when necessary. Warfighters benefit from a safer, healthier, more comfortable kitchen environment, and equipment that facilitates preparation of quality UGR-A ration meals. Existing appliances are only about 15-40% efficient; new burner technologies have demonstrated 75% efficiency, typical of stationary gas-fired equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.360"
                                            },
                                            "Text": {
                                                "val": "Performed comprehensive evaluation of appliances integrated with newly developed heating technologies. Verified performance and compatibility with multiple platforms and in dismounted operations. Completed evaluation of appliances mounted on dedicated kitchen platform to prove out component and subsystem maturity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy Food Service Analysis Tool (NFSAT)"
                                    },
                                    "Description": {
                                        "val": "Develop a software analysis tool for Navy Foodservice that performs the following tasks: Automatically calculate all storage space factors and requirements for naval vessels based off the specific NSCM, crew size, Naval Ship's Technical Manual 096, Weights and Stability, Naval Vessel Requirements Food Service Facility Design Manual, Build Specifications 671, 672, and Type Commander established endurance levels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.253"
                                            },
                                            "Text": {
                                                "val": "Awarded NFSAT software contract; demonstrated software to Navy Automatic Identification Technology (AIT) Program Management Office; and received approval for Navy use of NFSAT software."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Block Upgrades and Operational Improvements for Expeditionary Field Feeding Equipment."
                                    },
                                    "Description": {
                                        "val": "Eliminate the sole sourcing of tray ration heater component parts. Reduce overall water consumption through the use of non-immersive cooking technologies and more efficient ware-washing equipment. Increase Kitchen flexibility through appliance upgrades. To reduce the overall fuel consumption of Expeditionary Field Feeding Equipment through enhanced combustion technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.340"
                                            },
                                            "Text": {
                                                "val": "Enhanced the ability of the United States Marine Corps (USMC) to prepare all operational rations during expeditionary operations. Identified, procured, and evaluated candidate burners for tray ration reset and developed kit and procedures for install in Tray Ration Heater (TRH)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.351"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.351"
                                            },
                                            "Text": {
                                                "val": "Will coordinate and conduct demonstration & validation (DV) of prototypes to support modification\/replacement of USMC field feeding equipment. Will transition to 6.5."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Inter-service Field Feeding Burner"
                                    },
                                    "Description": {
                                        "val": "Develop a Joint-Service, government owned JP-8 fuel fired burner for field kitchen appliances. Government will control configuration, procurement, and support decisions. Establish parts list using widely supportable supply chain in field operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.143"
                                            },
                                            "Text": {
                                                "val": "Used the burner baseline developed in this program to qualify acceptable appliance designs that interface properly with the burner. Integrated technical data package into appliance configuration control documentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Purpose Individual Heating Technology (MIT)"
                                    },
                                    "Description": {
                                        "val": "Develop a disposable, lightweight heating mechanism as a low-cost component of the Meal, Cold Weather\/Long Range Patrol (MCW\/LRP) to facilitate preparation of operational rations in extreme environments with reduced resource requirements and increased ease of use."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.315"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.315"
                                            },
                                            "Text": {
                                                "val": "Will evaluate MIT prototypes transitioned to 6.4. Will conduct in-house test and evaluation (T&E), and transition results to 6.5."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Intuitive Multi-function Kitchen Equipment (JIMKE)"
                                    },
                                    "Description": {
                                        "val": "Reduce logistics burden associated with life cycle management of Navy (USN), Air Force (USAF) and Marine Corps (USMC) foodservice equipment. Integrate diagnostic technologies to predict maintenance, reduce labor associated with troubleshooting equipment in the field, and increase mean time between failures (MTBF)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.533"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.533"
                                            },
                                            "Text": {
                                                "val": "Will develop required contract documentation to procure equipment prototypes with multi-functional capabilities for USN, USAF, and USMC. Will award contracts based on specifications for each Service and begin in-house prototype test and evaluation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy Galley and Scullery Upgrades"
                                    },
                                    "Description": {
                                        "val": "Continuously modernize foodservice operations by adding capabilities to provide optimized feeding, standardizing foodservice equipment assets fleet-wide, improving space utilization, and facilitating the continued use of the NSCM. Design, processes and equipment insertions will be implemented on legacy platforms during overhaul periods and during the new construction process on future vessels."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.445"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.445"
                                            },
                                            "Text": {
                                                "val": "Will identify advanced equipment technologies to support existing and new ship class designs to support the Galley and Scullery operations. Will conduct in-house testing of equipment recommended by Navy subject matter experts. Will transition T&E reports to USN."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Greywater Recycling for the Basic Expeditionary Airfield Resources (BEAR) Kitchen Systems"
                                    },
                                    "Description": {
                                        "val": "Leverage NDI and COTS greywater filtration technologies to reduce operating and support (O&S) costs for the BEAR kitchen system."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.337"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.337"
                                            },
                                            "Text": {
                                                "val": "Will review current Army science & technology efforts related to greywater recycling systems and conduct market research of existing commercial systems. Will prepare Statements of Work (SOWs) and other required contract documents. Will award contract to procure a greywater system to support Air Force BEAR kitchen and sanitation operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modular Integrated Kitchen System (MIKS)"
                                    },
                                    "Description": {
                                        "val": "Design a standardized mounting system for all Galley equipment to significantly reduce technical labor skills required to complete deck modifications. MIKS will standardize electrical and water requirements, enhance procurement options, decrease O&S costs, and increase the speed of installing new technologies into the Galley\/Scullery areas."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.319"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.319"
                                            },
                                            "Text": {
                                                "val": "Will identify and evaluate potential NDI\/COTS solutions. Will prepare SOWs and other required contract documents. Will award contract to build integrated modular rail system to support integration of equipment into galley operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Logistics Agency (DLA)"
                                    },
                                    "Description": {
                                        "val": "Support management of the Department of Defense (DoD) Electronic Document Access (EDA) and Wide Area Workflow (WAWF) programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.556"
                                            },
                                            "Text": {
                                                "val": "Funded DLA Document Services to support management of the DoD EDA and WAWF programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.021"
                                            },
                                            "Text": {
                                                "val": "Fund DLA Document Services to support management of the DoD EDA and WAWF programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.410"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.410"
                                            },
                                            "Text": {
                                                "val": "Will fund DLA Document Services to support management of the DoD EDA and WAWF programs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDT&E 654713.548"
                                    },
                                    "Title": {
                                        "val": "Military Subsistence System 654713.548"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.983"
                                        },
                                        "CurrentYear": {
                                            "val": "1.430"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.759"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.759"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.358"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.472"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.148"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.178"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E 654713.EL2"
                                    },
                                    "Title": {
                                        "val": "Army Field Feeding Equipment 654713.EL2"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "0.333"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.295"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.295"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.867"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.598"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.966"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.994"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E 643747.EL1"
                                    },
                                    "Title": {
                                        "val": "Army Field Feeding Programs 643747.EL1"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "0.280"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.948"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.948"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.452"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.509"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPA M65801"
                                    },
                                    "Title": {
                                        "val": "Refrigerated Containers M65801"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.290"
                                        },
                                        "CurrentYear": {
                                            "val": "9.486"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.459"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.459"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.732"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.660"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.165"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.253"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Project development will transition to Engineering & Manufacturing Development and production."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Combat Feeding Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RDECOM, Natick, MA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.428"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.357"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.574"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.574"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIR+STTR"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.117"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.117"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DLA Bill Pay"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.564"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.556"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.021"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.410"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.410"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.551"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Joint Service Food\/Combat Feeding Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RDECOM, Natick, MA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "37.381"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.028"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.237"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.237"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Joint Service Food\/Combat Feeding Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "25.636"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.106"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.726"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.726"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Joint Service Food\/Combat Feeding Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DTC\/AEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "National Capitol Region"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.281"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.301"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Joint Service Food\/Combat Feeding Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.352"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.352"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.352"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98189-24.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "98189-25.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "98189-26.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Evaluate MRE, FSR, MCW\/LRP and MORE improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evaluate MRE, FSR, MCW\/LRP and MORE improvement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evaluate UGR Enhancements improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evaluate UGR Enhancements improvement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition advanced development of individual and group ration components to EMD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition advanced development of individual and group ration component to EMD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Provide NAVSUP w\/CPI, evaluations and menu development to support NSCM upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Provide NAVSUP w\/CPI, evaluations and menu development to support NSCM upgrade"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct in-house T&E of MIT heating prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "USMC Field Kitchen Modernization Effort"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition of Advanced Appliances for Field Kitchens- DV of Prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition of Advanced Appliances for Field Kitchens- DV of Prototype"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Receive approval for Navy use of NFSAT software"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Identify candidate burner technology for potential integration into comm"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Identify, procure, and evaluate candidate burners for tray ration heater reset"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Procure ETRHS sinks"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop Engineering Change Proposal for Diesel\/Electric TriCon Refer System"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Build standalone capability for Diesel\/Electric powered TRCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Award contract to integrate improved refer unit with MTRCS platform"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Coordinate packaging specifications with ration assemblers\/producers"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct technology demonstration of Ice Making Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop performance specs based on DV of Ice Making Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Dem\/Val JP8 burners for Enhanced Tray Ration Heater System-USMC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DV on Block Upgrade Improvements to support modification of USMC equipment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complete development and in-house T&E of MIKS prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Identify and procure JIMKE prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct in-house T&E of JIMKE equipment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ID and evaluate advanced Galley\/Scullery equipment for transition to USN"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct DV of Galley\/Scullery equipment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Identify and procure prototype greywater system"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct in-house\/APG T&E of greywater recycling prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C08"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Equipping Force"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.285"
                        },
                        "CurrentYear": {
                            "val": "4.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.259"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.259"
                        },
                        "BudgetYearTwo": {
                            "val": "5.809"
                        },
                        "BudgetYearThree": {
                            "val": "5.821"
                        },
                        "BudgetYearFour": {
                            "val": "5.830"
                        },
                        "BudgetYearFive": {
                            "val": "5.828"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Equipment mix and configuration may change based on changes in operational environment and circumstances."
                        },
                        "ProjectMissionDescription": {
                            "val": "This R-Form reflects two (2) separate organizations; The Rapid Equipping Force(REF) and the Asymmetric Warfare Group (AWG).  \n\nAll funding figures reflect only REF.  AWG request is not reflected in funding figures.\n\nThe Rapid Equipping Force (REF) supports Combatant Command (COCOM)\/Army Service Component Command (ASCC) based on emerging rapid equipment requirements.   The REF is an enduring organization (Base funded) per Headquarters, Department of the Army, memo, SUBJECT:  Implementation Plan for Stabilization of the Rapid Equipping Force (REF), signed by the Under Secretary of the Army:  Joseph W. Westphal, dated 30 January 2014. \n\nThe REF harnesses current and emerging technologies to provide rapid solutions to U.S. Army Forces employed globally.  The REF combines and integrates functions that cross several Army staff elements and ASCCs to accelerate materiel solutions and technology insertion to U.S. Army Forces employed globally.  The REF is the Army's quick reaction capability with the ability to develop, prototype, acquire, integrate and sustain Commercial-Off-The-Shelf (COTS), Government Off-The-Shelf (GOTS) and Non-Developmental Item (NDI) solutions to meet urgent combat requirements for forces employed globally.  It develops and inserts selected future force technologies, capabilities, and surrogate materiel solutions into deployed, deploying, select prepared to deploy, and transformational forces for operational evaluation, assessment, and evolutionary development.  The REF assesses the provided capabilities to improve future solutions, to inform future Army capability requirements and to potentially transition the capability to an Army acquisition program.  \n\nThe REF bridges the gap between the traditional acquisition process and immediate equipping needs.  The REF pursues tangible solutions that can be equipped rapidly with a goal of 180 days.  The REF focuses on finding immediate and effective game-changing capabilities to increase Soldier effectiveness, protection, and lethality in any operational environment.  The REF process provides the mechanism to respond rapidly to an adaptive enemy who changes in days and months, not years.  The REF coordinates in theater work with the ASCC of the COCOMs to understand their urgent needs, for which the REF acquisition capability may identify, procure, deliver, and sustain solutions to the deployed units.  This fiscal flexibility is significant in that it permits the REF to allocate funds against emerging threats and requirements in the year of fiscal execution.  \n\nThe REF works directly with Operational Commanders at all levels, but focuses on Brigade level and below to find solutions to identified capability gaps.  These solutions may result in procurement of new or existing military\/commercial materiel equipment, or accelerated development of a future force materiel solution for insertion into the current force now.  \n\nThe Army Acquisition Executive designated Program Executive Office (PEO) Soldier as the Milestone Decision (MDA) to institutionalize the acquisition authorities in support of the REF and to provide proper acquisition oversight while enhancing visibility of these efforts.  The MDA will ensure flexibility and speed focused on the needs of Soldiers serviced by the dedicated REF Program Management Office (PMO).   This establishes a formal acquisition - reporting chain that leverages - existing reporting venues, to ensure appropriate ASA (ALT) visibility, oversight, and direction.  \n\nThe REF capabilities cross all Warfighter Function Areas:\n1 – Mission Command\n2 – Movement and Maneuver\n3 – Intelligence \n4 – Fires\n5 – Sustainment\n6 – Protection \n\nThe REF FY17 RDT&E request $3.259 million (Base) is for system integration, testing and evaluation to support project requirements. \n  \nThe RDT&E funding also provides the REF the flexibility to invest in near-term, innovative solutions.  RDT&E funds are necessary in the vast majority of all REF projects.  Most importantly, REF requires RDT&E funds to conduct safety certification (testing) for REF provided non-standard equipment before it is equipped to the unit.  This critical requirement exists to ensure that the equipment is safe for Soldiers to use and that any risks are known and documented.  The REF also requires RDT&E funds to integrate several different COTS\/GOTS\/NDI technologies into one capability that solves the tougher and more complex problems.  RDT&E funds are used to further develop high (>6) Technology Readiness Level (TRL) systems or advanced technologies in conjunction with industry and Other Governmental Agencies (OGAs).  Frequently, these technologies only need small amounts of funding in order to help them achieve a maturity level that is suitable to solve deployed U.S. Army Forces problems.  The REF requires RDT&E funds in order to modify existing technologies that were developed for one purpose, but now may be suitable to solve another problem.   REF will fund deliberate projects in support of technology solution scouting to meet anticipated needs.  These efforts measure and identify current technologies and provide capability assessments to TRADOC and other organizations with the intent of informing future requirements.  Example efforts that may require RDTE include the following projects:  Nano Unmanned Aerial System (UAS) Assessment; Carbine Optics; Command, Control, Communications, Computers, Combat System, Intelligence, Surveillance, and Reconnaissance (C5ISR); Small Unit Intelligence Surveillance Reconnaissance (ISR); Electronic Warfare; Counter Unmanned Aerial System (UAS); Operational Energy; Mission Command; and Force Protection.\n\n\nMission Description AWG:  The Asymmetric Warfare Group (AWG) provides critical operational advisory support globally and rapid solution development to Army and Joint Force Commanders to enhance Soldier survivability and combat effectiveness, continuously assesses the Operating Environment (OE), to defeat current and emerging threats.  As such, AWG is uniquely positioned to quickly provide feedback and observations of asymmetric threats back to TRADOC Centers and Schools allowing for the timely adaptation of training, Programs of Instruction and informing capability requirements of future forces.  \n\nWith its theater access, AWG continues to serve in its advisory capacity to assist regionally aligned forces (RAF), support ASCC security cooperation missions, as well as inform Army innovation programs. In times of crisis, the AWG will continue to be a critical combat enabler to Army and Joint contingency force deployments responding to a diverse range of theater threats and requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rapid Equipping Force"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.285"
                                            },
                                            "Text": {
                                                "val": "The demand for REF 10-liner requirements has levels based on the increased tempo of transitioning brigades in Operation Freedom Sentinel (OFS) with nine (9) month deployments; the expansion of brigades’ operational environments (OEs) that required smaller units to operate in more isolated areas; and a new force structure and role in OFS.  At the end of FY15, the REF had 604 total requirement’s - 513 were OCO requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "The REF mission expands to perform Direct Support (DS) to globally deployed Soldiers, ASCCs of the Combatant Commands, regionally aligned Brigade Combat Teams (BCTs) and includes support to Operation Freedom Sentinel (OFS) in Afghanistan, Operation Inherent Resolve (OIR) in Iraq, and other operations in the CENTCOM and AFRICOM areas of responsibility.  During the same period, the REF expects to see an increase in requirements submitted by Army Special Operations Forces (SOF) in other areas of the world, as well as, from brigades employed in more global roles, such as the regionally aligned BCTs, and their logistical support elements.  The REF also expects to play a much more deliberate role in providing support to the Army's Global Response Force as they prepare for a wider range of response missions.  \n\nFor FY16 the REF projected 664 requirements (101 Base, 563 OCO).   The projection was based on the requirements demand signal and modified using the following planning assumptions:\n\n1) Based on expanding Army operations worldwide we anticipate significant requirements from deployed Army forces in non-OCO regions.\n2) There is no change in the OMB OCO criteria and guidance,\n3) The number of troops deployed to Afghanistan\/OFS (~10K) and the types of missions they are performing remains constant through June 2016 then maybe reduced by 50% for the remainder of the year,\n4) The number of troops deployed to Iraq\/OIR (~4K) and the types of missions they are performing remains unchanged, \n5) And, there is no significant change in the level of operational support to Counter-ISL operations outside of Iraq.\n\nA change to any of these assumptions could have significant impact on the number and type of requirements received, and upon the type of funding (OCO or Base) required.  For example, any change in OCO guidance could significantly change the ratio of OCO to Base funding required.  Likewise, if troops deployed to OIR are given the mission to accompany Iraqi Security Forces during the anticipated counter-offensive REF could expect a significant increase in Warfighting function requirements for mission command, intelligence, movement and maneuver, and force protection.  In OFS, a decision to retain current manning levels may similarly effect the number of requirements REF receives in FY16."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.259"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.259"
                                            },
                                            "Text": {
                                                "val": "TThe REF partners with ASCCs forces and Army SOF community to perform DS to globally deployed Soldiers and regionally aligned BCTs.  The REF anticipates increased uncertainty regarding the future of OIR and other operations in the CENTCOM AOR requiring additional flexibility to develop technological solutions supporting the reduced numbers of Soldiers operating globally in order to fill force protection gaps in the face of a smaller and more lethal terrorism threat.  The REF expects to increase our engagement with the ASCCs in order to address capability gaps generated by geographical and environmental constraints and improve our understanding of evolving threats and operating conditions within the respective ASCC areas of operations.   The REF also expects to play a much more deliberate role in providing support to the Global Response Force as they prepare for a wider range of response missions.  We anticipate increased coordination with various Army technology demonstrations and Joint Capabilities Technology Demonstrations in order to leverage developed residual technologies to rapidly address identified critical capability gaps and gain immediate feedback through limited user evaluations.   In accordance with REF’s participation in the Office of Secretary of Defense (OSD) led quick reaction capability effort, the Army determined the REF would provide the Army’s warm base capability with ~100 requirements in FY17 and beyond.\n\nFor FY17 the REF projects ~100 requirements in the following REF Warfighter function areas.\n\n1 – Mission Command (344K)\n2 – Movement and Maneuver (782K)\n3 – Intelligence  (254K)\n4 – Fires  (34K)\n5 – Sustainment (333K)\n6 – Protection  (512K)\n\nThe REF anticipates ATEC testing and evaluation cost of $1.000 million. The REF requires RDT&E funds to test technologies in order to ensure suitability and safety before equipping the Soldier – any modified COTS\/GOTS\/NDI items has to be tested.\n\n\nAWG is uniquely postured to support unified land operations to mitigate future risk to Army forces resulting from non-traditional and hybrid threats.  AWG supports solution development and equipping efforts with operational advising\/global first hand observation, but does not conduct materiel acquisition without an appropriate acquisition partner; investment funding is required to legally execute the breadth of AWG’s solution development mission. The use of investment fund is kept to a minimum to accomplish proof of concept and threat replication IOT influence the Army’s capacity to adapt to the evolving threat while informing subsequent TRADOC DOTMLPF-P integration.  AWG will focus efforts to investigate, evaluate, and quantify various Commercial-Off-The-Shelf \/Government-Off-The-Shelf platforms and systems for purposes of research and development, testing, capability and limitation experimenting, and procurement for solutions to emerging capability gaps.  These efforts will focus on near term, leveraging existing technology, and addressing identified capability gaps for emerging research shortfalls, PIPs, leap ahead technologies, and fixes to existing shortfalls (reliability, sustainability, and durability).  \n\nThe AWG RDTE Base request for FY17 is $250K.  The AWG request is not reflected in funding figures on this R-Form."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "M08101"
                                    },
                                    "Title": {
                                        "val": "Other Procurement Army,  M08101"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "22.380"
                                        },
                                        "CurrentYear": {
                                            "val": "26.437"
                                        },
                                        "BudgetYearOne": {
                                            "val": "26.503"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.003"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "8.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.459"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.867"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.246"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.631"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "121018000"
                                    },
                                    "Title": {
                                        "val": "Operations and Maintenance, Army, 121018000"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "125.462"
                                        },
                                        "CurrentYear": {
                                            "val": "31.167"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "29.831"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "15.169"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "19.743"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.643"
                                        },
                                        "BudgetYearFour": {
                                            "val": "20.036"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.436"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The REF harnesses current and emerging technologies to provide rapid solutions to the urgently required capabilities of U.S. Army Forces employed globally.   The REF focus is on rapidly placing capabilities into Soldiers' hands.  This mission is accomplished in one of two ways: rapidly adapting COTS\/GOTS\/NDI equipment to meet operational needs and developing emerging deployable capability via interaction with research and development organizations and academia.  All capabilities are safety tested prior to insertion into operational environments.  Training and sustainment are provided for every capability until it is transitioned to an approved acquisition program or terminated through an approved Army process.  Operational assessments are conducted to provide feedback in support of Army requirements generation and future capability development.  REF capabilities routinely serve as a bridge to specific ONS, JUONS, and JEONS gaps to meet urgent operational requirements."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Mission Command"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.344"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.344"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.344"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Movement and Maneuver"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.782"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.782"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.782"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Intelligence"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.254"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.254"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.254"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Fires"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.034"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.034"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.034"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sustainment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.333"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.333"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.333"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Protection"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.512"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.512"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.512"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dismounted Improvised Explosive Device (IED) Defeat"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.360"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.381"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.153"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dismounted Operations Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.168"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.952"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.698"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Intelligence, Surveillance, and Reconnaissance (ISR) Shortfalls in Environmentally Inhospitable OEs"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.715"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.779"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.472"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Small Combat Outpost (COP) \/ Patrol Base (PB) Force Protection and Sustainment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.738"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other-REF RIPL Priorities (5-10)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.778"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.796"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.682"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.752"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.230"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Base: Various Projects-Protect the Force in Counter Insurgency"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.841"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.841"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Small Combat Outpost (COP)\/Patrol Base (PB) Sustainment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.648"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.555"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.313"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.516"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Base: Various Projects-Enhance Intelligence Surveillance Recon"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.009"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.009"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Small Combat Outpost (COP)\/Patrol Base (PB) Force Protection"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.870"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.746"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.492"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.108"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dismounted Blue Force Tracking and Mission Command"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.222"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.190"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.120"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.532"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Base: Various Projects-Logistics\/Medical in Counterinsurgency Ops"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.639"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.639"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Base: Various Projects-Timeliness of Analysis and Information Dissemination"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.961"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.961"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Congressional Add-Squad Mission Support System (SMSS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.600"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SSTR\/Economic Assumptions\/FFRDC and SBIR"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.090"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.090"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "OCO: Rapid Equipping Force"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "19.190"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "19.190"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ATEC (REF Integrated Priority List 1-10)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.344"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ATEC (Warfighter Function Areas)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ATEC (REF Integrated Priority List 1-7)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98189-27.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "n\/a"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EL1"
                    },
                    "ProjectTitle": {
                        "val": "Army Field Feeding Programs"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.280"
                        },
                        "BudgetYearOne": {
                            "val": "1.948"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.948"
                        },
                        "BudgetYearTwo": {
                            "val": "0.452"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.509"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.189"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "2016 shall be the first funded year for the Army Field Feeding Programs Element."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the advanced component development and prototyping of Army food and combat feeding equipment designed to reduce the logistics burden and Operation and Support (O&S) costs of subsistence support to service personnel. Project supports development of rapidly deployable field food service equipment in coordination with ration development efforts. Project conducts demonstration and validation of improved subsistence support items used to enhance soldier effectiveness and quality of life in the Army and the other military Services, as coordinated with the Department of Defense (DoD) Food Research, Development, Test, Evaluation and Engineering Program. This project develops critical enablers that support the Joint Future Force Capabilities and the Joint expeditionary mindset by maintaining readiness through fielding and integrating new equipment. This equipment enhances the field soldier's well-being and provides the soldier with usable equipment, in addition to reducing sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, combat zone footprint, and costs for logistical support.\n\nThis PE\/Project supports Field Feeding programs for the Army."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Battlefield Kitchen (BK) technology development effort"
                                    },
                                    "Description": {
                                        "val": "Provide replacement of the obsolete Mobile Kitchen Trailer (MKT) system. The BK shall replace the MKT with a kitchen that provides fuel efficient, thermally controlled, closed combustion appliances within an environmentally controlled workspace. The BK shall provide rations for up to 300 Soldiers within 4 hours of setup. The BK provides refrigeration, running water and a heated serving line using the same off-road prime mover as the MKT as well as transportability by rail, sea, fixed and rotary wing aircraft."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.280"
                                            },
                                            "Text": {
                                                "val": "Complete evaluation of appliances integrated with Jet Propellant 8 (JP-8) fired burners developed in the Science and Technology (S&T) phase as culmination of technology transfer agreement.  Complete documentation for development contract that includes options for production."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.948"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.948"
                                            },
                                            "Text": {
                                                "val": "Complete transition of BK into Engineering and Manufacturing Development (EMD) phase. Complete design and build of BK component and subsystems. Initiate Integrated Logistics Support (ILS) development through the development contract."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDT&E 654713.548"
                                    },
                                    "Title": {
                                        "val": "Military Subsistence System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.983"
                                        },
                                        "CurrentYear": {
                                            "val": "1.430"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.759"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.759"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.358"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.472"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.148"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.178"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E 654713.EL2"
                                    },
                                    "Title": {
                                        "val": "Army Field Feeding Equipment"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "0.333"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.295"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.295"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.867"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.598"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.966"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.994"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E 643747.610"
                                    },
                                    "Title": {
                                        "val": "Food Adv Dev"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.348"
                                        },
                                        "CurrentYear": {
                                            "val": "0.021"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.299"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.299"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.579"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.830"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.508"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.631"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPA M65806"
                                    },
                                    "Title": {
                                        "val": "Assault Kitchen, Field Feeding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.889"
                                        },
                                        "CurrentYear": {
                                            "val": "3.632"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.167"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.167"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.660"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.165"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.605"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Project development will transition to System Development & Demonstration and into production after thorough testing."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Force Sustainment"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.274"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.274"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.424"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Battlefield Kitchen"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-FSS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.130"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.674"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.674"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.804"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Battlefield Kitchen"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DTC\/AEC\nPM-FSS,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick Ma"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98189-28.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Conduct advanced component development and demonstration for th BK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition Battlefield Kitchen to EMD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Award advanced component development contract for DESERT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct advanced component development and demonstration for DESERT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complete ECP and transition DESERT to EMD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct advanced component development & demonstration on advanced refrigeration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}