{
    "id": "a2fc33f2cfdbb9839b5f256171b76a19ce2cd145",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603725N"
        },
        "ProgramElementTitle": {
            "val": "Facilities Improvement"
        },
        "R1LineNumber": {
            "val": "63"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "6.882"
            },
            "PriorYear": {
                "val": "2.588"
            },
            "CurrentYear": {
                "val": "3.726"
            },
            "BudgetYearOne": {
                "val": "5.458"
            },
            "BudgetYearOneBase": {
                "val": "5.458"
            },
            "BudgetYearTwo": {
                "val": "3.772"
            },
            "BudgetYearThree": {
                "val": "3.643"
            },
            "BudgetYearFour": {
                "val": "3.708"
            },
            "BudgetYearFive": {
                "val": "3.780"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Mission Description and Budget Item Justification: \n\nThis program provides for capabilities to: a) overcome performance limitations and reduce the life cycle cost of shore facilities and, b) provide protection against terrorist attacks for shore installations and their operations. The program focuses on technical and operational issues of specific Navy interest, where there are no unbiased test validated Commercial Off the Shelf (COTS) solutions available, and where timely capabilities may not materialize without specific demonstration or validation by the Navy. Additionally, the program completes the development of technologies originating from Navy, DOD and other sources of Science and Technology programs, including the National Science Foundation (NSF), the National Institute of Standards and Technology (NIST) and Department of Energy (DOE). Validated technologies are implemented in the Navy's Military Construction (MILCON) and Facilities, Sustainment Restoration and Modernization (FSRM) program, and Antiterrorism and Force Protection (ATFP) Other Procurement, Navy (OP,N) program. \n\nProject 0995 addresses the following Navy facilities requirements during FY 2014 through FY 2020: Advance Technology for Waterfront Facilities Repair and Enhancements, Facilities Technologies to Reduce the Cost of Facilities Sustainment, Restoration and Modernization for reducing the total ownership cost (TOC) of future and existing Facilities and addressing natural and catastrophic risk of critical Naval Waterfront Facilities. This project is consistent with recommendations of two National Academy of Sciences Reports: \"The Role of Federal Agencies in Fostering New Technology and Innovation in Building\" and \"Federal Policies to Foster Innovation and Improvement in Constructed Facilities.\" \n\nStarted in FY2006 the Force Protection Ashore Project 3155 addresses selective topics in modeling, and material technologies to reduce the vulnerability of installations; and reduce the acquisition and operating costs of protective technologies. The demonstrations and validations provide the independent, technical and operational test data for the development of competitive performance specifications to acquire the required capabilities. The ATFP project is coordinated with other DOD programs.\n\nProject 3347: The Development of advanced Environmental Control Unit (ECU) for expeditionary force camp shelters project is a transition of a DOE FY12-14 funded project and is a continuation in technology development, and was transitioned to NAVFAC starting FY 2015."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.588"
                },
                "CurrentYear": {
                    "val": "5.226"
                },
                "BudgetYearOne": {
                    "val": "5.171"
                },
                "BudgetYearOneBase": {
                    "val": "5.171"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.588"
                },
                "CurrentYear": {
                    "val": "3.726"
                },
                "BudgetYearOne": {
                    "val": "5.458"
                },
                "BudgetYearOneBase": {
                    "val": "5.458"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-1.500"
                },
                "BudgetYearOne": {
                    "val": "0.287"
                },
                "BudgetYearOneBase": {
                    "val": "0.287"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-1.500"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.287"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.287"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 decrease in Facilities Improvement RDTEN by $0.135M as required for the Department of the Navy to comply with the Bipartisan Budget Act of 2015."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0995"
                    },
                    "ProjectTitle": {
                        "val": "Naval Facilities System"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.799"
                        },
                        "PriorYear": {
                            "val": "0.816"
                        },
                        "CurrentYear": {
                            "val": "1.154"
                        },
                        "BudgetYearOne": {
                            "val": "2.066"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.066"
                        },
                        "BudgetYearTwo": {
                            "val": "2.181"
                        },
                        "BudgetYearThree": {
                            "val": "2.130"
                        },
                        "BudgetYearFour": {
                            "val": "2.168"
                        },
                        "BudgetYearFive": {
                            "val": "2.209"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program provides the Navy with new engineering capabilities that are required to overcome specific performance limitations of Naval shore facilities while reducing the cost of sustaining the Naval shore infrastructure. The program focuses available RDT&E resources on satisfying facility requirements where the Navy is a major stakeholder or where there are no tested validated Commercial Off the Shelf (COTS) solutions available, and a timely solution will not emerge without a Navy sponsored demonstration and validation. The program completes the development and validation of facility technologies originating in Navy science and technology programs, plus a variety of other sources which includes the National Science Foundation (NSF) and the National Institute of Standards and Technology (NIST). Validated technologies are implemented in the Navy's Military Construction (MILCON) and Facilities Sustainment Restoration and Modernization Programs (FSRM). The Duncan Hunter National Defense Authorization Act of 2009 laid down very specific guidelines for the correction of corrosion deficiencies in DoD shore facilities which is estimated to be $1.9B (DOD Annual Cost of Corrosion for the Department of Defense Facilities and Infrastructure July 2010).\n\nProject 0995 addresses two Navy facilities requirements: 1) waterfront facilities repair, upgrade and service life extension; and, 2) validation testing\/performance monitoring of critical facilities (such as dry docks, piers, runways, magazines, etc.), testing and evaluation of the performance of alternative materials, and surfacing concepts, and, methods and corrosion technologies to reduce the cost of Sustainment, Restoration and Modernization (SRM).\n\nWaterfront facilities, repair, upgrade and service life extension:\nAn urgent requirement exists for early identification of strategies and solution recommendations for seismic risk at Naval Facilities, and especially nuclear capable waterfront facilities. Recent Pacific Rim earthquakes have heightened anxiety levels on perceived huge risks to Navy waterfront facilities in the region. The sub-project will provide analysis and solution recommendations for facilities impacted by seismic risk. Waterfront facilities repair and upgrade: About 75% of the Navy's waterfront facilities are over 45 years old. They were designed for a service life of 25 years which was to satisfy the mission requirements existing at that time. The over aged reinforced concrete requires costly and repetitive repairs. Besides providing more pier side ship maintenance and thus reduce dry dock costs, these piers must be strengthened to support concentrated crane loads up to 140 tons when piers were originally not designed for concentrated loads. Piers were previously designed to service one or possibly two particular ship classes. Berthing flexibility is now limited by mooring and utility arrangements. This sub-project addresses new material design methods, and retrofit methods which extends the service life of existing waterfront facilities by an additional 15 or more years. The project also addresses updating the mission based service, environmental, and protection loading requirements imposed by changes in platforms, operations and threats. Other initiatives include: leveraging Building Information Modeling (BIM) technology to provide for enhanced facilities management processes and waterfront utilities service enhancements using models to achieve flexible berthing arrangements consistent with current and future platform mooring configurations and hotel service requirements including Facilities and Infrastructure Integrated Product Support for Acquisition Category (ACAT) Programs.\n\nTechnologies to reduce the cost of Sustainment, Restoration and Modernization (SRM):\nTechnologies to reduce the cost of SRM issues of high operational significance are addressed on a priority basis. The Navy portion of corrosion deficiencies at DoD shore facilities is estimated to be $433M (DOD Annual Cost of Corrosion for the Department of Defense Facilities and Infrastructure July 2010). This effort will demonstrate and validate the cost and reliability of advanced corrosion technologies in order to assure their acceptance and implementation in traditionally conservative public works and construction industries. These facility corrosion technologies will accelerate the validation commercialization, and wide-spread implementation required to reduce the cost of correcting, the deficiencies in the Navy SRM backlog. The sub-projects include the continuing effort to validate, test and conduct performance monitoring of enhanced facility designs and coatings for facilities and equipment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Waterfront facilities, repair, upgrade and service life extension:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued waterfront seismic analysis and standard seismic risk mitigation procedures for other dry docks and critical waterfront structures. Continued synthetic line evaluation for ship fendering. Completed development of durable green concrete and initiate transition criteria for integration into unified facilities criteria. Initiated identification and validation of operational and maintenance issues of waterfront facilities associated with supporting the Navy's new class of ships and submarines, including the Ohio Class Replacement Submarine. Initiated performance enhancement for small floating piers. Initiated tsunami loads and effects on critical Navy waterfront structures. Initiated assessing waterfront asset component data through SPIDERS 3D."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans are to complete waterfront seismic analysis and standard seismic risk mitigation procedures for a CVN\/Ship in dry-dock. Continue to identify and validate operational and maintenance issues of waterfront facilities associated with supporting the Navy's new class of ships and submarines, including the Ohio Class Replacement Submarine. Continue with performance enhancement of small floating piers. Complete tsunami load and effects on critical navy waterfront structures. Initiate Sea Level Rise effects on Navy waterfront structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.807"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.807"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans are to:\n\nComplete Ultra High Performance Concrete for Structural Repairs and Modular Construction:\nIdentify where to use ultra-high performance concrete (UHPC) for repairs. Test and evaluate repair methods for cost and durability. Findings will transition into unified criteria.  \n\nContinue Floating Pier Eval hydrodynamics:\nConduct failure analysis and develop retrofit methods for floating piers. Conduct field tests of retrofit methods to confirm analysis. Findings will transition into unified criteria.  \n\nContinue Engineered Cementitious Composite (ECC) for Reinforced Concrete Repairs:\nTest and evaluate the use of ECC in highly corrosive environments as a repair material for reinforced concrete structures. Findings will transition into unified criteria.  \n\nContinue Structural numerical joint Analytics:\nBuild numerical models of structural joints subject to wave and tidal motions such as those found in dry docks, piers and wharves. Use models to improve joint design through dynamic analysis and model refinement. Findings will transition into unified criteria.  \n\nInitiate Sea Level Rise effects on Navy waterfront structures:\nUse existing forecasts of sea level rise as a basis for modelling wave, tidal and storm surge effects on structures.  Model mitigation measures and analyze cost-benefit to identify most effective retrofit methods and systems.  \n\nInitiate autonomous inspection technologies and systems for waterfront facilities:\nDefine requirements for autonomous inspection technology including use below the waterline. Identify autonomous technologies and systems to test against requirements. Test and evaluate technologies. Findings will transition into unified criteria."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sustainment, Restoration & Modernization:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.546"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed cold spray corrosion repair and expedient pipeline repair for petroleum, oil and lubrication (POL) facilities. Initiate verifying the effectiveness of vapor phase corrosion inhibitors in protection of aboveground storage tanks. Continued high temperature pavement design mix optimization to improve cost, performance, and integration with other new aviation platforms such as the MV-22. Continued seismic analysis of Earth Covered Magazines (ECM). Completed testing of locking device System for Modular Storage Magazine. Continued improved concrete construction and crack repair technologies utilizing affordable and green aggregate constituents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.854"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The projects continued from FY15 are: Continue Corrosion Prevention & Control projects, emphasizing sustainable design and improved lifecycle cost reductions. Complete high temperature pavement design mix optimization to improve cost, performance, and integration with other new aviation platforms. Complete seismic analysis of Earth Covered Magazines (ECM). Continue with verifying the effectiveness of vapor phase corrosion inhibitors in protection of aboveground storage tanks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.259"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.259"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans are to:\n\nComplete Viscous Elastic Coatings:\nEvaluate cost effectiveness and durability of coatings to protect fuel and utility pipelines against corrosion.  Findings will transition into unified criteria.  \n\nComplete Durable Concrete Repairs:\nEvaluate cost effectiveness and durability of coatings to protect reinforced concrete against corrosion. Findings will transition into unified criteria.  \n\nComplete Verifying the Effectiveness of Vapor Phase Corrosion Inhibitors (VpCI) in Protection of Aboveground Storage Tanks:\nEvaluate VpCI probes and conduct validation testing. Findings will transition into unified criteria.  \n\nComplete Water Storage Tank Galvanic Anode Cathodic Protection Controller:\nEvaluate galvanic anode cathodic protection (GPC) systems at selected installations for cost, installation, performance and durability. Analyze results and recommend performance specifications for GPC systems. Findings will transition into unified criteria.  \n\nInitiate analysis of additive manufacturing capabilities for facilities and infrastructure for both new and existing assets:\nInvestigate existing and projected applications of additive manufacturing (AM) to facilities and infrastructure.  Define requirements for AM technology applications. Procure and evaluate AM technology against requirements in developmental and operational tests. Findings will transition into unified criteria."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Projects identified in this budget have been carefully selected to respond to both the facilities support for new Acquisition Category Programs, to address TOC considerations of an evolving and aging infrastructure, and to facilitate rational risk based decisions and solutions to protect and decrease risk levels for Department of the Navy-critical infrastructure and facilities. Each project has been assessed to ensure that it is addressing legitimate risks and requirements of the shore establishment. The results of these projects will be the development of design and construction criteria and or components that directly impact the shore facilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews are conducted with the major performers to include funds status discussion, schedule review, assessment of plan to actual to meet benchmarks at midyear and end-of-year for PY1 and CY, and review of accomplishments and issues to date."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Waterfront Facilities, Repair, Upgrade and Services Life Extension"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVFAC EXWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pt Hueneme, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.212"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.270"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.807"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.807"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sustainment, Restoration and Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVFAC EXWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pt Hueneme, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.587"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.546"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.854"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.259"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.259"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Waterfront Facilities, Repair, Upgrade and Service Life Extension"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Continue Waterfront Facilities, Repair, Upgrade and Service Life Extension"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering Coatings for Fasteners"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Carbon Fiber Reinforced Polymer Rebar for Concrete Waterfront Facilities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Seismic Risk Assessment of Dry Docks"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Floating Pier Evaluation Hydrodynamics"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Tsunami Loads and Effects on Waterfront Structures"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Autonomous Inspection Techonology and Systems for Waterfront Facilities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SPIDERS 3D Asset Component Data"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Analysis of CVN Drydock"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "ID Issues for New Class SSNs"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Sea Level Rise Effects"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sustainment, Restoration & Moderization"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Continue Sustainment, Restoration & Moderization"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Corrosion Prevention and Control"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Level Spot Treatment Protocol and Maintenance Index for Life Entersion of POL Infrastructures"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Seismic Analysis of Earth-Covered Magazines"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "High Temperature Pavement Design Mix Optimization"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Modular Storage Magazine Multi-Point Locking Device System"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Evaluate Solutions to Develope Design and Contruction Criteria"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Retrofitting Existing Facilities to Conform to High Performance Building Standards"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Develope Design Criteria for Closed Piers and Wharves"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Effectiveness of Vapor Phase Corrosion Inhibitors in Protection of Aboveground Storage Tanks"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3155"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Ashore"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1.083"
                        },
                        "PriorYear": {
                            "val": "1.286"
                        },
                        "CurrentYear": {
                            "val": "0.575"
                        },
                        "BudgetYearOne": {
                            "val": "1.230"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.230"
                        },
                        "BudgetYearTwo": {
                            "val": "1.591"
                        },
                        "BudgetYearThree": {
                            "val": "1.513"
                        },
                        "BudgetYearFour": {
                            "val": "1.540"
                        },
                        "BudgetYearFive": {
                            "val": "1.571"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Protection of Navy installations against terrorist activities requires deployment of advanced technology for force protection capabilities. This antiterrorism and force protection (AT\/FP) ashore project will develop, demonstrate and validate technologies for the following: access control and integrated perimeter security surveillance sensors and intelligent electronic security systems for automated intruder detection (Installation Protection); perimeter security; waterside protection against craft and swimmer intrusion; secure and efficient operations centers and emergency management centers including human and information support systems (Command and Control). Programs currently being evaluated are, standard-based enterprise physical security system integration and automation; Command, Control, and Communications (C3) capabilities for emergency operations; integrated and networked mass notification systems (MNS); Waterside intelligent video security systems; integrated over-the-water sensors and analytics for automated course of action planning; identifying and interdicting malevolent threats - watercraft, swimmers, divers, and unmanned underwater vessels (UUVs) to reduce injury and death to the warfighter and damage to high value units (HVUs)(Waterside Protection). Through demonstration and validation of risk modeling and simulation models, the potential of emerging technologies will be evaluated and installation security strategies that reduce manpower and other costs will be formulated. These demonstrations and validations derive advanced technology from science and technology programs of government academia and industry. The technology evaluation and validation produces data for performance specifications used for competitive procurement. All work will be coordinated with other programs and through industry forums as appropriate."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Force Protection Ashore"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.286"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed integration and demonstration of Automated  Sensor Assessment and Course of Action Plan (COAP) with EHSS and is underwent transition to NAVSEA. - Developmental Test & Evaluation (DT). \n\n- Continued Boat Barrier  project with a particular focus on environmental resilience and sustainability in an operational setting and integrated with existing Port Security Barriers and remote gate operation devices. - Spiral Development. \n\n-  Completed versatile access control project to develop, integrate and test an access control system that is open architecture, enabled biometrics and handled multiple credentials (driver's license, passport, etc.). (Spiral Development)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.575"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funds will support continue and initiated projects from FY14 and FY15 as follows: \n- Continue ship-to-shore common information exchange project, focusing on integration of a prototype system with a representative EHSS installation and testing in a controlled test environment. - [$125K] - Developmental Test & Evaluation (DT); SSC-PAC\n- Continue versatile access control project to integrate and test an enhanced access control approach, leveraging multiple credential types, biometrics and enhancing the detection of vehicles and personnel in and around an Access Control Point. - [$100K] - Developmental Test & Evaluation (DT); NSWC-Dahlgren\n- Continue Waterside Protection - Boat Barrier Electronic Infrastructure project to assess EHSS performance, environmental, and operational impact and added benefits of next generation boat barriers. - [$350K] - Operational Test & Evaluation (OT); SSC-PAC"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.230"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.230"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funds will support continued and initiated projects from FY15 and FY 16 as follows:\n  -Complete Waterside Protection - Boat Barriers project to access performance, environmental, and operational\nimpact and added benefits of next generation boat barriers. -[$267K] - Operational Test & Evaluation (OT); CTTSO\n  \n  -Initiate Installation Protection Capability Development - Airborne Threat project to detect, assess and clasisify for\nthe defense against full-scale and man-deployable airborne threats (e.g., UAV, drones, remote-control [R\/C]\nplatforms. - [$538K] - Developmental Test & Evaluation (DT); SSC-PAC\n  \n  -Initiate Command and Control Capability Development Virtual Field Support project to improve efficiency,\neffectiveness and reliability of the recovery of operational availability during critical system failures (corrective\nmaintenance) and specialized routine maintenance (preventive maintenance). - [$425K] - Developmental Test &\nEvaluation (DT); NSWC Dahlgren"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Demonstration and validation is conducted for maximum transfer and interaction with industry such as to influence the industry COTS with the results of  this demonstration and prototype validation.  Acquisition is based on performance specifications enabled by this project."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly program reviews to include funds status, schedule review and assessment of plan to actual."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "As a result of FY16 decrease in funding levels the Installation Protection Capability Development - Incident Management System (IMS) - Spiral Development project is now rescheduled for FY17 and FY18 restoral funds.Installation Protection: Access Control Automation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Command and Control Capability Development: Government Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.260"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.239"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Installation Protection: Airborne Threat"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC-PAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "SSC-PAC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.538"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.538"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.538"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Command and Control Capability Development: Virtual Field Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dahlgren, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.425"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.425"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.425"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Waterside Protection: Boat Barriers"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Navy Systems Mgmt Acty\/CTTSO"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.267"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.267"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.267"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Installation Protection Capability Development - Integrated Physical Security and Access Control Automation: Spiral Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dahlgren, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.360"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.237"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Installation Protection Capability Development -Integrated Physical Security and Access Control Automation:Test & Evaluation (DT)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dahlgren, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.260"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.189"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Installation Protection Capability Development - Integrated Physical Security and Access Control Automation:Test & Evaluation (OT)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.203"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.129"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Water Protection - Common Information Exchange Spiral Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC-PAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "SSC-PAC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.119"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.125"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Installation Protection - Versatile Access Control Spiral Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dahlgren, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.239"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Waterside Protection - Boat Barrier Electronic Infrastructure - Spiral Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC-PAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "SSC-PAC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.134"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Installation Protection Capability Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Installation Protection Capability Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Subproj: Integrated Physical Security and Access Control Automation: Spiral Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Subproj: Installation Protection - Airborne Threat: Test & Evaluation (DT)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Installation Protection - Access Control: Test & Evaluation (DT)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command and Control Capability Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Command and Control Capability Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Subproj: Command and Control Capability Development - Virtual Field Support: Test & Evaluation (DT)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Waterside Protection Capability Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Waterside Protection Capability Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Subproj: Automated Sensor Assessment and Course of Action Planning: Spiral Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Subproj: Waterside Protection: Common Information Exchange - Sprial Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Waterside Protection Boat Barriers - Test and Evaluation (OT)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3347"
                    },
                    "ProjectTitle": {
                        "val": "Navy Expeditionary Energy Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.486"
                        },
                        "CurrentYear": {
                            "val": "1.997"
                        },
                        "BudgetYearOne": {
                            "val": "2.162"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.162"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.645"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Development of advanced Environmental Control Unit (ECU) for expeditionary force camp shelters will reduce the heating and air-conditioning (HVAC) fuel consumption by 50% and also will reduce fuel transport convoys, and attendant manpower casualties and handling labor."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Environmental Control Unit  (EECU)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.486"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted engineering analysis and prepared draft solicitation package for full scale prototypes of technologies delivered by Department of Energy (DOE) Advanced Research Projects Agency - Energy (ARPA-E) at Technology Readiness Level (TRL) 6. FY12-FY14 effort to identify and mature technology was resourced by the Assistant Secretary of Defense Office of Operational Energy Plans and Programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.997"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Develop, design, and fabricate full scale prototypes (TRL 7) for technical and operational testing. One prototype is for an ECU utilizing the exhaust heat from generators which is currently wasted. Second prototype is for a new ECU based on Sterling cycle technology which is projected to reduce energy consumption by 30%."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.162"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.162"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform technical and operational testing on the prototypes. Prototypes represent technology which will (1) utilize exhaust heat and (2) utilize the Sterling cycle technology."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Development of this technology will continue in partnership with ARPA-E in FY17. The Navy is positioned to transition the technology into a procurement program once technologies are operationally test and accepted. Additionally, the Navy is pursuing methods to transition the program to the DoD Program Manager for Mobile Electric Power so that all of DoD can benefit from this latest generation, energy saving technology."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews will be conducted with the major performer to include cost, schedule, and performance risks for milestone achievement associated with the full scale prototypes"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Expeditionary Environmental Control Unit (EECU)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EXWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Port Hueneme, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.486"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.997"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.162"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.162"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 3347"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Expeditionary Environmental Control Unit (ECU)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}