{
    "id": "a63396fba3ab0948ba9d04f63cc15dc145d094f0",
    "meta": {
        "filename": "dod-2017_RDTE_2017_DARPA_U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601101E"
        },
        "ProgramElementTitle": {
            "val": "DEFENSE RESEARCH SCIENCES"
        },
        "R1LineNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "322.030"
            },
            "CurrentYear": {
                "val": "333.119"
            },
            "BudgetYearOne": {
                "val": "362.297"
            },
            "BudgetYearOneBase": {
                "val": "362.297"
            },
            "BudgetYearTwo": {
                "val": "361.151"
            },
            "BudgetYearThree": {
                "val": "365.461"
            },
            "BudgetYearFour": {
                "val": "372.674"
            },
            "BudgetYearFive": {
                "val": "376.113"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Research Sciences Program Element is budgeted in the Basic Research Budget Activity because it provides the technical foundation for long-term National Security enhancement through the discovery of new phenomena and the exploration of the potential of such phenomena for Defense applications.  It supports the scientific study and experimentation that is the basis for more advanced knowledge and understanding in information, electronic, mathematical, computer, biological and materials sciences.\n\n     The Bio\/Info\/Micro Sciences project will explore and develop potential technological breakthroughs that exist at the intersection of biology, information technology and micro\/physical systems to exploit advances and leverage fundamental discoveries for the development of new technologies, techniques and systems of interest to the DoD.  Programs in this project will draw upon information and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels. \n\n     The Math and Computer Sciences project supports long term national security requirements through scientific research and experimentation in new computational models and mechanisms for reasoning and communication in complex, interconnected systems. The project is exploring novel means of leveraging computer capabilities, including: practical, logical, heuristic, and automated reasoning by machines; development of enhanced human-to-computer and computer-to-computer interaction technologies; innovative approaches to the composition of software; innovative computer architectures; mathematical programs and their potential for defense applications; and new learning mechanisms for systematically upgrading and improving these capabilities.\n\n      The Cyber Sciences project supports long term national security requirements through scientific research and experimentation in cybersecurity.  Networked computing systems control virtually everything, from power plants and energy distribution, transportation systems, food and water distribution, financial systems, to defense systems.  Protecting the infrastructure on which these systems rely is a national security issue.   The Cyber Sciences project will ensure DoD cyber-capabilities survive adversary attempts to degrade, disrupt, or deny military computing, communications, and networking systems.  Basic research in cyber security is required to provide a basis for continuing progress in this area. Promising research results will transition to both technology development and system-level projects.\n\n     The Electronic Sciences project explores and demonstrates electronic and optoelectronic devices, circuits and processing concepts that will provide: 1) new technical options for meeting the information gathering, transmission and processing required to maintain near-real time knowledge of the enemy and the ability to communicate decisions based on that knowledge to all forces in near-real time; and 2) provide new means for achieving substantial increases in performance and cost reduction of military systems providing these capabilities.\n\n     The Materials Sciences project provides the fundamental research that underpins the development and assembly of advanced nanoscale and bio-molecular materials, devices, and electronics for DoD applications that greatly enhance soldier awareness, capability, security, and survivability, such as materials with increased strength-to-weight ratio and ultra-low size, devices with ultra-low energy dissipation and power, novel spectroscopic sources, and electronics with persistent intelligence and improved surveillance capabilities.\n\n     The Transformative Sciences project supports research and analysis that leverages converging technological forces and transformational trends in computing and the computing-reliant subareas of the social sciences, life sciences, manufacturing, and commerce.  The project integrates these diverse disciplines to improve military adaptation to sudden changes in requirements, threats, and emerging\/converging trends, especially trends that have the potential to disrupt military operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "332.146"
                },
                "CurrentYear": {
                    "val": "333.119"
                },
                "BudgetYearOne": {
                    "val": "328.362"
                },
                "BudgetYearOneBase": {
                    "val": "328.362"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "322.030"
                },
                "CurrentYear": {
                    "val": "333.119"
                },
                "BudgetYearOne": {
                    "val": "362.297"
                },
                "BudgetYearOneBase": {
                    "val": "362.297"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-10.116"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "33.935"
                },
                "BudgetYearOneBase": {
                    "val": "33.935"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-10.116"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "33.935"
                                },
                                "BudgetYearOneBase": {
                                    "val": "33.935"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015:  Decrease reflects the SBIR\/STTR transfer. \nFY 2016:  N\/A\nFY 2017:  Increase reflects expanded focus in Math and Computer sciences, Electronics, Materials and Transformative sciences."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BLS-01"
                    },
                    "ProjectTitle": {
                        "val": "BIO\/INFO\/MICRO SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.000"
                        },
                        "CurrentYear": {
                            "val": "6.127"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project is investigating and developing the intersections of biology, information technology and micro\/physical systems to exploit important technological advances and leverage fundamental discoveries for the development of new technologies, techniques, and systems of interest to the DoD.  This research is critical to the development of improved training and cognitive rehabilitation.  Programs in this project will draw upon the information and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  This project will develop the basic research tools in biology that are unique to the application of biological-based solutions to critical Defense problems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Quantitative Models of the Brain"
                                    },
                                    "Description": {
                                        "val": "The Quantitative Models of the Brain program will establish a functional mathematical basis on which to build future advances in cognitive neuroscience, computing capability, and signal processing across the DoD.  An important focus of this program will be determining how information is stored and recalled in the brain and other DoD-relevant signals, developing predictive, quantitative models of learning, memory, and measurement.  Using this understanding, the program will develop powerful new symbolic computational capabilities for the DoD in a mathematical system that will provide the ability to understand complex and evolving signals and tasks while decreasing software and hardware requirements and other measurement resources.  This includes a comprehensive mathematical theory to extract and leverage information in signals at multiple acquisition levels that would fundamentally generalize compressive sensing for multi-dimensional sources beyond domains typically used.  New insights related to signal priors, task priors, and adaptation will enable these advances.  This program will further exploit advances in the understanding and modeling of brain activity and organization to improve training of individuals and teams as well as identify new therapies for cognitive rehabilitation (e.g., Traumatic Brain Injury (TBI), Post Traumatic Stress Disorder (PTSD)).  Critical to success will be the ability to detect cellular and network-level changes produced in the brain during the formation of new, hierarchically organized memories and memory classes, and to correlate those changes with memory function of animals during performance of behavioral tasks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.600"
                                            },
                                            "Text": {
                                                "val": "-  Quantified spatio-temporal patterns of neurophysiological activity underlying memory formation. \n-  Extended models and brain regions to account for hierarchical organization of memories (procedural, declarative\/episodic). \n-  Demonstrated model prediction of knowledge and skill-based memory encoding. \n-  Developed model of memory encoding using non-invasively recorded neural signals. \n-  Developed sparse multiple input\/multiple output nonlinear dynamical modeling methodology for real-time application to electrophysiological recordings."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.127"
                                            },
                                            "Text": {
                                                "val": "-  Build hippocampal-neocortical model of stimulation-based memory enhancement.  \n-  Develop and apply a new set of classification models for the prediction of behavioral outcomes from the spatio-temporal patterns of electrophysiological recordings in the hippocampus. \n-  Develop initial computational model of integrated neural, physiological, and environmental effects in neural replay, skill acquisition, and subsequent memory recall."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bio Interfaces"
                                    },
                                    "Description": {
                                        "val": "The Bio Interfaces program supported scientific study and experimentation, emphasizing the interfaces between biology and the physical and mathematical\/computer sciences.  This unique interaction developed new mathematical and experimental tools for understanding biology in a way that allowed its application to a myriad of DoD problems.  These tools will help exploit advances in the complex modeling of physical and biological phenomena.  It is also expected that understanding the fundamentals of biology will aid in developing tools to understand complex, non-linear networks.  This program also explored the fundamental nature of time in biology and medicine.  This included mapping basic clock circuitry in biological systems from the molecular level up through unique species level activities with a special emphasis on the applicability to human biology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.400"
                                            },
                                            "Text": {
                                                "val": "-  Investigated alternative strategies for treating disease by targeting clocking systems that drive temporal processes such as cell cycle progression and metabolic cycles. \n-  Leveraged temporally collected data to test the impact of time on drug efficacy. \n-  Discovered and tested novel compounds that target oscillatory networks to modulate neurodegenerative disease in an animal model."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCS-02"
                    },
                    "ProjectTitle": {
                        "val": "MATH AND COMPUTER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "111.223"
                        },
                        "CurrentYear": {
                            "val": "144.290"
                        },
                        "BudgetYearOne": {
                            "val": "149.065"
                        },
                        "BudgetYearOneBase": {
                            "val": "149.065"
                        },
                        "BudgetYearTwo": {
                            "val": "158.762"
                        },
                        "BudgetYearThree": {
                            "val": "165.583"
                        },
                        "BudgetYearFour": {
                            "val": "163.036"
                        },
                        "BudgetYearFive": {
                            "val": "167.036"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Math and Computer Sciences project supports scientific study and experimentation on new computational algorithms, models, and mechanisms in support of long-term national security requirements.  The project is exploring novel means of leveraging computer capabilities, including: practical, logical, heuristic, and automated reasoning by machines; enhanced human-to-computer and computer-to-computer interaction technologies; innovative approaches to the composition of software; innovative computer architectures; mathematical programs and their potential for defense applications; and new learning mechanisms for systematically upgrading and improving these capabilities.  Promising techniques will transition to both technology development and system-level projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3.334"
                                        },
                                        "Text": {
                                            "val": "-  Supports increased efforts in basic research that engage a wider set of universities and commercial research communities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Big Mechanism"
                                    },
                                    "Description": {
                                        "val": "The Big Mechanism program is creating new approaches to automated computational intelligence applicable to diverse domains such as biology, cyber, economics, social science, and intelligence.  Mastering these domains requires the capability to create abstract yet predictive - ideally causal - models from massive volumes of diverse data generated by human actors, physical sensors, and networked devices.  Current modeling approaches are heavily reliant on human insight and expertise, but the complexity of these models is growing exponentially and has now, or will soon, exceed the capacity for human comprehension.  Big Mechanism will create technologies to extract and normalize information for incorporation in flexible knowledge bases readily adapted to novel problem scenarios; powerful reasoning engines that can infer general rules from a collection of observations, apply general rules to specific instances, and generate (and compute the likelihood of) the most plausible explanations for a sequence of events; and knowledge synthesis techniques to derive abstract principles and\/or create models of extreme complexity consistent with huge volumes of data.  Big Mechanism applications will accommodate an operator-in-the-loop by accepting questions posed in human natural language, providing drill-down to reveal the basis for an answer, taking user inputs to improve\/correct derived associations, weightings, and conclusions, and querying the operator to clarify ambiguities and reconcile detected inconsistencies.  Big Mechanism techniques will integrate burgeoning data into causal models and explore these models for precise interventions.  The program has adopted cancer modeling as an initial focus because the availability of experimental data, and the complexity of the problems are representative of challenges facing the DoD in areas such as cyber attribution, open-source intelligence, and economic indications and warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed model management techniques for storing, manipulating, and reasoning about tens of thousands of alternative causal models.\n-  Developed techniques to generate plausible causal hypotheses that can be tested in the lab.\n-  Developed tools for operator drill-down, ambiguity clarification, and inconsistency reconciliation.\n-  Demonstrated an initial capability to read thousands of published papers on various aspects of the Ras cancer pathway; extract the specifics of the results (e.g., Ras model fragments) being reported in each paper; and assemble Ras model fragments into a larger consolidated model of Ras biochemical interactions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.100"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate automated testing of machine-generated hypotheses.\n-  Create new modes for visualizing and exploring models of huge scope that in their entirety exceed human cognitive capabilities.\n-  Develop causal models that relate phenotype to genotype using biological big data.  \n-  Formulate statistical approaches for uncovering causal relationships in numerical data\/time series and categorical data\/symbol sequences.\n-  Demonstrate prototype technologies in production mode by identifying drug targets and drugs for one or more specific classes of cancer.\n-  Develop algorithms for early indications and\/or tracking of medical conditions such as neurological impairment, musculoskeletal injury, and cardio-vascular issues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "-  Create interfaces and tools to support a public web-based resource of machine-curated cancer pathways.\n-  Create utilities to add genomic information to machine-curated cancer pathways.\n-  Publish a high-fidelity simulation of the Ras cancer pathway.\n-  Explore the portability of Big Mechanism technologies to other domains.\n-  Explore the application of genotype-phenotype models to biomanufacturing. \n-  Develop and implement scalable algorithms that reveal causality networks in large, complex, heterogeneous datasets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Building Resource Adaptive Software from Specifications (BRASS)"
                                    },
                                    "Description": {
                                        "val": "The Building Resource-Adaptive Software from Specifications (BRASS) program is developing an automated framework that permits software systems to seamlessly adapt to changing resource conditions in an evolving operational environment.  Effective adaptation is realized through rigorously defined specifications that capture application resource assumptions and resource guarantees made by the environment.  The current manual adaptation process is based on corrective patching, which is time-consuming, error-prone, and expensive.  Predicting the myriad of possible environment changes that an application may encounter in its lifetime is problematic, and existing reactive approaches are brittle and often incorrect.  The use of specification-based adaptation will allow BRASS applications to be correctly restructured in real time whenever stated assumptions or guarantees are broken.  This restructuring is optimized to trade off execution fidelity and functionality for continued operation.  BRASS will create tools to automatically discover and monitor resource changes, build new analyses to infer deep resource-based specifications, and implement compiler and runtime transformations that can efficiently adapt to resource changes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.996"
                                            },
                                            "Text": {
                                                "val": "-  Developed a preliminary evaluation framework to enable assessment of adaptation strategies for software systems in the face of resource changes.\n-  Identified promising technical approaches to automatically discover and monitor resource changes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Text": {
                                                "val": "-  Integrate specifications within an operational environment to monitor resource changes and trigger signals when resource invariants are violated.\n-  Develop compile-time and runtime transformations that ensure survivable operation in the face of unexpected environment changes.\n-  Build validation tools that certify that transformed applications satisfy specification assumptions in the context of new operating environment guarantees.\n-  Develop platform-specific challenge problems from different military domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.919"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.919"
                                            },
                                            "Text": {
                                                "val": "-  Develop new forms of resource-sensitive specifications capable of defining complex resource changes involving both physical and logical resources.\n-  Build new compiler and runtime infrastructure that are sensitive to ecosystem evolution.\n-  Incorporate lightweight monitoring tools capable of runtime verification of adaptive program transformations. \n-  Evaluate the effectiveness of the developed systems in collaboration with potential transition partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantifying Uncertainty in Physical Systems"
                                    },
                                    "Description": {
                                        "val": "The Quantifying Uncertainty in Physical Systems thrust will create the basic mathematics needed to efficiently quantify, propagate and manage multiple sources of (parametric and model) uncertainty to make accurate predictions about and also design stochastic, complex DoD systems.  In particular, this will include new methods for scaling Uncertainty Quantification (UQ) methods to multiscale\/multiphysics DoD systems; techniques for correcting model-form uncertainty and for understanding rare events; and new methods for decision making, control, and design under uncertain conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.350"
                                            },
                                            "Text": {
                                                "val": "-  Initiated development of new dimensional reduction and surrogate model methods with theoretical error bounds for rigorous uncertainty analysis of large-scale, coupled systems. \n-  Initiated development of a new theoretical framework for optimization in the presence of high dimensional uncertain parameters.\n-  Initiated development of new model from uncertainty approaches that outperform traditional methods such as the Gaussian Process approach for accurate estimation of quantities of interest in physical systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.947"
                                            },
                                            "Text": {
                                                "val": "-  Develop scalable approximation methods with provable error bounds for optimization in the presence of high dimensional uncertain parameters. \n-  Develop scalable Bayesian inference algorithms for inverse methods with orders of magnitude speed-up incorporating the known physical properties of DoD systems. \n-  Derive proofs and theoretical treatment of rare event detection algorithms within risk-based optimization framework. \n-  Explore novel interfaces for computational design tools that incorporate material structures and physics to enable simultaneous design exploration and optimization under uncertainty."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.357"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.357"
                                            },
                                            "Text": {
                                                "val": "-  Develop new mathematical design techniques for high-dimensional multi-physics problems in the presence of high-dimensional uncertainty. \n-  Initiate design work on a specific DoD multi-fidelity and multi-physics challenge problem.  \n-  Implement algorithms for estimation of quantities in physical systems in the presence of uncertainty on emerging high-performance computing platforms. \n-  Develop new multi-fidelity techniques for model error estimation. \n-  Demonstrate the use of novel computational design interfaces that incorporate material structures and physics to enable simultaneous design exploration and optimization under uncertainty."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Young Faculty Award (YFA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Young Faculty Award (YFA) program is to encourage junior faculty at universities and their equivalent at non-profit science and technology research institutions to participate in sponsored research programs that will augment capabilities for future defense systems.  This program focuses on cutting-edge technologies for greatly enhancing microsystems technologies, biological technologies and defense sciences.  The long-term goal for this program is to develop the next generation of scientists, engineers, and mathematicians in key disciplines who will focus a significant portion of their careers on DoD and National Security issues.  The aim is for YFA recipients to receive deep interactions with DARPA program managers, programs, performers, and the user community.  Current activities include research in thirteen topic areas spanning from Quantum Science and Technology to Robotics and Supervised Autonomy, Mathematics, Computing, and the Interface of Engineering and Biology.  A key aspect of the YFA program is DARPA-sponsored military visits; all YFA Principal Investigators are expected to participate in one or more military site visits to help them better understand DoD needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.166"
                                            },
                                            "Text": {
                                                "val": "-  Awarded new FY 2015 grants for new two-year research efforts across the topic areas, establishing a new set of appropriate technologies to solve current DoD problems.\n-  Continued FY 2014 research on new concepts for microsystem technologies, biological technologies and defense sciences, by exercising second year funding, and by providing continued mentorship by program managers.\n-  Awarded Director's Fellowships for top FY 2013 participants based on researcher's refined technology development and transition plans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.279"
                                            },
                                            "Text": {
                                                "val": "-  Award new FY 2016 grants for new two-year research efforts across the topic areas, establishing a new set of appropriate technologies to solve current DoD problems.\n-  Continue FY 2015 research on new concepts for microsystem technologies, biological technologies and defense sciences, by exercising second year funding, and by providing continued mentorship by program managers.\n-  Award Director's Fellowships for top FY 2014 participants.  During this additional year of funding researchers will refine their technology further and align to DoD needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Award new FY 2017 grants for new two-year research efforts across the topic areas, establishing a new set of appropriate technologies to solve current DoD problems.\n-  Continue FY 2016 research on new concepts for microsystem technologies, biological technologies and defense sciences, by exercising second year funding, and by providing continued mentorship by program managers.\n-  Award Director's Fellowships for top FY 2015 participants.  During this additional year of funding researchers will refine their technology further and align to DoD needs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communicating With Computers (CWC)"
                                    },
                                    "Description": {
                                        "val": "The Communicating With Computers (CWC) program is advancing the state-of-the-art in human-computer interaction by enabling computers to comprehend language, gesture, facial expression and other communicative modalities in context.  Human language is inherently ambiguous and so humans depend strongly on perception of the physical world and context to make language comprehensible.  CWC aims to provide computers with analogous capabilities to sense the physical world, encode the physical world in a perceptual structure, and link language to this perceptual encoding.  To accomplish this, CWC will apply and extend research in language, vision, gesture recognition and interpretation, dialog management, cognitive linguistics, and the psychology of visual encoding, which are essential for human communication in the physical world.  CWC will also work to extend the communication techniques developed for physical contexts to nonphysical contexts such as virtual constructs in the cyber domain.  CWC advances will impact military application areas such as robotics and command and control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.250"
                                            },
                                            "Text": {
                                                "val": "-  Developed a hardware and a software platform for humans to communicate with machines using speech and gestures.\n-  Formulated representations for the physical world that can capture the information in a visual scene in a form amenable to annotation and modification by language-based inputs.\n-  Created a semantic framework for gesture, facial expression and other communicative modalities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.576"
                                            },
                                            "Text": {
                                                "val": "-  Explore methods for determining whether transmitted communications have been successfully received and, if not, what additional communications are most likely to result in success.\n-  Implement representations for the physical world and develop connectors to large-scale knowledge bases to enable visual-language synergies.\n-  Build a universal corpus of elementary composable ideas that in combination can convey the meaning of most communications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.213"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.213"
                                            },
                                            "Text": {
                                                "val": "-  Develop and demonstrate the capability to make computer inputs using gesture, facial expression and other communicative modalities.\n-  Implement initial techniques for confirming that communications have been successfully received and extrapolating potentially missing information.\n-  Demonstrate human-machine communication and collaboration on a physical problem solving task."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mining and Understanding Software Enclaves (MUSE)"
                                    },
                                    "Description": {
                                        "val": "The Mining and Understanding Software Enclaves (MUSE) program is developing program analyses and frameworks for improving the resilience and reliability of complex software applications at scale.  MUSE techniques will apply machine learning algorithms to large software corpora to repair likely defects and vulnerabilities in existing programs and to discover new programs that conform to desired behaviors and specifications.  MUSE frameworks will enable robust execution of large-scale and data-intensive computations.  Specific technical challenges include persistent semantic artifact generation and analysis, defect identification and repair, pattern recognition, and specification inference and synthesis.  MUSE research will improve the security of intelligence-related applications and enhance computational capabilities in areas such as automated code maintenance and revision management, low-level systems implementation, graph processing, entity extraction, link analysis, high-dimensional data analysis, data\/event correlation, and visualization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Implemented new static and dynamic program analysis techniques structured to interact with a persistent database of program facts collected from deep semantic analysis of a large software corpus.\n-  Designed application programming interfaces and implementations of a preliminary mining engine that supports the efficient injection, querying, inspection, and optimization of the underlying database.\n-  Extended the corpus with richer semantic ontologies and metadata support to deal with diverse language frameworks, environments, and systems at scale.\n-  Demonstrated an initial capability by automatically finding and repairing a Heartbleed bug through the addition of bounds checks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.200"
                                            },
                                            "Text": {
                                                "val": "-  Implement scalable database technologies and mining algorithms that allow the ingestion and analysis of tens of millions of lines of open-source software.\n-  Integrate machine learning algorithms that can direct and assimilate mining activities on analysis artifacts stored in the database.\n-  Evaluate component-level synthesis techniques to build implementations for complex self-contained algorithms.\n-  Demonstrate the effectiveness of the developed systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Implement scalable database technologies and mining algorithms that allow the ingestion and analysis of hundreds of millions of lines of open-source software.\n-  Apply deep learning algorithms on complex graph structures produced by corpus mining to discover latent relationships among corpus elements for automated program repair and synthesis.\n-  Exploit ideas from program sketching, user-guided feedback, and specification-driven analysis to automatically construct implementations of complex protocols from discovered specifications.\n-  Evaluate the effectiveness of the developed systems in collaboration with potential transition partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Knowledge Representation"
                                    },
                                    "Description": {
                                        "val": "The Knowledge Representation thrust will develop much-needed tools to contextualize and analyze heterogeneous scientific data, facilitating field-wide hypothesis generation and testing.  This will be accomplished by focusing on two key efforts: the development of domain-agnostic mathematical tools for representing heterogeneous data and domain knowledge in a unified knowledge framework, and domain-specific computational tools to embed observable data within the framework and enable tangible discoveries through computational analysis.  To demonstrate the applicability of Knowledge Representation technology to multiple complex systems, the thrust will include validation across multiple disparate scientific and engineering fields.  The technology developed under this thrust will revolutionize the process of scientific discovery by efficiently maximizing the potential of large, heterogeneous, multi-scale datasets across numerous complex scientific fields."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed an initial mathematical knowledge framework for representing diverse data types and existing domain knowledge in a domain-agnostic form. \n-  Established initial scientific and\/or engineering use case and example data sets that will be used to validate the knowledge representation framework and tools as they are developed. \n-  Designed appropriate tools for ingesting and registering scientific data into a common mathematical representation and demonstrated the tools for example datasets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.600"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate data input and information extraction within the previously developed mathematical knowledge framework.\n-  Incorporate domain-specific prior knowledge, such as computational models, into the mathematical knowledge framework. \n-  Demonstrate the integration of datasets and prior domain knowledge in one or more scientific and engineering use cases. \n-  Explore novel mathematical representations that can accommodate the possibilities of new materials for enabling simultaneous design exploration and optimization. \n-  Develop a quantitative framework for analyzing and optimizing human interactions with engineered components in collaborative networks consisting of human-machine systems and systems-of-systems. \n-  Explore novel experimental approaches for repeatable and replicable testing of social simulation representation and modeling tools for understanding social behavioral outcomes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a prototype platform for knowledge and data ingestion.  \n-  Demonstrate multimodal integration and inference with first-generation analysis tools.  \n-  Demonstrate hypothesis generation and steering using newly developed knowledge representation tools on one or more scientific and engineering use cases. \n-  Analyze and optimize knowledge representation system performance in terms of scalability for inference and knowledge ingestion. \n-  Demonstrate novel mathematical representation tools that integrate geometry with material physics and properties and micro-structure to accelerate design exploration and optimization. \n-  Demonstrate the utility of new networked data collection, mathematical, and computational modeling tools in the simulation of complex social interactions. \n-  Demonstrate the applicability of newly developed representation and modeling tools for understanding potential social behavioral outcomes.\n-  Design tools for the measurement and representation of collaborative problem solving performance in human-machine systems and systems-of-systems.  \n-  Demonstrate the use of new knowledge representation tools for modeling and optimizing collaborative problem solving performance in human-machine systems and systems-of-systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Probabilistic Programming for Advancing Machine Learning (PPAML)"
                                    },
                                    "Description": {
                                        "val": "The Probabilistic Programming for Advancing Machine Learning (PPAML) program is creating an advanced computer programming capability that greatly facilitates the construction of new machine learning applications in a wide range of domains.  This capability will increase the number of people who can effectively contribute, make experts more productive, and enable the creation of new tactical applications that are inconceivable given today's tools.  The key enabling technology is a radically new programming paradigm called probabilistic programming that enables developers to quickly build generative models of phenomena and queries of interest, which a compiler would convert into efficient applications.  PPAML technologies will be designed for application to a wide range of military domains including Intelligence, Surveillance and Reconnaissance (ISR) exploitation, robotic and autonomous system navigation and control, and medical diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.611"
                                            },
                                            "Text": {
                                                "val": "-  Identified and developed two additional challenge problems from natural language processing and automated image captioning with increasing levels of complexity and larger data sets.\n-  Extended the front end of a probabilistic programming system with additional functionality, including profilers, debuggers, and model verification\/checking tools.\n-  Extended the back end of a probabilistic programming system with additional functionality, such as improving efficiency of solvers and compiling inference engines to a range of different hardware targets.\n-  Evaluated the performance of probabilistic programming approaches in collaboration with potential transition partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.188"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate advanced probabilistic abstractions, inference techniques, and implementations.  \n-  Enrich the front end of probabilistic programming systems with new abstractions, and improve integration with solvers and inference engines. \n-  Extend the back end of a probabilistic programming system with support for new inference techniques.\n-  Evaluate the performance of each probabilistic programming system both in terms of the quality of the answers and the levels of resources required."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.576"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.576"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the benefit of probabilistic programming systems over existing techniques.\n-  Integrate probabilistic systems within domain-specific contexts to provide tailored functionality.\n-  Build new solvers that incorporate state-of-the-art machine learning algorithms that operate at scales at least one order of magnitude greater than currently feasible.\n-  Work with domain experts and transition partners to apply the program-developed tools to relevant domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Secure Programming Languages (SPL)"
                                    },
                                    "Description": {
                                        "val": "The Secure Programming Languages (SPL) program will create new programming languages and integrated development environments that facilitate the creation of secure computer programs.  At present, programming languages allow programmers to create programs having large attack surfaces, major flaws, and critical vulnerabilities.  Minimizing the attack surface, correcting flaws, and eliminating vulnerabilities are the programmer's responsibility, and the degree to which the programmer succeeds depends largely on the skill of the programmer.  The languages developed by SPL will break this paradigm by incorporating security features in the language itself that ensure formal correctness throughout all phases of the software development lifecycle.  SPL languages and integrated development environments will facilitate the creation of software free from broad classes of flaws and vulnerabilities, and enable even novice programmers to readily create secure computer programs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Formulate approaches for automatically identifying non-essential components in software programs and systems that can be eliminated to minimize the attack surface.\n-  Develop programming languages, tools, and integrated development environments that facilitate the creation\/adaptation of software free from broad classes of flaws and vulnerabilities. \n-  Formulate approaches for automatically proving formal correctness at critical stages of the software development lifecycle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unconventional Processing of Signals for Intelligent Data Exploitation (UPSIDE)"
                                    },
                                    "Description": {
                                        "val": "The objective of the Unconventional Processing of Signals for Intelligent Data Exploitation (UPSIDE) program is to achieve extreme power savings while increasing performance for object detection and tracking from video streams by using an unconventional, approximate computing approach. Today, image processing applications use high precision, digital representations, which are inherently power-inefficient, particular for data produced by noisy, analog, real-time sensors such as video.  UPSIDE's unconventional approach uses pattern matching techniques that map very efficiently to both analog complementary metal-oxide semiconductor (CMOS) circuits and various emerging devices.  Furthermore, this pattern matching approach can leverage the physics of certain emerging devices to compute a best pattern match directly requiring very little power. The UPSIDE computing approach will be benchmarked using a DoD-relevant image processing pipeline, to verify gains in both throughput and power efficiency.  The result will be new approach for image processing systems that demonstrate five orders of magnitude improvement, in terms of combined power and performance for the mixed signal implementations, and seven orders of magnitude improvements using the emerging devices.  The UPSIDE program will create a new generation of computing structures that will, in turn, enable revolutionary advances in Intelligence, Surveillance and Reconnaissance (ISR) processing, particularly for DoD applications of embedded, real-time sensor data analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed an image processing pipeline system for performing object identification and tracking utilizing a newly developed probabilistic pattern match (inference) methodology, running on conventional digital processing hardware showing no loss in accuracy over standard methods.\n-  Completed design of the mixed-signal CMOS chip(s) for doing inference computing in an image processing pipeline system and validated by an object identification and tracking simulation using real-time, high-definition video streams.\n-  Fabricated mixed-signal CMOS chip(s) designed to perform inference computation for use in image processing.\n-  Demonstrated the operation of (non-CMOS) emerging devices performing an inference computation, which can be scaled for use in portable, power constrained image processing applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Build and complete mixed-signal CMOS test bed for running image processing applications performing object ID and tracking.\n-  Complete the digital version of image processing pipeline and validate power, performance and accuracy of UPSIDE inference methodology for object identification and tracking in surveillance video.\n-  Complete final full test bed system demonstration of mixed signal CMOS chip(s) fabricated in the UPSIDE program showing significant power savings and performance increase (100,000x better combined) over digital version for object identification and tracking applications.\n-  Complete evaluation of a simulation of the image processing pipeline system based on (non-CMOS) emerging devices, for the primary computing, projecting 1000x performance improvement while reducing power consumption of the processing by 10,000x with no loss in tracking accuracy as compared to the conventional image processing pipeline."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Graph-theoretical Research in Algorithm Performance & Hardware for Social networks (GRAPHS)"
                                    },
                                    "Description": {
                                        "val": "While the DoD has been extremely effective in deploying rigorous analytical and predictive methods for problems involving continuously valued variables (tracking, signals processing), analytical methods for discrete data such as graphs and networks have not kept pace.  Recent evidence has shown that network analysis can provide critical insight when used in DoD-relevant scenarios.  In this paradigm, nodes represent items of interest and their relationships or interactions are edges; the result forms a network or graph.  Current analysis of large networks, however, is just in its infancy: the composition of real-world networks is understood only at the most coarse and basic details (diameter, degree distribution).  In order to implement network techniques efficiently and usefully, a better understanding of the finer mathematical structure of these networks is needed.  This includes the development of a comprehensive and minimal mathematical set that characterizes networks of DoD interest and a description of how these quantities vary in both space and time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.902"
                                            },
                                            "Text": {
                                                "val": "-  Created a suite of systematic network analysis tools that can be applied to static and dynamic network structures and complex use cases. \n-  Developed near real-time scalable algorithms and models with guaranteed accuracy performance for inference, decision support, and understanding macro-phenomena."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.900"
                                            },
                                            "Text": {
                                                "val": "-  Extend previously developed statistical graph models to enable the modeling of multi-scale graphs, heterogeneous and vector link structures. \n-  Deliver code for streaming and scalable algorithms (graph matching, similarity, etc.) for large scale networks to be incorporated into software toolkit. \n-  Deliver data-driven graph clustering and analysis methods that allow scientific discovery of complex time-varying phenomena."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Complexity Management Hardware"
                                    },
                                    "Description": {
                                        "val": "The battlefield of the future will certainly have more data generators and sensors that produce information required to efficiently execute operations.  With networked sensors, the variety and complexity of the information streams will be even further extended.  This project studied silicon designs which help alleviate the complexity inherent in next generation systems.  These systems will have increasingly large data sets generated by their own multidomain sensors (such as RF and Electro-Optical\/Infrared (EO\/IR) payloads) as well as new inputs from external sensors that may or may not have been planned for initially.  With current programming approaches, there are laborious coding requirements needed to assimilate new data streams. However, the context provided by these data sets is ever changing, and it is imperative for the integrated electronics to adapt to new information without a prolonged programming cycle.  Providing contextual cues for processing of data streams will alleviate the fusion challenges that are currently faced, and which stress networked battlefield systems.  As opposed to the intuition and future-proofing that is required at the programming stage of a current system, the silicon circuit of the future will be able to use contextual cues to adapt accordingly to new information as it is provided.  The fundamental aspects of this program looked at various algorithms to explore the ability to use context to adapt to new information.  Applied research for the program was budgeted in PE 0602303E, Project IT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.614"
                                            },
                                            "Text": {
                                                "val": "-  Developed new, biology-inspired, neural network, machine learning algorithms including new data representations, low precision and ability to adapt and scale.\n-  Identified and selected benchmark calculations on data streams to show accurate pattern recognition with minimal training times in a variety of applications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CYS-01"
                    },
                    "ProjectTitle": {
                        "val": "CYBER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.178"
                        },
                        "CurrentYear": {
                            "val": "50.428"
                        },
                        "BudgetYearOne": {
                            "val": "45.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.000"
                        },
                        "BudgetYearTwo": {
                            "val": "47.219"
                        },
                        "BudgetYearThree": {
                            "val": "27.000"
                        },
                        "BudgetYearFour": {
                            "val": "10.000"
                        },
                        "BudgetYearFive": {
                            "val": "10.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cyber Sciences project supports long term national security requirements through scientific research and experimentation in cyber security.  During the past decade, information technologies have enabled important new military capabilities and driven the productivity gains essential to U.S. economic competitiveness.  Unfortunately, during the same period, cyber threats have grown rapidly in sophistication and number, putting sensitive data, classified computer programs, and mission-critical information systems at risk.  The basic research conducted under the Cyber Sciences project will produce the breakthroughs necessary to ensure the resilience of DoD information systems to current and emerging cyber threats.  Promising research results will be transitioned to both technology development and system-level projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3.334"
                                        },
                                        "Text": {
                                            "val": "-  Supports increased efforts in basic research that engage a wider set of universities and commercial research communities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Transparent Computing"
                                    },
                                    "Description": {
                                        "val": "The Transparent Computing program is developing technologies to enable the implementation of more effective security policies across distributed systems.  The scale and complexity of modern information systems obscures linkages between security-related events, the result being that detection of attacks and anomalies must rely on narrow contextual information rather than complete knowledge of the event's provenance.  This shortcoming facilitates attacks such as advanced persistent threats (APTs).  The Transparent Computing program will address these problems by creating the capability to propagate security-relevant information and ensure component interactions are consistent with established behavior profiles and policies.  Transparent Computing technologies are particularly important for large integrated systems with diverse components such as distributed surveillance systems, autonomous systems, and enterprise information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.357"
                                            },
                                            "Text": {
                                                "val": "-  Formulated approaches for tracking information flows and other causal dependencies, and recovering event provenance to enable more effective detection of attacks, anomalies, and advanced persistent threats.\n-  Proposed active\/continuous testing and adaptive security policy schemes that adjust security posture and usage controls in response to information provided by distributed protection components.\n-  Introduced dynamic behavioral attestation techniques, and proposed scalable algorithms and implementations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.119"
                                            },
                                            "Text": {
                                                "val": "-  Implement adaptive security policy schemes in software prototypes and perform initial assessments in simulated laboratory and cloud environments.\n-  Develop and implement behavioral attestation techniques in software prototypes scalable to big data applications.\n-  Develop and implement causal dependency tracking across software\/hardware abstraction layers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.321"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.321"
                                            },
                                            "Text": {
                                                "val": "-  Develop provenance graph analytics algorithms for clustering, role discovery, anomaly detection, root cause analysis and extrapolation.  \n-  Develop a preliminary integrated provenance tracking system for Android Java applications.\n-  Develop defensive response mechanisms and a forensic analysis capability for a single system with browser and apps. \n-  Conduct an adversarial evaluation of an APT browser implementation based on an operational APT scenario to infer the nature of the attack, against Transparent Computing-defined metrics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space\/Time Analysis for Cybersecurity (STAC)"
                                    },
                                    "Description": {
                                        "val": "The Space\/Time Analysis for Cybersecurity (STAC) program is developing techniques to detect vulnerabilities to algorithmic complexity and side channel attacks in software.  Historically, adversaries have exploited software implementation flaws through buffer and heap overflow attacks.  Advances in operating systems have largely mitigated such attacks, so now cyber adversaries must find new ways of compromising software.  Algorithmic complexity and side channel attacks are emerging as the next generation of attacks since they depend on intrinsic properties of the algorithms themselves rather than implementation flaws.  News reports have highlighted the first wave of these attacks (CRIME, BREACH, Hash DoS).  The STAC program seeks to develop new analysis tools and techniques to detect vulnerabilities to these attacks in the software upon which the U.S. government, military, and economy depend."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.239"
                                            },
                                            "Text": {
                                                "val": "-  Presented initial program analysis approaches for identifying vulnerabilities to algorithmic complexity and side channel attacks based on both time and space resource usage.\n-  Developed STAC concept of operations, created example resource usage attack scenarios, and defined the rules of engagement for competitive experiments between research and adversarial challenge teams.\n-  Identified the initial infrastructure required to support the development of a sufficient number of challenge programs containing known vulnerabilities to support realistic evaluations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.078"
                                            },
                                            "Text": {
                                                "val": "-  Define the formal semantics of the runtime environments in which vulnerable software runs and encode these semantics in a form consumable by automated analysis tools.\n-  Produce initial analysis tools that reason about data and control flow paths in computer programs, identify inputs adversaries can use to mount algorithmic complexity attacks, and identify outputs that adversaries can use to mount side channel attacks.\n-  Perform the first competitive experiment using prototype analysis tools to find vulnerabilities to algorithmic complexity and side channel attacks in a corpus of challenge programs, and produce measurements of research progress against program metrics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.360"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.360"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate capabilities to detect algorithmic resource usage vulnerabilities using automated program analysis based tools.\n-  Assess the performance of tools that identify inputs adversaries can use to mount algorithmic complexity attacks and outputs that adversaries can use to mount side channel attacks.\n-  Identify the most promising analysis tools for finding vulnerabilities to algorithmic complexity and side channel attacks in a corpus of test programs, and integrate these in a best-of-breed prototype."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SafeWare"
                                    },
                                    "Description": {
                                        "val": "The SafeWare program is developing new code obfuscation techniques for protecting software from reverse engineering.  At present, adversaries can extract sensitive information from stolen software, which can include cryptographic private keys, special inputs\/failsafe modes, proprietary algorithms and even the software architecture itself.  Today's state of the art in software obfuscation adds junk code (loops that do nothing, renaming of variables, redundant conditions, etc.), which unfortunately does little more than inconvenience the aggressor.  Recent breakthroughs in theoretical cryptography have the potential to make software obfuscation into a mathematically rigorous science, very much like what the Rivest-Shamir-Adleman (RSA) algorithm did for the encryption of messages in the 1970's.  The SafeWare program aims to take this very early-stage theory, which in its present form incurs too much runtime overhead to be practical, and re-tool its mathematical foundations such that one day it will be practical and efficient.  As with RSA, SafeWare methods will require the solution of a computationally hard mathematical problem as a necessary condition for a successful de-obfuscation attack."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Formulated new cryptographic approaches for protecting software from reverse engineering with mathematically proven security properties that are not substantially diminished in effectiveness even if they are fully understood by the adversary.\n-  Introduced cryptographic code obfuscation methods with reduced program runtime overhead.\n-  Studied the potential for implementing cryptographic code obfuscation techniques on multiprocessor systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.826"
                                            },
                                            "Text": {
                                                "val": "-  Explore potentially powerful new primitives for cryptographic program obfuscation such as multilinear maps.\n-  Develop alternate notions and models of obfuscation that accommodate specialized aggressor models.\n-  Optimize domain-specific algorithms for obfuscation efficiency.\n-  Create an evaluation platform\/environment capable of quantifying runtime efficiency and cryptographic security of the obfuscation algorithms and software implementations, and initiate assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.319"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.319"
                                            },
                                            "Text": {
                                                "val": "-  Based on initial assessment results, develop new obfuscation theory and implementations better suited to codes encountered in operational systems.\n-  Use adversarial techniques to identify side channel vulnerabilities in the obfuscation algorithms and software implementations.\n-  Work with potential transition partners to incorporate specific obfuscation features and capabilities that address use cases relevant to military systems and missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automated Program Analysis for Cybersecurity (APAC)"
                                    },
                                    "Description": {
                                        "val": "Automated Program Analysis for Cybersecurity (APAC) is developing automated program analysis techniques for mathematically validating specified security properties of mobile applications.  This will involve creating new and improved type-based analysis, abstract interpretation, and flow-based analysis methods with far greater ability to accurately demonstrate security with lower instances of false alarms.  APAC technologies will enable developers and analysts to identify mobile applications that contain hidden malicious functionality and bar those applications from DoD mobile application marketplaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.248"
                                            },
                                            "Text": {
                                                "val": "-  Significantly improved the productivity of analysts to bar malware from DoD application stores using the prototype tools.\n-  Assessed and selected prototype tools for experimentation or transition based on their performance on program metrics: probabilities of false alarm, missed detection rate, and human analysis time.\n-  Transitioned new program analysis techniques to major commercial industry products."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.405"
                                            },
                                            "Text": {
                                                "val": "-  Run comparative performance evaluations between program-developed malware detection tools and commercially available tools.\n-  Engage in experiments and pilot deployments of prototype tools with transition partners running DoD application stores.\n-  Improve prototypes to enhance usability in the context of DoD application stores."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ES-01"
                    },
                    "ProjectTitle": {
                        "val": "ELECTRONIC SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.947"
                        },
                        "CurrentYear": {
                            "val": "40.824"
                        },
                        "BudgetYearOne": {
                            "val": "49.553"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.553"
                        },
                        "BudgetYearTwo": {
                            "val": "38.151"
                        },
                        "BudgetYearThree": {
                            "val": "40.996"
                        },
                        "BudgetYearFour": {
                            "val": "44.883"
                        },
                        "BudgetYearFive": {
                            "val": "44.883"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project seeks to continue the phenomenal progress in microelectronics innovation that has characterized the last decades by exploring and demonstrating electronic and optoelectronic devices, circuits and processing concepts that will: 1) provide new technical options for meeting the information gathering, transmission and processing required to maintain near real-time knowledge of the enemy and the ability to communicate decisions based on that knowledge to all forces in near real-time; and 2) provide new means for achieving substantial increases in performance and cost reduction of military systems providing these capabilities.  Research areas include new electronic and optoelectronic device and circuit concepts, operation of devices at higher frequency and lower power, extension of diode laser operation to new wavelength ranges relevant to military missions, development of uncooled and novel infrared detector materials for night vision and other sensor applications, development of innovative optical and electronic technologies for interconnecting modules in high performance systems, research to realize field portable electronics with reduced power requirements, and system and component level improvements to provide greater affordability and reliability.  Additionally, electronically controlled microinstruments offer the possibility of nanometer-scale probing, sensing and manipulation for ultra-high density information storage \"on-a-chip,\" for nanometer-scale patterning, and for molecular level analysis and synthesis.  These microinstruments may also offer new approaches to integration, testing, controlling, manipulating and manufacturing nanometer-scale structures, molecules and devices."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6.666"
                                        },
                                        "Text": {
                                            "val": "-  Supports increased efforts in basic research that engage a wider set of universities and commercial research communities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Semiconductor Technology Advanced Research Network (STARNet)"
                                    },
                                    "Description": {
                                        "val": "The Semiconductor Technology Advanced Research Network (STARNet) program is a government-industry partnership, combining the expertise and resources from select defense, semiconductor, and information companies with those of DARPA, to sponsor an external set of academic research teams that are focused on specific technology needs set by experts in industry and government.  Efforts under this program will remove the roadblocks to achieving performance needed for future sensing, communication, computing, and memory applications.  The program involves close collaboration between these experts and the academic base, with industry providing 60% of program funding matched by 40% from DARPA.  For both industrial and government participants, leveraging shared research funding for high risk, pre-competitive technology explorations focused on shared technical hurdles is very attractive.\n\nResearch in STARNet is divided into a discovery thrust (ACCEL) and an integration thrust (NEXT) executed by virtual academic centers and focused on exploiting current and emerging technologies to provide new capabilities.  ACCEL seeks to discover new material systems, devices, and novel computing\/sensing architectures.  NEXT involves projects on advanced analog and mixed signal circuitry, complex system design tools, and alternative computing architectures.  As the projects in ACCEL mature, it is expected that they will replace the efforts in NEXT that are based on current standard technologies for integrated circuits.\n\nThe STARNet program creates a community where industry and government participate as co-sponsors to guide and learn from a large academic research base (including approximately 42 universities, 171 faculty researchers, 638 students, and more than 109 industry associate personnel), with DoD shaping the goals to have direct impact on important long-range DoD needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigated the feasibility of advanced two-dimensional semiconductor materials for extremely low power devices and developed the nanofabrication methods as well as established the theory, modeling and simulation tools for 2D electronic materials.\n-  Researched fundamental limitations of scaling multifunctional and spintronics materials. Demonstrated advanced devices and examined device characteristics.\n-  Developed scalable silicon-based computing system architecture by exploring the benefits of heterogeneously integrating emerging nano-technologies into silicon-based designs.\n-  Developed statistical foundations of information processing via machine learning frameworks, process-scalable foundations of analog mixed-signal systems using information-based design metrics, neuro-principled information processing architectures for Beyond-complementary metal-oxide semiconductor (CMOS) and CMOS fabrics, and accelerated the deployment of beyond-CMOS and CMOS nanoscale fabrics via nanofunctions and nanoprimitives.\n-  Developed components, architecture, data control, and tools for sensor swarm applications such as building energy efficiency, health care delivery, manufacturing and agriculture, and warfighter situational awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop novel materials and steep-turn-on transistor devices as well as design proof-of-concept circuit blocks for applications such as lower power imagers, pattern recognition, and scavenging self-powered electronics with extremely low energy-delay product.\n-  Develop voltage-controlled magnetic materials and fabrication techniques to enable power efficient spintronics devices for logic and memory applications.\n-  Develop the scalability of silicon-based computing system concepts into the 2020-2030 timeframe to meet the performance, power and cost demands of DoD applications.\n-  Discover and develop bio- and neuro-inspired information processing architecture framework that approaches the efficiency of brain computation, while aligning well with emerging beyond-CMOS nanoscale fabrics.\n-  Investigate sensor swarm applications for Defense requirements such as warfighter situational awareness and assess system characteristics and potential advantages."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop low-voltage steep-turn-on transistors beyond traditional CMOS devices as well as realize the digital, memory, or microwave circuits with extremely low power consumption.\n-  Develop spintronics devices for extremely low-power for logic and non-volatile memory circuits with increased complexity.\n-  Develop heterogeneous and domain accelerated parallel systems by leveraging novel silicon-based computing architecture and integration concepts to enable reliable and secure system designs.\n-  Develop statistical information processing architectures for in-memory computing and in-sensor computing by CMOS and beyond CMOS prototypes.\n-  Develop swarm-based architecture and prototypes by leveraging localization and energy harvesting capabilities with built-in privacy and security to connect everything and enable urban or theater monitoring applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Direct On-Chip Digital Optical Synthesis (DODOS)"
                                    },
                                    "Description": {
                                        "val": "The development of techniques for precise frequency control of radio frequencies (RF) and microwave radiation in the 1940's revolutionized modern warfare.  Frequency control is the enabling technology for radar, satellite and terrestrial communications, and positioning and navigation technology, among many other core DoD capabilities.  By comparison, frequency control at optical frequencies is relatively immature, comparable to the state-of-the-art of microwave control in the 1930's.  The first practical demonstration of optical frequency synthesis, utilizing a self-referenced optical comb, was performed in 1999 and, since that time, the precision and accuracy of optical measurements has improved by four orders of magnitude, including the demonstration of atomic clocks utilizing optical-frequency atomic transitions that far outperform existing technology based on microwave transitions.  To date, however, optical frequency control has been constrained to laboratory experiments due to the large size, relative fragility, and high cost of optical comb-based synthesizers.  Recent developments in self-referenced optical frequency combs in microscale resonators enable the development of a fully-integrated chip-scale optical frequency synthesizer.  Ubiquitous low-cost robust optical frequency synthesis is expected to create a similar disruptive capability in optical technology as microwave frequency synthesis did in the 1940's, enabling high-bandwidth coherent optical communications, coherent synthesized-aperture LiDAR, portable high-accuracy atomic clocks, high-resolution standoff gas\/toxin detection, and intrusion detection, among other foreseen applications.\n\nThe Direct On-chip Digital Optical Synthesis (DODOS) program will investigate high-performance photonic components for creating a microscale high-accuracy optical frequency synthesizer in a compact robust package, suitable for deployment in a wide variety of mission-critical DoD applications.  Significant challenges in the program include reducing the power threshold and stabilizing microresonator optical combs, developing efficient devices for on-chip second harmonic generation, and characterizing the frequency stability and phase noise of a slave laser locked to the stabilized comb.  Applied research for this program is funded within PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.181"
                                            },
                                            "Text": {
                                                "val": "-  Optimized wavelength dispersion and low-threshold operation of microresonator based combs.\n-  Explored materials and novel devices for efficient on-chip second harmonic generation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.700"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate compact low-threshold self-referenced combs suitable for DODOS integration.\n-  Demonstrate methods for stabilizing the phase coherence of a microresonator comb across a broad optical bandwidth.\n-  Characterize the output of a slave laser locked to a stabilized microresonator comb and evaluate the performance relative to promising DoD applications for DODOS technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and demonstrate efficient electronic control algorithms to accurately sweep the slave laser across 50 nanometer (nm) of comb bandwidth.\n-  Investigate methods to further reduce threshold of self-referenced combs.\n-  Design and implement on-chip photonic components to mitigate issues associated with excess phase noise, cross talk, back reflection and isolation to achieve integrated DODOS system performance metrics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Near Zero Energy RF and Sensor Operations (N-ZERO)"
                                    },
                                    "Description": {
                                        "val": "The DoD has an unfilled need for a persistent, event driven sensing capability, where physical, electromagnetic and other sensors can be pre-placed and remain dormant until awoken by an external trigger or stimulus.  State-of-the-art sensors use active electronics to monitor the environment for the external trigger.  The power consumed by these electronic circuits limits the sensor lifetime to durations of weeks to months.  The Near Zero Power RF and Sensor Operations (N-ZERO) program will extend the lifetime of remotely deployed sensors from months to years.  N-ZERO will develop the underlying technologies and demonstrate the capability to continuously and passively monitor the environment and wake-up an electronic circuit upon detection of a specific signature or trigger.  Thereafter, sensor lifetime will be limited only by processing and communications of confirmed events.\n\nThis program will investigate the development of highly innovative sensors and sensor architectures as well as signal processing and digitization technologies with near zero power consumption.  In particular, a fundamental understanding of the trade space that simultaneously minimizes power consumption, the minimum detectable signal, and the probability of false detection will be explored.  This program also has related applied research efforts funded under PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "-  Performed data collection measurements for the purpose of designing and evaluating the performance of N-ZERO devices and microsystems in DoD relevant environments.  Data collections included signatures and environmental background in acoustic, vibrational and magnetic modalities, and environmental background data in radio frequencies (RF) of the electromagnetic spectrum."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Design and fabricate near zero power digitization technologies for zero power RF and physical sensor wake-up circuits.\n-  Design and fabricate passive and extremely low power analog and digital signal processing technologies for low energy processing of RF and physical sensor signatures.\n-  Design and fabricate innovative RF and physical sensor designs that perform passive voltage amplification and spectral processing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.800"
                                            },
                                            "Text": {
                                                "val": "-  Experimentally evaluate component technologies.\n-  Design and fabricate improved component technologies enabling the zero power detection and classification of progressively reduced signal level RF and physical sensor signatures.\n-  Investigate transition paths for fundamental technologies into RF communications and physical sensor systems under development in the applied research portion of this project."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC)"
                                    },
                                    "Description": {
                                        "val": "The effectiveness of combat operations across all domains increasingly depends on our ability to control and exploit the electromagnetic (EM) spectrum, and to deny its use to our adversaries.  Below 30 GHz, the proliferation and availability of inexpensive high-power commercial RF sources has made the EM spectrum crowded and contested, challenging our spectrum dominance.  The numerous tactical advantages offered by operating at higher frequencies, most notably the wide bandwidths available, is driving both commercial and DoD solid-state and vacuum electronic amplifiers into the millimeter wave (mm-wave) spectrum above 30 GHz. Control of the mm-wave spectrum necessitates advanced and increasingly more sophisticated electronic components and systems.  The performance of these systems strongly depends on the available amplifier power.\n\nThe High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC) program will fund basic research in the area of vacuum electronics with the ultimate goal of improving the fundamental understanding of the various phenomena governing the science and technology for the next generation of vacuum electronic amplifiers operating at mm-wave frequencies above 75 GHz.  Focus areas will include modeling and simulation techniques, advanced manufacturing methods, novel beam-wave interaction structures, high current density and long-life cathodes, and other relevant topics.  Applied research efforts are funded in PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Begin research into high-fidelity, three-dimensional, multi-physics, numerically efficient modeling and simulation techniques that lead to first-pass design success.\n-  Begin investigating advanced manufacturing methods such as Selective Laser Sintering (SLS) and other additive manufacturing methods for beam-wave interaction circuits and other tube components.\n-  Investigate a more complete fundamental understanding of electron emission enabling the a priori design of high current-density, long-life cathodes.\n-  Design novel wideband and high-power beam-wave interaction structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Verify and validate the performance of high-fidelity, three-dimensional, multi-physics, numerically efficient modeling and simulation techniques on structures representative of advanced vacuum electronic amplifiers.\n-  Fabricate and test wideband and high-power beam-wave interaction structures, and high current-density cathodes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precise Robust Inertial Guidance for Munitions (PRIGM)"
                                    },
                                    "Description": {
                                        "val": "The DoD relies on GPS for ubiquitous and accurate positioning, navigation, and timing (PNT). With the increased prevalence of intentional GPS jamming, spoofing, and other GPS-denial threats, GPS access is increasingly unavailable in contested theaters and alternative sources of PNT are required.  In particular, guided munitions navigation is the most immediate and among the most demanding of GPS-denial challenges, due to the necessity of operating in highly contested theaters and the stringent requirements for minimization of cost, size, weight, and power consumption (CSWaP). The Precise Robust Inertial Guidance for Munitions (PRIGM) program will develop low-CSWaP inertial sensor technology for GPS-free munitions navigation.  PRIGM comprises two focus areas: 1) Development of a Navigation-Grade Inertial Measurement Unit (NGIMU) that transitions state-of-the-art micro-electro-mechanical systems (MEMS) to DoD platforms by 2020; and 2) Research and development of Advanced Inertial MEMS Sensors (AIMS) to achieve gun-hard, high-bandwidth, high dynamic range navigation requirements with the objective of complete autonomy in 2030.  PRIGM will advance state-of-the-art MEMS gyros from TRL-3 devices to a TRL-6 transition platform (complete IMU) that enables Service Labs to perform TRL-7 field demonstrations.  PRIGM will exploit recent advances in heterogeneous integration of photonics and complementary metal-oxide semiconductor (CMOS) and advanced MEMS technology to realize novel inertial sensors for application in extreme dynamic environments and beyond navigation-grade performance.\n\nFuture warfighting scenarios will take place in a GPS-denied world.  When GPS is not available inertial sensors will provide autonomous positioning and navigation information.  For successful transition to the warfighter, these sensors need to be low-CSWaP, have unprecedented precision and stability, and be immune to the perturbations of external vibrations and temperature fluctuations.  PRIGM will identify, investigate, and demonstrate novel inertial sensing schemes that are capable of being miniaturized once proof of concept is complete.  Advanced research efforts are funded in PE 0602716E, Project ELT-01 and advanced development efforts funded in PE 0603739E, Project MT-15."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.624"
                                            },
                                            "Text": {
                                                "val": "-  Develop models to simulate novel chip-scale inertial sensors such as optical waveguide gyroscopes and optically interrogated MEMS gyroscopes and accelerometers.\n-  Develop MEMS and photonic integration processes demonstrating new and novel approaches to inertial sensing.\n-  Build experimental test setup to support short-loop experiments for development of novel photonic-MEMS gyroscopes and accelerometers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.753"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.753"
                                            },
                                            "Text": {
                                                "val": "-  Integrate component technology and demonstrate photonic-MEMS inertial sensors with beyond-navigation-grade stability and precision.\n-  Optimize novel optical and MEMS inertial sensor designs through modeling and simulation after completing initial experimental characterization.\n-  Test navigation-grade inertial sensor performance robustness to external perturbations such as vibration and shock."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantum and Materials Basics"
                                    },
                                    "Description": {
                                        "val": "Advanced materials and novel devices have often become the basis for new and asymmetric military capabilities.  The adoption of Gallium arsenide (GaAs) monolithic microwave integrated circuits greatly increased the range and effectiveness of U.S. radar systems, and recently matured Gallium Nitride (GaN) technology will be deployed with even greater capabilities.  However these major investments were only possible after materials were advanced to a level of maturity that a device program could be executed.  The Quantum and Materials Basics (QMB) program will investigate basic materials and device physics to mature concepts to the point that functioning components could be tested.  These materials promise performance that will radically change future military systems, far exceeding the state of the art but only after they can be matured.  The community is pushing towards the ultimate limits set by quantum mechanics, and managing this scaling requires fundamental research.  Promising avenues of research include highly linear 1D and 2D devices and materials that would increase the dynamic range of RF transceivers; coupling of electrical, acoustic, and\/or optical fields to significantly reduce the size and improve performance of RF components; and addressing the most outstanding challenges to deploying timing and sensing devices based on modern atomic physics and technology."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Select candidate devices and materials for QMB development and maturation.  \n-  Determine performance targets by using basic material parameters and physics to extrapolate the limits of future military capabilities.\n-  Perform proof-of-concept demonstrations to prioritize the most critical development challenges.\n-  Create simplified devices such as transistors out of the selected materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Microscale Plasma Devices (MPD)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Microscale Plasma Devices (MPD) program was to design, develop, and characterize MPD technologies, circuits, and substrates.  The MPD program focused on development of fast, small, reliable, high carrier-density, micro-plasma switches capable of operating in extreme conditions, such as high-radiation and high-temperature environments.  Specific focus was given to methods that provide efficient generation of ions that can perform robust signal processing of RF through light electromagnetic energy over a range of gas pressures.  Applications for such devices are far reaching, including the construction of complete high-frequency plasma-based circuits, and microsystems with superior resistance to radiation and extreme temperature environments.  MPDs were developed in various circuits and substrates to demonstrate the efficacy of different approaches.  MPD-based microsystems are demonstrated in DoD applications where electronic systems must survive in extreme environments.\n\nThe Basic Research part of this effort focused on fundamental MPD research to advance scientific knowledge based on the study of several key MPD design parameters.  These parameters included ultra-high pressure and high carrier density regimes.  MPD focused on expanding the design space for plasma devices enabling revolutionary advances in micro-plasma device performance.  MPD developed innovative concepts and technologies that are clearly disruptive with respect to the current state of the art in terms of switching speed (less than 100 picoseconds), carrier density (exceeding 1E18 per cubic centimeter), and capable of operation and robustness in extreme high-radiation or high-temperature (600degC) environments.  Fundamental scientific knowledge derived from MPD is also expected to drive developments in commercialization of MPD technology developed and funded in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed investigations examining scaling properties for plasma devices in terms of size, density, robustness and switching speed.\n-  Finalized studies on fundamental frequency, efficiency and power limitations of generating high-power microwave through terahertz (THz) frequency signals utilizing plasma as a robust, non-linear up-conversion medium.\n-  Completed the optimization of devices that perform from RF through light frequencies.\n-  Transitioned fundamental research findings into improved commercial modeling simulation and design tool capabilities, enabling DoD relevant applications that require survivability in extreme radiation and temperature environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Micro-coolers for Focal Plane Arrays (MC-FPA)"
                                    },
                                    "Description": {
                                        "val": "The Micro-coolers for Focal Plane Arrays (MC-FPA) program developed low size, weight, power, and cost (SWaP-C) cryogenic coolers for application in high-performance infrared (IR) cameras.  It is well known that the sensitivity of an IR focal-plane array (FPA) is improved by cooling its detectors to cryogenic temperatures.  The disadvantages of state-of-the-art cryo-coolers are their large size, high power and high cost.  On the other hand, thermoelectric (TE) coolers used in low performance IR cameras are relatively small, but are inefficient, and it is difficult to achieve temperatures below 200 Kelvin (K).\n\nTo reduce IR camera SWaP-C, innovations in cooler technology are needed.  This program exploited the Joule-Thomson (J-T) cooling principle, in a silicon-based Micro Electro-Mechanical Systems (MEMS) technology, to develop and demonstrate wafer-scale integrated micro-cryogenic IR FPA coolers with very low SWaP-C.  MEMS microfluidics, piezoelectric MEMS, and CMOS electronics were used to demonstrate an integrated cold head and compressor, all in a semiconductor chip.  This program has related applied research efforts funded under PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated single-stage J-T cooling chip with external compressor.\n-  Completed design and began development of the extended shortwave IR FPA.\n-  Began preliminary design of a 3-stage J-T micro-cooler."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MS-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "77.942"
                        },
                        "CurrentYear": {
                            "val": "53.060"
                        },
                        "BudgetYearOne": {
                            "val": "65.609"
                        },
                        "BudgetYearOneBase": {
                            "val": "65.609"
                        },
                        "BudgetYearTwo": {
                            "val": "60.387"
                        },
                        "BudgetYearThree": {
                            "val": "63.780"
                        },
                        "BudgetYearFour": {
                            "val": "85.138"
                        },
                        "BudgetYearFive": {
                            "val": "85.138"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides the fundamental research that underpins the development and assembly of advanced nanoscale and bio-molecular materials, devices, and electronics for DoD applications that greatly enhance soldier awareness, capability, security, and survivability, such as materials with increased strength-to-weight ratio and ultra-low size, devices with ultra-low energy dissipation and power, novel spectroscopic sources, and electronics with persistent intelligence and improved surveillance capabilities."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6.666"
                                        },
                                        "Text": {
                                            "val": "-  Supported increased efforts in basic research that engage a wider set of universities and commercial research communities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Nanoscale\/Bio-inspired and MetaMaterials"
                                    },
                                    "Description": {
                                        "val": "The research in this thrust area exploits advances in nano\/micro-scale and bio-inspired materials, including computationally based materials science, in order to develop unique microstructures, material properties, and functionalities.  This area also includes efforts to develop the underlying science for the behavior of materials whose properties have been engineered at the nano\/micro-scale level, including metamaterials, bio-inspired materials for sensing and actuation, and materials that are designed to mimic biological materials from molecular to macroscopic function.  Specific examples of areas of interest include materials that can self-repair, adapt, and respond for soldier protection against chemical and biological threats and novel approaches to optical based or metamaterial imaging systems capable of detecting objects in cluttered environments and around or through structural obscurants leveraging multiple degrees of freedom of light and using all photon pathways."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.140"
                                            },
                                            "Text": {
                                                "val": "-  Developed a method for screening non-natural polymer libraries for designed properties such as binding to target molecules. \n-  Developed a method for sequencing non-natural polymers at low concentrations.  \n-  Analyzed the statistics of direct vs indirect path photons from an object in a scene, as captured by traditional imaging systems.\n-  Analyzed the statistics of direct vs indirect path photons for imaging objects in different scenes, including inside a building, in an urban canyon, and in a military tank formation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.210"
                                            },
                                            "Text": {
                                                "val": "-  Use non-natural polymer synthesis and screening system to create affinity reagents against DARPA-defined targets. \n-  Develop strategy to adapt the non-natural polymer synthesis and screening system to modify affinity reagent properties. \n-  Initiate the development of a foundational theoretical framework, based on the Plenoptic function, for exploring the limits of exploiting multiple degrees of freedom of light and extracting the maximum amount of information from complex scenes. \n-  Initiate the design of experiments to validate theoretical models for 3D scene rendering using multiple degrees of freedom of light."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.300"
                                            },
                                            "Text": {
                                                "val": "-  Improve the binding affinity of non-natural polymers against DARPA-defined targets. \n-  Generalize developed non-natural polymer library screening strategies across multiple target classes. \n-  Continue the development of a comprehensive Plenoptic function theoretical framework for extracting information for all photon pathways in a complex scene rendering. \n-  Theoretically determine the fundamental limits of maximum light\/scene information extraction from a single viewpoint.\n-  Conduct laboratory experiments to validate the theoretical predictions for maximum information extraction from complex scenes using the multiple degrees of freedom described by the Plenoptic function."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fundamentals of Nanoscale and Emergent Effects and Engineered Devices"
                                    },
                                    "Description": {
                                        "val": "The Fundamentals of Nanoscale and Emergent Effects and Engineered Devices program seeks to understand and exploit a broad range of physical properties and new physics that emerge as a result of material and\/or device structure and organization at nano-scale dimensions and\/or at extreme temperature and pressure.  There are a wide variety of material properties that currently exist only at the nanoscale including quantized current-voltage behavior, very low melting points, high specific heats, large surface to volume ratio, high efficiency catalysis, enhanced radiative heat transfer, and correlated electron effects that arise in low dimensional systems.  In addition, extreme high pressure conditions can lead to new material polymorphs or phases with dramatically enhanced physical, mechanical and functional properties.  The focus of this thrust is to further characterize these emergent properties and to identify new synthesis approaches to enable access to these properties in stable, bulk material systems suitable for a wide range of DoD applications.  The insights gained from research performed under this thrust will enable new, more efficient, and powerful material and device architectures that will benefit many DoD applications including controllable photonic devices that operate over multiple wavelengths, ultra-high sensitivity magnetic sensors, high-throughput biochemical sensors for known and unknown (engineered) molecules, ultra-precision air and water purification systems, materials for hypersonic aircraft, and advanced armor protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.543"
                                            },
                                            "Text": {
                                                "val": "-  Continued synthesis of suites of intermediates to lead to selected extended solids. \n-  Initiated characterization of the physical, structural, and chemical properties of intermediates synthesized. \n-  Furthered the development of methods to stabilize extended solids at ambient temperatures and pressures. \n-  Based on computational analysis and experimental results, initiated design retrosynthetic pathways that are synthetically achievable for multistep reaction schemes to fabricate extended solids at reduced pressures. \n-  Identified novel approaches for enabling three dimensional (3D) assemblies of nanoscale material constructs into micron-scale structures while preserving desirable nanoscale material properties. \n-  Selected candidate nanoscale material systems with superior material properties that are amenable to 3D assembly processes.  \n-  Identified promising pick and place technologies for assembling 3D micron-scale constructs into cm-scale structures.\n-  Began to explore the ability to assemble micron-scale, 3D, and multiple material structures from nanoscale material constructs while reserving desirable nanoscale material properties.\n-  Initiated the pick and place assembly of cm-scale materials from micron-scale constructs while preserving desirable nanoscale material properties."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.100"
                                            },
                                            "Text": {
                                                "val": "-  Continue development of methods to stabilize extended solids at ambient temperatures and pressures. \n-  Demonstrate synthesis and stability to ambient temperature and pressure of high density extended carbon-based materials (e.g., clathrates, allotropes, and oxides) at the multimilligram scale.\n-  Explore scalable production methods for fabrication of tough ceramic materials.  \n-  Refine and implement development of retrosynthetic pathways that are synthetically achievable for multistep reaction schemes to fabricate extended solids at reduced pressures based on computational analysis and stabilization results. \n-  Further demonstrate the ability to assemble micron-scale, 3D, and multiple material structures from nanoscale material constructs while preserving desirable nanoscale material properties. \n-  Continue to demonstrate pick and place assembly of cm-scale materials from micron-scale constructs while preserving desirable nanoscale material properties.  \n-  Initiate development of a computational framework for predicting the emergence of non-linear effects in complex systems. \n-  Design an open source, agent based hardware\/software platform for evaluating algorithms for modeling non-linear effects in complex systems across multiple scales."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.045"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.045"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate development of methods to stabilize extended solids at ambient temperatures and pressures. \n-  Demonstrate synthesis and stability to ambient temperature and pressure of high density extended carbon-based materials (e.g., clathrates, allotropes, and oxides) at the gram scale. \n-  Demonstrate fabrication at the >100 gram scale and validation testing of tough ceramic materials.\n-  Demonstrate multistep reaction synthetic pathways based on retrosynthetic designs to fabricate extended solids at reduced pressures based on retrosynthetic designs and stabilization results. \n-  Develop nanometer and micron scale mechanical manipulation tools to support assembly tasks at the nanometer to micron scales. \n-  Build 1 cm or larger structures with controlled internal complexity from feedstock consisting of individual atoms or molecules. \n-  Demonstrate the ability to exploit the computing capacity offered by nonlinear systems to simulate nonlinear dynamical systems. \n-  Develop analog computing substrates for efficiently simulating systems governed by complex non-linear phenomena."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Photon Science"
                                    },
                                    "Description": {
                                        "val": "The Basic Photon Science thrust is examining the fundamental science of photons, and their interactions in integrated devices, from their inherent information-carrying capability (both quantum mechanically and classically), to novel modulation techniques using not only amplitude and phase, but also orbital angular momentum.  The new capabilities driven by this science will impact DoD through novel approaches to communications, signal processing, spectroscopic sensing, and imaging applications.  For example, fully exploiting the computational imaging paradigm and associated emerging technologies will ultimately yield ultra-low size, weight, and power persistent\/multi-functional intelligence, surveillance, and reconnaissance systems that greatly enhance soldier awareness, capability, security, and survivability.  One focus of this thrust is to explore approaches for optical frequency division and harmonic generation for applications such as time distribution from ultrastable optical clocks, ultra-low phase noise microwaves, frequency references, table-top sources of coherent x-rays, and isolated attosecond pulses.  In addition, this thrust will pursue novel, chip-scale optical frequency comb sources and associated technologies throughout the electromagnetic spectrum for spectroscopic sensing and demonstrate their performance with proof-of-concept studies in targeted applications.  These sources will enable and spawn entirely new fields in simultaneous remote sensing, identification, and quantification of multiple trace materials in spectrally cluttered backgrounds."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.400"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated 30 GHz microwave output from a silica disk microresonator-based optical frequency comb and high-power photodiodes for chip-based, ultra-low phase noise microwave generation. \n-  Demonstrated on-chip frequency comb and pulse shaping components utilizing indium phosphide based photonic integrated circuit technology and evaluated with bulk scale reference combs. \n-  Demonstrated high flux soft x-ray production in the biologically critical water window spectral region and used this source for preliminary x-ray imaging demonstrations on the nanometer scale. \n-  Demonstrated high efficiency-per-shot laser driven neutron production and constructed increased repetition rate sample target inserter and laser amplifiers to improve overall neutron flux for radiography applications. \n-  Demonstrated and controlled ultra-high intensity, long wavelength lasers, which can be used to generate high average power, high energy isolated attosecond (the timescale of electron dynamics in atoms and molecules) optical pulses. \n-  Developed and controlled microresonator-based frequency comb sources in the mid-infrared spectral region. \n-  Developed and controlled microresonator-based frequency comb sources in the visible spectral region. \n-  Demonstrated proof-of-concept studies of coherent control concepts for frequency comb-based spectroscopic sensing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.750"
                                            },
                                            "Text": {
                                                "val": "-  Design a rack mounted package for mode-locked laser based optical frequency division microwave source. \n-  Demonstrate RF photonic bandpass filtering with micro-resonator optical frequency combs. \n-  Demonstrate a remotely operating quartz microwave oscillator slaved via optical frequency comb based free-space (wireless) time and frequency transfer.  \n-  Demonstrate femtosecond time-resolved imaging at the nanometer scale with soft x-rays generated via high harmonic generation (tabletop scale x-ray source).  \n-  Demonstrate stability and characterization capabilities of extreme ultraviolet\/soft x-ray attosecond end-station by measuring and characterizing isolated attosecond (10^-18 seconds) pulses.\n-  Demonstrate proof-of-concept broadband chip-scale comb sources in multiple spectral regions. \n-  Demonstrate proof-of-concept dual-comb quantum cascade lasers on the same chip in mid-infrared.\n-  Demonstrate massively parallel spectroscopy in a lab setting for the detection of multiple trace species in a cluttered environment using chip-scale frequency combs in multiple spectral regions. \n-  Investigate the fundamental limits of photon transduction to enable a mechanistic description of the photodetector trade space including timing, resolution, efficiency and speed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.264"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.264"
                                            },
                                            "Text": {
                                                "val": "-  Develop a rack mounted package for mode-locked laser-based optical frequency division microwave source and all components for a chip-scale source.\n-  Demonstrate chip-scale RF photonic down conversion and filtering based on optical frequency comb technology.  \n-  Show full integration of laser and end-station to realize a microjoule, isolated attosecond beamline, representing a new capability for research in ultrafast electronics.\n-  Demonstrate tabletop bio-imaging with nanometer spatial resolution (using tabletop high harmonic x-ray source). \n-  Improve and tailor to specific DoD environments the performance of broadband chip-scale comb sources in multiple spectral regions. \n-  Develop simulated field test environments for massively parallel spectroscopy for the detection of multiple trace species in a cluttered environment using chip-scale frequency combs in multiple spectral regions. \n-  Demonstrate cavity-enhanced comb-spectroscopy methods for massively parallel spectroscopy of multiple trace species in a cluttered environment.\n-  Determine a quantitative, first-principles description of photon detector performance for specific DoD platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Quantum Technologies"
                                    },
                                    "Description": {
                                        "val": "This thrust emphasized a quantum focus on technology capabilities including significantly improved single photon sources, detectors, and associated devices useful for quantum metrology, communications, and imaging applications.  It also exploited novel optical nonlinearities that can be used to combine quantum systems with classical coherent pulses to enable secure quantum communications over conventional fiber at rates compatible with commercial telecommunications.  In addition, this thrust examined other novel classes of materials and phenomena that have the potential to provide novel capabilities in the quantum regime, such as GPS-independent navigation via atom interferometry and communications, and ultrafast laser technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.193"
                                            },
                                            "Text": {
                                                "val": "-  Developed improvements towards compact optomechanical gyroscopes.  \n-  Demonstrated techniques with better than 50 nm resolution with applications towards magnetic imaging of living cells. \n-  Began studies to sense functional changes of electronic spin labels in biomolecules (e.g., proteins, lipids) with high spatial and temporal resolution.\n-  Validated optimized performance of slow-beam-optical-clock. \n-  Integrated prototype macroscopic quantum communications systems into local quantum communications testbeds. \n-  Quantified performance of prototype macroscopic quantum communications system under realistic conditions (loss, noise, decoherence) and over secure long haul communications distances. \n-  Developed an initial mathematical framework for predicting the emergence of quantum behavior in complex systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TRS-01"
                    },
                    "ProjectTitle": {
                        "val": "TRANSFORMATIVE SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.740"
                        },
                        "CurrentYear": {
                            "val": "38.390"
                        },
                        "BudgetYearOne": {
                            "val": "53.070"
                        },
                        "BudgetYearOneBase": {
                            "val": "53.070"
                        },
                        "BudgetYearTwo": {
                            "val": "56.632"
                        },
                        "BudgetYearThree": {
                            "val": "68.102"
                        },
                        "BudgetYearFour": {
                            "val": "69.617"
                        },
                        "BudgetYearFive": {
                            "val": "69.056"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Transformative Sciences project supports research and analysis that leverages converging technological forces and transformational trends in information-intensive subareas of the social sciences, life sciences, manufacturing, and commerce.  The project integrates these diverse disciplines to improve military adaptation to sudden changes in requirements, threats, and emerging\/converging trends, especially trends that have the potential to disrupt military operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of the Living Foundries program is to create a revolutionary, biologically-based manufacturing platform for the DoD and the Nation.  With its ability to perform complex chemistries, be flexibly programmed through DNA code, scale, adapt to changing environments and self-repair, biology represents one of the most powerful manufacturing platforms known.  Living Foundries seeks to develop the foundational technological infrastructure to transform biology into an engineering practice, speeding the biological design-build-test-learn cycle and expanding the complexity of systems that can be engineered.  Ultimately, Living Foundries aims to provide game-changing manufacturing paradigms for the DoD, enabling adaptable, on-demand production of critical and high-value molecules.\n\nLiving Foundries will develop tools to simplify, abstract, and standardize the biological production pathway optimization process.  Additionally, Living Foundries will identify the fundamental design rules that govern the construction and organization of underlying genetic elements in the production pathways.  Research thrusts include developing the fundamental tools, capabilities and methodologies to accelerate the biological design-build-test cycle, thereby reducing the extensive cost and time it takes to engineer new systems and expanding the complexity and accuracy of designs that can be built.  The result will be rapid design, construction, implementation, and testing of complex, higher-order genetic networks with programmable functionality.  Applied research for this program is budgeted in PE 0602715E, Project MBT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.250"
                                            },
                                            "Text": {
                                                "val": "-  Examined design tool innovations to enable forward engineering of novel genetic systems.\n-  Investigated evaluation tools to enable massively parallel testing, validation, and verification of engineered systems.\n-  Continued development of automated and scalable, large-scale DNA assembly and editing tools and processes.\n-  Researched new methods for integrated feedback to exploit high volume data generation and inform future designs and processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.250"
                                            },
                                            "Text": {
                                                "val": "-  Begin demonstrating forward engineering of novel genetic systems using innovative computational design tools.\n-  Implement evaluation tools for high-throughput testing, validation, and verification of engineered systems.\n-  Implement novel learning systems that enable iterative design of engineered systems using integrated feedback of results to inform subsequent designs.\n-  Incorporate automated and scalable, large-scale DNA assembly, editing tools and processes into automated, integrated design-build-test-learn technologies for engineering novel biological systems.\n-  Develop new chassis for engineering biology for improved metabolic flux for bioproduction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.185"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.185"
                                            },
                                            "Text": {
                                                "val": "-  Improve design tools through incorporation of large scale process and test data for forward engineering novel genetic systems.\n-  Integrate evaluation tools for high-throughput testing, validation, and verification of engineered systems.\n-  Integrate novel learning systems that enable iterative design of engineered systems using integrated feedback of results to inform subsequent designs.\n-  Optimize integration of design-build-test-learn technologies for high-fidelity, high-throughput, low cost engineering of biological systems.\n-  Implement new biological chassis for improved yield and production of biochemicals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Open Manufacturing program will reduce barriers to manufacturing innovation, speed, and affordability of materials, components, and structures.  This will be achieved by investing in technologies to enable affordable, rapid, adaptable, and energy-efficient manufacturing, to promote comprehensive design, simulation and performance-prediction tools, and exposure to best practices.  The applied research component of this program is funded in PE 0602715E, Project MBT-01 under Materials Processing and Manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Text": {
                                                "val": "-  Developed basic architecture and statistical environment to enable rapid qualification and certification approaches through the interaction and use of probabilistic models for process, design, and materials.\n-  Demonstrated Micro-Induction Sintering (MIS) method for additive manufacture of metal and\/or ceramic materials in complex geometries.\n-  Demonstrated an approach to verify, validate, and quantify uncertainty in the developed rapid qualification frameworks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.038"
                                            },
                                            "Text": {
                                                "val": "-  Characterize material produced using micro-induction sintering process.\n-  Develop fundamental process modeling tools for micro-induction sintering process.\n-  Demonstrate approach to integrate the Open Manufacturing rapid qualification frameworks into a comprehensive computational tool."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "-  Establish process limits for micro-induction sintering process for specific ceramic and\/or refractory material.\n-  Analyze and quantify ability to accurately predict material properties of refractory and metal matrix composites produced using micro-induction sintering through process models previously developed, integrated with the overall Open Manufacturing framework.\n-  Assess and quantify the uncertainty in the Open Manufacturing framework model that accurately predicts part performance based on manufacturing method, environment and integrated probabilistic models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biological Robustness in Complex Settings (BRICS)"
                                    },
                                    "Description": {
                                        "val": "The Biological Robustness in Complex Settings (BRICS) program will leverage newly developed technologies to enable radical new approaches for engineering biology.  An emerging field, engineering biology is focused on developing the tools to harness the powerful synthetic and functional capabilities of biology.  These tools will facilitate design and biological production of new chemicals and materials, sensing capabilities, therapeutics, and numerous other applications.  This rapidly developing technological capability opens the door to new applications that have previously been out of reach, and offers substantial potential advantages in terms of cost and novel functionality.\n\nFundamental work in this area will focus on understanding the underlying principles for engineering robust and safe microbes and microbial communities that perform as designed over the long-term.  This program has applied research efforts funded in PE 0602715E, Project MBT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.849"
                                            },
                                            "Text": {
                                                "val": "-  Initiated investigation of methods to engineer microorganisms that are stable over long time periods under complex growth conditions.\n-  Initiated investigation of methods to engineer communities of microorganisms with reliably controlled population dynamics.\n-  Began to explore methods to rationally engineer functional microbial communities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.080"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate methods to engineer organisms that are functionally stable over time in changing growth conditions.\n-  Demonstrate methods to engineer complex communities of microorganisms with reliably controlled population dynamics.\n-  Demonstrate methods to rationally engineer functional microbial communities of increasing complexity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.235"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.235"
                                            },
                                            "Text": {
                                                "val": "-  Combine consortia engineering technologies to develop communities that can be employed to solve specific DoD-relevant problems.\n-  Demonstrate the functional stability of engineered communities in complex environments over relevant time scales.\n-  Demonstrate potential for safe use of engineered consortia under conditions relevant to specific applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding Biological Complexity*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Applying Biological Complexity at Scale\n\nBiological systems operate over an enormous range of spatial, physical, and temporal scales and span individual cells to multi-organism systems.  This project seeks to enhance the understanding of the basic processes associated with biological network interactions, communication, and control to enable novel approaches and technology development to enhance national security.   Applications range from infectious disease mitigation or prevention, to predicting and leveraging biological systems for managing communities of microorganisms.  Key advances expected from this research will include the identification of approaches to create stable, predictable, and dynamic control mechanisms of biological networks.  Such information will allow the determination of a biosystem's state and enable the prediction of state."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate predictive design rules and engineering approaches for integrated biosystems. \n-  Initiate research into biological systems with reduced complexity to facilitate predictive design for biological engineering. \n-  Research cross-scale biological system responses to varying stimuli to understand defining characteristics of dynamic states.\n-  Investigate dynamics and thresholds for transgene stability\/instability in systems of infectious disease vectors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.250"
                                            },
                                            "Text": {
                                                "val": "-  Initiate efforts to assess the utility of new experimental model systems to inform practical engineering with complex biological systems.\n-  Begin to identify candidate metrics and measurement technology relevant to engineering with complex biological systems.\n-  Investigate synergistic integration of disease vector detection and control strategies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Forecasting of Social Dynamics (MFSD)"
                                    },
                                    "Description": {
                                        "val": "Exploiting prior work in the areas of social media and social networks in programs such as Social Media in Strategic Communication (SMISC) in this project and Graph-theoretical Research in Algorithm Performance & Hardware for Social networks (GRAPHS) in project CCS-02, the Modeling and Forecasting of Social Dynamics (MFSD) program will develop and demonstrate modeling capabilities that anticipate changes in social systems.  The U.S. military works with local populations in an effort to strengthen relationships and gain new allies for purposes of security cooperation, with successful engagement fundamental to meeting these objectives.  Current approaches to engagement planning are more art than science and rigorous approaches for understanding the social dynamics of local populations are lacking.  MFSD will address this need by developing and demonstrating analogical societal models that, while reduced in scope, preserve the key properties of full social systems while remaining amenable to simulation.  MFSD will rigorously test and validate the resulting models and establish the limits to the predictive capability they provide.  Social media and other computer-mediated communications provide an important opportunity both as drivers of social dynamics and as indicators of social attitudes.  The techniques that MFSD creates will enable the U.S. military to engage more effectively with local populations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Formulate analogues to human social systems that preserve key properties while remaining amenable to laboratory experimentation and computational simulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Build initial analogical-model-based simulations for social phenomena.\n-  Develop techniques for testing models for social dynamics using real-world data including historical, current events, and social media and\/or other online data.\n-  Initiate development of a decision support tool for predicting the effectiveness of alternative engagement options."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering Complex Systems"
                                    },
                                    "Description": {
                                        "val": "Engineering Complex Systems will pursue new approaches to engineer complex, multi-cellular systems for enhanced capabilities and function.  Complex biological materials and systems have unique properties (e.g., controlled porosity and high strength-to-weight ratios) not only because of the inherent components but also because of how those components are assembled together across length scales.  Engineering biology tools and techniques are now at a stage to pursue the organization and function of multi-cellular systems for a new class of improved capabilities.  This program will develop underlying technological platforms to enable information driven assembly of hierarchical multi-cellular systems for the development of advanced materials."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Text": {
                                                "val": "-  Investigate methods for specifying cellular behavior in response to environmental cues and positional information.\n-  Begin development of biological systems that have genetically encoded three-dimensional forms of specified dimensions.\n-  Begin development of gene expression circuits that confer desirable surface properties to a multi-cellular community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Decoding Neural Activity"
                                    },
                                    "Description": {
                                        "val": "Decoding Neural Activity seeks to utilize measures of physiological state and neural intention to improve the performance of semi-autonomous and supervised machine learning systems.  Through the integration of new techniques from computer science, mathematics, signal processing, and statistics, this effort will investigate new methods for combining physiological and environmental data to decode neural signals and communicate information to computational platforms.  Research within this effort will include the generation of novel sensors as well as improved architecture, mathematics, and procedures underlying algorithms and analysis.  Successful research in this thrust will inform the development of tools to improve the performance of interfaces and communication between humans and machines.  Potential applications range from learning systems and human-machine collaboration to assisted human operations and advanced manned-unmanned system teaming."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.100"
                                            },
                                            "Text": {
                                                "val": "-  Begin to develop methods to integrate physiologically generated signals with automated computational systems.\n-  Investigate architecture, mathematics, and procedures to improve analysis and interpretation of neural signals in real-time.\n-  Explore methods to improve signal processing for direct measurements of physiological and neurophysiological state."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vanishing Programmable Resources (VAPR)"
                                    },
                                    "Description": {
                                        "val": "The Vanishing Programmable Resources (VAPR) program will create microelectronic systems capable of physically disappearing (either in whole or in part) in a controlled, triggerable manner.  The program will develop and establish an initial set of materials and components along with integration and manufacturing capabilities to undergird a fundamentally new class of electronics defined by their performance and transience.  These transient electronics ideally should perform in a manner comparable to Commercial Off-The-Shelf (COTS) systems, but with limited device persistence that can be programmed, adjusted in real-time, triggered, and\/or sensitive to the deployment environment.  Applications include sensors for conventional indoor\/outdoor environments (buildings, transportation, and materiel), environmental monitoring over large areas, and simplified diagnosis, treatment, and health monitoring in the field.  VAPR will explore transience characteristics of electronic devices and materials as well as build out an initial capability to make transient electronics a deployable technology for the DoD and Nation.  The technological capability developed through VAPR will be demonstrated through a final test vehicle of a transient sensor with RF link.\n\nA basis set of transient materials and electronic components with sufficient electronic and transience performance is needed to realize transient electronic systems for environmental sensing and biomedical applications.  Research and development of novel materials for implementing basic transient electronic components (actives and passives), power supply strategies, substrates and encapsulants as well as development of modes and triggers for transience will form the core of fundamental research activities.  Transient components and devices developed in this technical area will form the basis for advanced functional circuit blocks and test systems to be developed in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.815"
                                            },
                                            "Text": {
                                                "val": "-  Established an initial set of electronic materials that exhibit a useful combination of transience and the necessary physical characteristics required for sufficient electronic performance.\n-  Demonstrated glass substrates that shatter into vanishingly small pieces when triggered with an electrical current.\n-  Demonstrated bonding of electronic circuits to transience glass substrates and transferred glass fracturing into these electronic circuits to form vanishing electronic devices.\n-  Demonstrated transient polymer packaging with sufficient stiffness to support electronic assemblies.\n-  Demonstrated rapid transience of high stiffness transient polymer packaging.\n-  Began developing and refining device modeling tools that incorporate transience effects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.522"
                                            },
                                            "Text": {
                                                "val": "-  Develop polymers with desired mechanical strength and transient characteristics for VAPR sensors.\n-  Elucidate and model the physical mechanisms governing materials\/device transience.\n-  Integrate transient components of a sensor with RF link system (acoustic sensor, silicon RF and digital circuits, and on-board power) to demonstrate triggered disappearance of an integrated system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Social Media in Strategic Communication (SMISC)"
                                    },
                                    "Description": {
                                        "val": "The Social Media in Strategic Communication (SMISC) program developed techniques to detect, classify, measure, and track the formation, development, and spread of ideas and concepts (memes) in social media.  These techniques will provide warfighters and intelligence analysts with indications and warnings of adversary efforts to propagate purposefully deceptive messaging and misinformation.  Social media creates vulnerabilities that can be exploited to threaten national security and has become a key operating environment for a broad range of extremists.  SMISC developed technology and a new supporting foundational science of social networks will enable warfighters to defend against malevolent use of social media and to counter extremist influence operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.076"
                                            },
                                            "Text": {
                                                "val": "-  Integrated algorithms for meme detection and tracking with algorithms for detecting deception, persuasion, and influence operations.\n-  Developed high fidelity diffusion models for messages, narratives, and information across social media.\n-  Refined algorithms for sentiment analysis of content on developing social multi-media platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}