{
    "id": "aaac60a43350dbac531514d556ddf9889c22500e",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0207134F"
        },
        "ProgramElementTitle": {
            "val": "F-15E Squadrons"
        },
        "R1LineNumber": {
            "val": "135"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "233.898"
            },
            "CurrentYear": {
                "val": "205.979"
            },
            "BudgetYearOne": {
                "val": "356.717"
            },
            "BudgetYearOneBase": {
                "val": "356.717"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "216.006"
            },
            "BudgetYearThree": {
                "val": "200.672"
            },
            "BudgetYearFour": {
                "val": "177.836"
            },
            "BudgetYearFive": {
                "val": "231.937"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "1623.045"
            }
        },
        "ProgramElementNote": {
            "val": "This program, BA 07 PE 0207134F, project 670131, Mode 5\/ADS-B, is a new start.\n\nIn FY 2015, PE 0207134F, F-15E Squadrons, Project 670131, Initial Operational Test and Evaluation, F-15 EPAWSS development efforts were transferred to PE 0207171F, F-15 EPAWSS, Project 676038, EPAWSS in order to provide budget transparency."
        },
        "ProgramElementMissionDescription": {
            "val": "The F-15 is the most versatile fighter in the world today.  The F-15C\/D continues to provide air superiority with an undefeated and unmatched aerial combat record.  The F-15E retains this air superiority capability and adds systems, such as advanced imaging and targeting systems, to meet the requirement for all-weather, deep penetration, and night\/under-the-weather, air-to-surface attack.  Configured with conformal fuel tanks (CFTs), the F-15E deploys worldwide with minimal tanker support and arrives combat-ready.  A mainstay in operations both domestic and abroad, upgrades to the F-15 (avionics, armament, airframe, and engines) are critical to maintaining combat viability (lethality, survivability, and supportability).  Projected to remain in service past 2040, avionics modernization is key to long-term weapon system viability.  This modernization is built on a foundation of technical and acquisition support studies (both internal to the Air Force and through outside contractors), forestalling obsolescence, exploiting proven technological advances, and leveraging new technology.  Major avionics upgrades center around radar modernization (both hardware and software upgrades) and the exploitation of enhanced capability via precision timing, data delivery and processing technology, precision registration systems, cockpit Heads Up Display (HUD) and Heads Down Display, instrumentation digitization and modernization, central computer processing power increases, digital mission event recording systems and an infrared (IR) based fire control system.  The proliferation of fourth generation enemy aircraft and sophisticated \"double-digit\" anti-aircraft missile systems pose a significant threat to F-15 survivability.  A fully integrated electronic warfare suite holds the promise of providing survivability as well as expanded electronic attack capability. Nearly all improvements are linked to an aircraft operational flight program update schedule that works to integrate new capabilities with the airframe.  These updates are a responsive way to increase the offensive and defensive capability and survivability of the F-15.  Incorporation of corresponding spiral and\/or phased technology\/equipment improvements that include support equipment, mission planning systems, and training device upgrades will improve performance, supportability, and aircrew training. This includes technical and acquisition-related studies to ensure F-15 lethality and survivability beyond 2040.\n\nThe2017 funding request was reduced by $4.238 million to account for the availability of prior year execution balances.\n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "241.969"
                },
                "CurrentYear": {
                    "val": "179.283"
                },
                "BudgetYearOne": {
                    "val": "255.081"
                },
                "BudgetYearOneBase": {
                    "val": "255.081"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "233.898"
                },
                "CurrentYear": {
                    "val": "205.979"
                },
                "BudgetYearOne": {
                    "val": "356.717"
                },
                "BudgetYearOneBase": {
                    "val": "356.717"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.071"
                },
                "CurrentYear": {
                    "val": "26.696"
                },
                "BudgetYearOne": {
                    "val": "101.636"
                },
                "BudgetYearOneBase": {
                    "val": "101.636"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-6.100"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "32.796"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-8.071"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "101.636"
                                },
                                "BudgetYearOneBase": {
                                    "val": "101.636"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY16 was increased by $20M for AESA Radars for ANG and $12.796M for requested transfer from APAF for MIDS JTRS.  Also reduced $6.1M for IRST Delays.\nFY17 - increase of $13.3M to address Mode 5\/Automatic Dependent Surveillance Broadcast (ADS-B) and ADCP II"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "670131"
                    },
                    "ProjectTitle": {
                        "val": "Initial Operational Test and Evaluation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "71.159"
                        },
                        "CurrentYear": {
                            "val": "44.969"
                        },
                        "BudgetYearOne": {
                            "val": "86.926"
                        },
                        "BudgetYearOneBase": {
                            "val": "86.926"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "203.054"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This program, BA 07 PE 0207134F, project 670131, Mode 5\/Automatic Dependent Surveillance Broadcast (ADS-B), is a new start.\n\nIn FY 2015, PE 0207134F, F-15E Squadrons, Project 670131, Initial Operational Test and Evaluation, F-15 EPAWSS development efforts were transferred to PE 0207171F, F-15 EPAWSS, Project 676038, EPAWSS in order to provide budget transparency."
                        },
                        "ProjectMissionDescription": {
                            "val": "This includes development of the F-15C and F-15E Advanced Display Core Processor (ADCP) II and Mode 5\/ADS-B new start.  The ADCP II will develop a common mission computer for the F-15C and F-15E.  The current mission computers of both platforms have reached their limits of speed, memory and throughput.  Additionally, digital systems have changed the security requirements of both platforms and the older mission computers cannot be upgraded to meet these new requirements.  A common mission computer is expected to reduce overall development costs as well as long term maintenance costs.  The program will also develop a new F-15C cockpit display to replace an obsolete one. Mode 5 enables the NSA-mandated Mode 5 encryption and anti-jam for Air-Air Interrogator (AAI) and Identification Friend or Foe (IFF) systems.  ADS-B provides Air Traffic Control position and other secondary surveillance data and must be installed on all CONUS aircraft by 2020 IAW FAA mandate.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Display Core Processor (ADCP) II"
                                    },
                                    "Description": {
                                        "val": "Program provides a new central computer for the entire F-15E fleet, replacing the ACDP I.  Program also provides a new central computer, Remote Interface Unit and Vertical Situation Display Replacement for the AESA-radar F-15C fleet, replacing the VCC and the existing F-15C Vertical Situation Display.  This includes technical and acquisition-related studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "71.159"
                                            },
                                            "Text": {
                                                "val": "Conducted EMD activities. Continued software and hardware development and testing. Began F-15E Electronic Systems Integration Lab (ESIL) Testing. Continued delivery of EMD ADCP II LRUs.  Began prequalification for Flight Worthiness Testing (FWT). Prepared for developmental testing (DT) flight testing on F-15E aircraft. Completed USDR, SRR, PDR & CDR. This includes technical and acquisition-related studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "44.969"
                                            },
                                            "Text": {
                                                "val": "Conducted EMD activities. Completed FWT and continue qualification activities and ESIL testing. Began F-15C ESIL Testing. Completed hardware deliveries for ADCP II LRU, VSDR & RIU. Began F-15E Developmental Flight Test. Conducted F-15E System Verification Review #1. This includes technical and acquisition-related studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "78.626"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "78.626"
                                            },
                                            "Text": {
                                                "val": "Complete F-15E Development Flight Test, begin F-15C Development Flight Test, and begin F-15C and F-15E Force Development Evaluation (FDE). Conduct F-15C System Verification Review #1. Conduct Milestone C and  conduct Flight Qualification Testing (FQT). This includes technical and acquisition-related studies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mode 5\/ADS-B"
                                    },
                                    "Description": {
                                        "val": "Mode 5 enables the NSA-mandated Mode 5 encryption and anti-jam for Air-Air Interrogator (AAI) and Identification Friend or Foe (IFF) systems.  The Mode 5 program will remove, upgrade, and then replace the existing APX-114 and APX-119 on all F-15 aircraft in order to add Mode 5 capability. ADS-B provides Air Traffic Control position and other secondary surveillance data and must be installed on all CONUS aircraft by 2020 IAW FAA mandate. The ADS-B program will upgrade the APX-119 on all F-15 aircraft in order to meet the FAA mandate."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.300"
                                            },
                                            "Text": {
                                                "val": "Funding will be used for Mode 5 and ADS-B development. This includes technical and acquisition-related studies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA07: Line Item # F01500"
                                    },
                                    "Title": {
                                        "val": "Aircraft Modification: F-15: PEs 0207130\/0207134\/0207445\/0809731"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "387.314"
                                        },
                                        "CurrentYear": {
                                            "val": "644.336"
                                        },
                                        "BudgetYearOne": {
                                            "val": "476.060"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "476.060"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "489.257"
                                        },
                                        "BudgetYearThree": {
                                            "val": "530.457"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA07: Line Item # 000071"
                                    },
                                    "Title": {
                                        "val": "Aircraft Replacement Support Equip (BP12)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA07: Line Item # F0150P"
                                    },
                                    "Title": {
                                        "val": "F-15 Post Production Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.122"
                                        },
                                        "CurrentYear": {
                                            "val": "3.253"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.039"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.039"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.583"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.613"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA06: Line Item # 000999"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\/Repair Parts (BP16)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24.785"
                                        },
                                        "CurrentYear": {
                                            "val": "61.961"
                                        },
                                        "BudgetYearOne": {
                                            "val": "58.263"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "58.263"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "37.805"
                                        },
                                        "BudgetYearThree": {
                                            "val": "38.512"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Program is a continuation of effort which includes the development for all F-15 models.  Funds are executed organically in support of equipment improvement, study, analysis, and test.  Acquisition and management strategies for each program are independently developed and use a variety of contract methods and types to accomplish program objectives."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "The individual program reference to \"various\" contract methods addresses other government costs for trainers, test, hardware, special studies, telemetry kits, etc. that are required to meet each program's objectives.  The execution vehicles between these DoD entities vary by effort.\n\nFY15PB - Project Number 670131 includes ADCP II only. EPAWSS is now under PE 027171F, Project Number 676038. \n\nFY16PB - Project Number 670131 includes ADCP II only. EPAWSS is moved in FY 16 from PE 027171F, Project Number 676038 to PE 027171F, Project Number 657108.\n\nFY17PB - Project Number 670131 includes ADCP II & Mode 5\/ADS-B. EPAWSS is moved in FY 16 from BA07 PE 027171F, Project Number 676038 to BA05 PE 027171F, Project Number 657108."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "F-15 ADCP II Contract"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St Louis, MO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "55.808"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "33.532"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "75.331"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "75.331"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "164.671"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 ADCP II"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.981"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.210"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.076"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.076"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "26.267"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 EPAWSS (Pre-MDAP)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 C\/D\/E Mode 5\/ADS-B"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-08"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.300"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "The individual program reference to \"various\" contract methods addresses other government costs for trainers, test, hardware, special studies, telemetry kits, etc. that are required to meet each program's objectives.  The execution vehicles between these DoD entities vary by effort."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.370"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.227"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.219"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.219"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-09"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.816"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "ADCP II EMD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADCP II F-15E DT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADCP II F-15C DT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADCP II FDE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADCP II MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADCP II Production Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mode 5\/ADS-B DT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676020"
                    },
                    "ProjectTitle": {
                        "val": "F-15"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "162.739"
                        },
                        "CurrentYear": {
                            "val": "161.010"
                        },
                        "BudgetYearOne": {
                            "val": "269.791"
                        },
                        "BudgetYearOneBase": {
                            "val": "269.791"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "216.006"
                        },
                        "BudgetYearThree": {
                            "val": "200.672"
                        },
                        "BudgetYearFour": {
                            "val": "177.836"
                        },
                        "BudgetYearFive": {
                            "val": "231.937"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1419.991"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "These development efforts include F-15 Radar Enhancements Electronic Protection (EP) capabilities, Operational Flight Program (OFP) upgrades, Flight Testing, Infrared Search and Track (IRST) and Multifunctional Information Distribution System-Joint Technical Radio System (MIDS-JTRS).\n\nThe Radar Enhancements (EP) will upgrade the digital Active Electronic Scanned Array (AESA) radar capabilities to counter sophisticated electronic threats.  Suite 7C introduces EP into the C\/D-model fleet. Initial EP capability for APG-82(V)1 equipped E model aircraft will take place in Suite 8E. Suite 9 will add additional EP capability to both the F-15E and F-15C. \n\nFor the F-15 to maintain operational effectiveness, the program must continuously provide the platforms with improved capabilities.  To accomplish this there is an on-going need to develop software and hardware upgrades and to flight test new capabilities and systems.   The OFP funding line allows the Air Force to release software upgrades approximately every 3 years.  At any one time, there will normally be three OFP upgrades in work: one in requirements definition\/pricing, one in code writing and test, and one in flight test and release preparation.  The Flight Test funding line allows the Air Force to fund the on-going test effort. \n\nInfrared Search and Track (IRST) system will provide air to air detection, tracking and ranging capability for F-15C\/D in a radar-denied environment.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Flight Program (OFP) Development Efforts"
                                    },
                                    "Description": {
                                        "val": "Provides OFP program software and hardware updates to integrate new capabilities on all F-15 aircraft.  This includes technical and acquisition related studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "109.602"
                                            },
                                            "Text": {
                                                "val": "Continued Suite 7C (S7C) development and operational flight testing. Continued coding, conducted bench testing and flight testing of Suite 8E (S8E). Continued integration of Litening, Alpha 2 Lite, AIM-9X, and Joint-Air-to-Surface Standoff Missile-Extended Range (JASSM-ER), Universal Armament Interface (UAI) into the S8E OFP. Continued Small Diameter Bomb (SDB)-II and B61-12 Life Extension Program (LEP, aka B61-12) weapon integration into S8E OFP.  Accomplished acquisition actions to integrate B61-12 into Suite 8.0.1N.  Continued Suite 9 development.  Continued organic software support and Special Projects development efforts.  Continued funding support for all F-15 trainers.  Continued Problem Reports (PR) and Deficiency Reports (DR) fixes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "77.200"
                                            },
                                            "Text": {
                                                "val": "Delivered S7C to the field.  Continued integration of Sniper on the F-15C to meet critical PACOM requirement. Completed S8E development and flight testing.  Completed JASSM-ER and Litening integration and flight testing to field with S8E.  Awarded contract for B61-12 LEP integration into S8.01N.  Continued S9 development and integration of major line items; such as Data Transfer Module (DTM) II, Passive Attack Display (PAD),and EPAWSS.  Additionally, MIDS-JTRS will be integrated into F-15 OFPs.  Continued organic software support and Special Projects development efforts.  Continued funding support for all F-15 trainers.  Continued ongoing Problem Report (PR) and Deficiency Report (DR) fixes.  Perform technical and acquisition related studies to ensure F-15 lethality and survivability beyond 2040."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "102.077"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "102.077"
                                            },
                                            "Text": {
                                                "val": "Deliver S8E to the field. Continue B61-12 weapon integration into S8.0.1N OFP.  Continue S9 development and integration of major line items:  such as DTM II, PAD, EPAWSS, MIDS-JTRS and rehosting B61-12LEP.  Additionally, MIDS-JTRS will be integrated into the F-15 OFPs.  Continuation of organic software support and Special Projects development efforts.  Continue funding support for all F-15 trainers.  Continue ongoing Problem Report (PR) and Deficiency Report (DR) fixes.  Perform technical and acquisition related studies to ensure F-15 lethality and survivability beyond 2040."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Test"
                                    },
                                    "Description": {
                                        "val": "Flight tested improvements initiated in prior years.  Baselined infrastructure and personnel support for F-15 Developmental Test (DT) and Initial Operational Test & Evaluation (IOT&E) operations.  Purchased long-lead test support assets and unique aircraft test instrumentation.  This included technical and acquisition related studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.858"
                                            },
                                            "Text": {
                                                "val": "F-15 Flight Test Support provided contractor support cadre at Eglin and Nellis for DT\/IOT&E support, avionics integration, lab operations and maintenance (O&M), Combined Test Facility (CTF) O&M, and long-lead test unique equipment; i.e., program specific aircraft instrumentation, AIM-120 instrumentation kits, data reduction\/handling equipment. Richter Lab security upgrades nearing completion. Advanced Electronically Scanned Array (AESA) radar synthetic doppler target generator design and prototypes completed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.246"
                                            },
                                            "Text": {
                                                "val": "F-15 Flight Test Support provides prime contractor support cadre at Eglin and Nellis for DT\/IOT&E support, avionics integration, lab O&M, CTF O&M, and long-lead test unique equipment; i.e., program specific aircraft instrumentation, weapons instrumentation kits, data reduction\/handling equipment. Completed Richter Lab security upgrades and lay in provisions for AESA radar equipment. Provided field-ready AESA radar target generators for Eglin and Nellis.  Repaired APG-63 and APG-82 radar test aircraft instrumentation. This includes technical and acquisition-related studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.549"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.549"
                                            },
                                            "Text": {
                                                "val": "F-15 Flight Test Support provides contractor support cadre at Eglin and Nellis for DT\/IOT&E support, avionics integration, lab O&M, CTF O&M, and long-lead test unique equipment; i.e., program specific aircraft instrumentation, weapons instrumentation kits, data reduction\/handling equipment. Repair radar test aircraft instrumentation. Begin design of replacement radar test aircraft obsolete instrumentation. Complete Richter Labs AESA radar provisions. This includes technical and acquisition-related studies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-15 Radar Enhancements"
                                    },
                                    "Description": {
                                        "val": "Improvements to F-15 Radar Enhancements (EP). This includes technical and acquisition related studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.008"
                                            },
                                            "Text": {
                                                "val": "Continued implementation of EP into Suite 8 (S8E) & Suite 9 (S9).  Continued radar integration in support of S9 EP development. Continued jammer development. Continued Special Projects testing support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.421"
                                            },
                                            "Text": {
                                                "val": "Continued implementation of EP into S8E & S9.  Continued Special Projects testing support.  Began EP and Combat ID candidate risk reduction for future OFP integration.  Studied and analyzed F-15 radar performance against future threat baselines.  Developed and tested low technology readiness level (TRL) radar candidates for future integration. This includes technical and acquisition-related studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "64.191"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "64.191"
                                            },
                                            "Text": {
                                                "val": "Continue implementation of EP into S8E & S9.  Continue Special Projects testing support.  Begin EP and Combat ID candidate risk reduction for future OFP integration.  Study and analyze F-15 radar performance against future threat baselines.  Develop and test low technology readiness level (TRL) radar candidates for future integration. This includes technical and acquisition-related studies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-15 Infrared Search and Track (IRST)"
                                    },
                                    "Description": {
                                        "val": "The Infrared Search and Track (IRST) system will provide the F-15C\/Ds with the capability to detect and track objects by infrared radiation. The IRST complements other onboard sensors by scanning a large volume of air space, fills gaps left by other sensors. This capability complements the radar to enhance survivability and lethality against air-to-air threats, provides a passive infrared sensor system that searches for and detects infrared energy, and provides the aircraft mission computer track file data on infrared targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.271"
                                            },
                                            "Text": {
                                                "val": "Initiated technical and acquisition related studies.  Initiated early acquisition planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.347"
                                            },
                                            "Text": {
                                                "val": "Initiated technical and acquisition related studies. Continued acquisition planning. Executed risk reduction activities required to support the Integration phase."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.838"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.838"
                                            },
                                            "Text": {
                                                "val": "Continue technical and acquisition related studies. Continue acquisition planning including Integration (including OFP updates), Test, and Deployment contracts award. Execute risk reduction activities required to support the Integration phase."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-15 Multifunctional Information Distribution System - Joint Tactical Radio System (MIDS-JTRS)"
                                    },
                                    "Description": {
                                        "val": "This upgrade integrates and installs a new Link 16 system on the F-15C & F-15E that complies with an NSA mandate on cryptographic modernization and an FAA mandate on frequency remapping. The FAA mandate requires all fielded Link-16 terminals incorporate the frequency re-mapping capability by 2020."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.796"
                                            },
                                            "Text": {
                                                "val": "This upgrade integrated and installed a new Link 16 system on the F-15C& F-15E that complies with an NSA mandate on cryptographic modernization and an FAA mandate on frequency remapping. The FAA mandate requires all fielded Link-16 terminals incorporate the frequency re-mapping capability by 2020. This includes technical and acquisition-related studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "44.136"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "44.136"
                                            },
                                            "Text": {
                                                "val": "Funding will be used for buying test articles, updating the software on LRUs, and integrating the LRUs with Suite 9 OFP. This includes technical and acquisition-related studies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "V3"
                                    },
                                    "Description": {
                                        "val": "The Non Recurring Effort (NRE) will develop and deliver draft Time Compliance Technical Orders (TCTO) to upgrade F-15 D aircraft to the APG-63 (V)3 configuration.  This includes aircraft currently equipped with the APG-63(V)0 and APG-63(V)1 Mechanically Scanned Array (MSA) radar systems.  This effort will also allow for the retention of the existing APX-114 AAI and the APX-119 Mode 5 IFF Modification."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "The Non Recurring Effort (NRE) will develop and deliver draft Time Compliance Technical Orders (TCTO) to upgrade F-15 D aircraft to the APG-63 (V)3 configuration.  This includes aircraft currently equipped with the APG-63(V)0 and APG-63(V)1 Mechanically Scanned Array (MSA) radar systems.  This effort will also allow for the retention of the existing APX-114 AAI and the APX-119 Mode 5 IFF Modification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # F01500"
                                    },
                                    "Title": {
                                        "val": "F-15 Modification of In-Service Aircraft,  PEs 0207130, 0207134, 0207445, 0809731"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "387.314"
                                        },
                                        "CurrentYear": {
                                            "val": "644.336"
                                        },
                                        "BudgetYearOne": {
                                            "val": "476.060"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "476.060"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "489.257"
                                        },
                                        "BudgetYearThree": {
                                            "val": "530.457"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA06: Line Item # 000999"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\/Repair Parts (BP16)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24.785"
                                        },
                                        "CurrentYear": {
                                            "val": "61.961"
                                        },
                                        "BudgetYearOne": {
                                            "val": "58.263"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "58.263"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "37.805"
                                        },
                                        "BudgetYearThree": {
                                            "val": "38.512"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA07: Line Item # F0150P"
                                    },
                                    "Title": {
                                        "val": "F-15 Post Production Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.122"
                                        },
                                        "CurrentYear": {
                                            "val": "3.253"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.039"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.039"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.565"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.613"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA07: Line Item # 000071"
                                    },
                                    "Title": {
                                        "val": "Aircraft Replacement Support Equip (BP12)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Program is a continuation of effort which includes the development of all F-15 models.  Funds are executed organically in support of equipment improvement, study, analysis, and test.  Acquisition and management strategies for each program are independently developed and use a variety of contract methods and types to accomplish program objectives."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "The individual program reference to \"various\" contract methods addresses other government costs for trainers, test, hardware, special studies, telemetry kits, etc. that are required to meet each program's objectives.  The execution vehicles between these DoD entities vary by effort."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "OFP Suite 7\/8\/9\/10 Development and Test"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St. Louis, MO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "108.886"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "76.083"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "100.927"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "100.927"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-08"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "394.436"
                                                    },
                                                    "TotalCost": {
                                                        "val": "680.332"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "OFP Suite 7\/8\/9\/10 Development and Test Various"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 Radar Enhancement"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St Louis, MO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "27.660"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "18.421"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "64.191"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "64.191"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-08"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "215.852"
                                                    },
                                                    "TotalCost": {
                                                        "val": "326.124"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 Radar Enhancement Various"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 Infrared Search and Track"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.271"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.347"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "38.838"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "38.838"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "141.450"
                                                    },
                                                    "TotalCost": {
                                                        "val": "197.906"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Multifunctional Information Distribution System-Joint Technical Radio System (MIDS-JTRS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St. Louis, MO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.796"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "44.136"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "44.136"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "56.932"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "V3"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St. Louis, MO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "20.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "20.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "The individual program reference to \"various\" contract methods addresses other government costs for trainers, test, hardware, special studies, telemetry kits, etc. that are required to meet each program's objectives.  The execution vehicles between these DoD entities vary by effort."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Boeing (Contractor Test Support)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St. Louis, MO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "19.858"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "20.246"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "20.549"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "20.549"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-08"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "74.713"
                                                    },
                                                    "TotalCost": {
                                                        "val": "135.366"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Flight Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "The individual program reference to \"various\" contract methods addresses other government costs for trainers, test, hardware, special studies, telemetry kits, etc. that are required to meet each program's objectives.  The execution vehicles between these DoD entities vary by effort."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Mgt Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.064"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.117"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.150"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-09"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.331"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "OFP Continuous Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OFP Suite 7C Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OFP Suite 8E Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OFP Suite 9 MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OFP Suite 9 EMD Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OFP Suite 9 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Radar Enhancements Suite 8E Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Infrared Search and Track Integration and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Infrared Search and Track Integration and Test MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Infrared Search and Track Integration and Test EMD Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Multifunctional Information Distribution System-Joint Technical Radio System (MIDS-JTRS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}