{
    "id": "b0cfeafe6bb3be8819ce6892a37d18a60c892a67",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA3_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603710A"
        },
        "ProgramElementTitle": {
            "val": "Night Vision Advanced Technology"
        },
        "R1LineNumber": {
            "val": "49"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "46.056"
            },
            "CurrentYear": {
                "val": "40.929"
            },
            "BudgetYearOne": {
                "val": "44.468"
            },
            "BudgetYearOneBase": {
                "val": "44.468"
            },
            "BudgetYearTwo": {
                "val": "40.635"
            },
            "BudgetYearThree": {
                "val": "46.500"
            },
            "BudgetYearFour": {
                "val": "47.872"
            },
            "BudgetYearFive": {
                "val": "40.108"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates sensor technologies that increase Warfighter situational awareness, survivability and lethality by providing sensor capabilities to acquire and engage targets at longer ranges in complex environments and operational conditions (e.g. day\/night, obscured, smoke, adverse weather and other degraded visual environments). Project K70 pursues technologies that improve the Soldier's ability to see at night and to   provide rapid wide area search.  It also demonstrates technologies that provide the ability to perform multispectral aided target detection (AiTD), to integrate disparate sensor architectures, and to enable passive long range target identification (ID). Project K86 matures and evaluates sensors and algorithms designed to detect targets (vehicles and personnel) in camouflage, concealment and deception from airborne platforms. It provides pilotage and situational awareness imagery to multiple pilots\/crew members independently for enhanced crew\/aircraft operations in day\/night\/adverse weather conditions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "44.119"
                },
                "CurrentYear": {
                    "val": "40.929"
                },
                "BudgetYearOne": {
                    "val": "44.968"
                },
                "BudgetYearOneBase": {
                    "val": "44.968"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "46.056"
                },
                "CurrentYear": {
                    "val": "40.929"
                },
                "BudgetYearOne": {
                    "val": "44.468"
                },
                "BudgetYearOneBase": {
                    "val": "44.468"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.937"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.500"
                },
                "BudgetYearOneBase": {
                    "val": "-0.500"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.300"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.363"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.500"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "K70"
                    },
                    "ProjectTitle": {
                        "val": "Night Vision Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.765"
                        },
                        "CurrentYear": {
                            "val": "26.740"
                        },
                        "BudgetYearOne": {
                            "val": "27.293"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.293"
                        },
                        "BudgetYearTwo": {
                            "val": "23.302"
                        },
                        "BudgetYearThree": {
                            "val": "29.157"
                        },
                        "BudgetYearFour": {
                            "val": "30.186"
                        },
                        "BudgetYearFive": {
                            "val": "30.230"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates high-performance integrated sensor technologies that increase target detection ranges, extend target identification ranges, and reduce target acquisition (TA) timelines, for dismounted Soldiers and tactical vehicles, against threats that are beyond today's detection ranges or are partially obscured by terrain, weather or other features.\n\nThis Project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Air and Soldier Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Communications-Electronics Research, Development, and Engineering Center (CERDEC) \/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Weapon Sight Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops, integrates and demonstrates critical components for the next generation of weapon sight systems for mounted and dismounted Soldier use to provide improved actionable intelligence and the tools to assist in recognizing and identifying friend or foe."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.848"
                                            },
                                            "Text": {
                                                "val": "Improved sensor processing efficiency and demonstrated crew served weapon sight with increased range, identification capability and reduced Size, Weight, and Power (SWaP); leveraged new optical design and high performance uncooled infrared detector to complete design of next generation sniper weapon sight with reduced SWaP; began design studies of conformal head mounted composite waveguide displays with day\/night usability and wireless interface for remote display of weapon sight imagery."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Ground Persistent Surveillance and Targeting"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates high-performance integrated sensor\/multi-sensor technologies to increase local Situational Awareness (SA) and target discrimination capabilities and to reduce TA timelines for dismounted Soldiers, combat vehicles, tactical robots, ground sensors and urban sensors against threats that are beyond the ranges of current technologies and discrimination capabilities, or that are partially obscured."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.650"
                                            },
                                            "Text": {
                                                "val": "Matured and validated algorithms for ground to air infrared search and track capabilities; optimized techniques, to include rotating camera(s), stacked prisms, and staring arrays, to improve 360 degree coverage and increase affordability; demonstrated high resolution target tracking and identification for target handoff and engagement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Sensors for Precision"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies that allow combat vehicle commanders and crewmen to detect, identify and locate threat targets more rapidly to enable fire control for platform weaponry. The effort leverages advanced Infrared (IR) imaging technology, three-dimensional (3D) imaging sensor techniques, emerging laser technologies and precise far target location technology to increase target detection range and reduce target acquisition timelines. This effort supports the Army's Active Protection System (APS) program, whose objective is to mature and demonstrate active protection technologies to reduce vehicle weight while reducing reliance on armor.  This is accomplished through the use of other means such as sensing, early warning, Hostile Fire Detection (HFD), and active countermeasures to provide increased protection against current and emerging threats.  Follow on work for Fiscal Year (FY) 2017 is also captured in “Advanced Wide Area Search Sensors”."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.291"
                                            },
                                            "Text": {
                                                "val": "Validated low cost integrated uncooled IR sensors for SA and muzzle flash detection; improved design for active threat sensor detection of uncooled and cooled IR sensors; matured clutter rejection techniques for reduced false alarms and threat sensor point of origin determination; exploited existing and emerging laser technologies and determined limitations for suppression of threat night vision and electro-optic imaging sensors; began development of concept demonstrator hardware to demonstrate detection\/suppression in a single waveband."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.573"
                                            },
                                            "Text": {
                                                "val": "Demonstrate uncooled IR camera for SA and muzzle flash detection and on the move performance of ground HFD and algorithms; optimize design for detection of hostile uncooled and cooled IR sensors prior to threat engagement; demonstrate hostile fire clutter rejection techniques for reduced false alarms and threat sensor point of origin determination, and assess performance for an expanded threat set; validate laser technologies and limitations for pre-shot suppression of threat sensors; demonstrate stationary pre-shot detection\/suppression of threat imaging sensors at objective ranges; perform perception experiments on pre-shot suppression to determine metrics and system requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.249"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.249"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate a multi-function uncooled IR camera static system with real-time algorithms for HFD with reduced false alarms and local situational awareness on a technology demonstrator; exploit findings from static technology demonstrator to support on-the-move system support requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Interoperability"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates an interoperability architecture that allows a system to dynamically discover and leverage other systems on a network without any specific or prior knowledge.  The goal is to develop standards, data models, and protocols that provide a common language for sensor systems to connect, publish their capabilities and needs, and interact with other systems, even on disadvantaged networks.  The benefits are increased sensor collaboration, reduced decision timelines, reduced soldier load, and reduced integration costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Modeled and simulated the sensor portion of the Computing Environment (CE); matured and evaluated sensor to network standards, including implementation specifications and guides; implemented standards, demonstrated, evaluated and refined interoperability of Electro-optic\/Infrared (EO\/IR), radar sensors, Chemical, Biological, Radioactive, Nuclear, Explosive (CBRNE) systems, biometric sensors; matured and demonstrated sensor imagery and metadata products as well as Dynamic, Distributed, Discover (D3) configuration capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Develop methodologies for sensor interoperability and appropriate data flow across security classification domains; develop approaches to tailoring data request results that minimize network bandwidth requirements; improve the architecture and framework using distributed networked resources, such as storage, processing, bandwidth, to provide redundancy, robustness, and fault tolerance in both Enterprise and Tactical networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Will develop methods to enhance existing security to provide intrusion detection within an integrated sensor architecture (ISA) framework, which allows a system to dynamically discover and leverage other systems on a network without any specific or prior knowledge, across the Enterprise and Tactical networks; mature methodologies for minimizing network bandwidth and demonstrate approaches; improve sensor planning and management techniques across the architecture to maximize sensor capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier System Architecture"
                                    },
                                    "Description": {
                                        "val": "This effort designs, develops and optimizes interfaces for Soldier sensors, optics, displays and electronic systems that will be incorporated into the larger Soldier system architecture to improve the individual Soldier's effectiveness and efficiency while reducing burden and total operational costs.  This effort is coordinated with Program Element (PE) 0603001A\/Project J50, PE 0602716A\/Project H70, PE 0602786A\/Project H98, 060315A\/Project S28, and 0603004A\/Project 232."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.976"
                                            },
                                            "Text": {
                                                "val": "Developed Measures of Effectiveness \/ Measures of Performance (MOE\/MOP) for the sensor, optics, displays and electronic systems used by the individual Soldier and integrated these MOE\/MOPs into the overall Soldier System Architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.018"
                                            },
                                            "Text": {
                                                "val": "Evaluate MOE\/MOP for the sensor, optics, displays and electronic systems used by the individual Soldier and refine MOE\/MOPs as part of the overall Soldier System Architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.005"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.005"
                                            },
                                            "Text": {
                                                "val": "Will perform analyses of hardware components for sensors, optics, displays and electronic systems to inform reference architectures for Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Soldier equipment as well as planned developmental technologies; will refine MOE\/MOPs for the sensor, optics, displays and electronic systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Based Sensors and Integration for Degraded Visual Environments (DVE)"
                                    },
                                    "Description": {
                                        "val": "This effort provides uncooled IR sensor technologies to improve the survivability for manned and unmanned ground vehicle systems by providing increased SA in all conditions and environments, to include DVE.  Improvements in sensitivity and the development of signal processing techniques are needed to enable current uncooled IR sensors to penetrate obscurants that create DVE.  The integration of improved sensors, signal processing algorithms, and data fusion techniques will enable mission capabilities to be maintained in DVE (e.g. smoke, dust, fog).  This is a Joint effort with the Tank Automotive Research Development and Engineering Center under PE 0602601A, Project C05 and 0603005A, Project 221; and it is fully coordinated with PE 0602709A, Project H95."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.840"
                                            },
                                            "Text": {
                                                "val": "Assess technologies that support ground SA in DVE, to include optimized uncooled IR sensors with optical filtering or signal processing techniques, integration of sensor combinations and modalities, and fusion of sensor data; assess concepts for scalable, multi-function sensor capabilities that can be applied to tactical vehicles and combat platforms; explore industry approaches for automotive driving aids for automated personnel and obstacle detection with applicability to military environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.897"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.897"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate optical filtering and image processing enhancements in DVE to assess uncooled IR sensor performance; utilize industry approaches for automotive driving aids with applicability to military environments to begin integration of driving aids with sensor\/image processing enhancements; validate a personnel\/obstacle detection enhanced SA capability for convoy vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Maneuver and Lethality Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates dismounted Soldier capabilities that improve Soldier mobility, maneuver, situational awareness, threat detection, targeting and lethality.  Innovative technologies for Soldier weapon or head mounted sensors, head mounted displays, and tactical lasers will be provided for user evaluation.  The technologies provided through this effort address human factors\/human dimension and provide lower weight, reduced cost, and improved performance for Soldier based sensor systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.809"
                                            },
                                            "Text": {
                                                "val": "Design head mounted High Definition (HD) color displays to replace heavier and larger prism based devices to enable use with protective eyewear; incorporate improved display components for injection node and holograms to increase brightness and reduce image distortion for day\/night usability; improve Soldier target engagement by evaluating crosswind profile measurement, automated boresighting reticle, and thru sight situational awareness technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.935"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.935"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a see-through, wide field-of-view (FOV), HD color display that interfaces with current standard issue helmet mounts and Smart Battery packs; will integrate an Integrated Sensor Architecture (ISA) interface, which will provide rapid target acquisition during daytime operations by enabling the display to receive input from any dynamically discoverable sensor available on a network; will integrate an Intra Soldier Wireless (ISW) interface to provide heads-up situational awareness by  enabling imagery to be wirelessly transferred from a weapon site to the display; will demonstrate the capability of displaying Mission Command Information on the display."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Wide Area Search Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates sensing capabilities that enable platforms to detect, identify, and react to the evolving asymmetric threat to maintain operational momentum.  This effort allows combat vehicle commanders and crewmen to detect difficult or concealed small unit threats as well as to identify and apply countermeasures to enable maneuver or response. The effort leverages advanced IR imaging technology, multispectral laser technologies and precise far target location technology to increase target detection and reduce target acquisition timelines. This effort supports the Army's initiatives in new sensing modalities that integrate with existing on board systems for multi-function capabilities, with minimal weight, to enable protected mobility to increase protection against current and emerging threats.  This work is a follow on of work from “Advanced Sensors for Precision” to provide an additional level of detail."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.707"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.707"
                                            },
                                            "Text": {
                                                "val": "Will mature pre-shot threat detection\/suppression imaging sensors and lasers, which identify and eliminate threats before they can engage friendly forces; conduct field demonstration; validate IR sensor jamming techniques; characterize expendable target assets for damage thresholds; assimilate threat information into a single database."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K86"
                    },
                    "ProjectTitle": {
                        "val": "Night Vision, Abn Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.291"
                        },
                        "CurrentYear": {
                            "val": "14.189"
                        },
                        "BudgetYearOne": {
                            "val": "17.175"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.175"
                        },
                        "BudgetYearTwo": {
                            "val": "17.333"
                        },
                        "BudgetYearThree": {
                            "val": "17.343"
                        },
                        "BudgetYearFour": {
                            "val": "17.686"
                        },
                        "BudgetYearFive": {
                            "val": "9.878"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates intelligence, surveillance, reconnaissance, targeting and pilotage technologies in support of the Army's aviation and networked systems. This effort focuses on improved reconnaissance, surveillance and target acquisition and night pilotage sensors, high-resolution heads-up displays, sensor fusion, and aided target recognition (AiTR) capabilities for Army vertical lift aircraft, utility helicopters and unmanned aerial systems (UAS). UAS payload efforts mature and demonstrate small, lightweight, modular, payloads (electro-optical\/infrared, laser radar, designator) to support target detection, identification, location, tracking and targeting of tactical targets for the Brigade Combat Team.  \n\nThe Project supports Army science and technology efforts for the Air and Command, Control, Communications and Intelligence portfolios.  \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nWork in this Project is fully coordinated with Program Element (PE) 0602211A (Aviation Technology) PE 0603003A (Aviation Advanced Technology).\n\nWork in this project is performed by the Army Communications-Electronics Research, Development, and Engineering Center (CERDEC) \/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multifunction Imagers for Rotary Wing"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates multifunction sensor modules for increased pilotage performance in Degraded Visual Environments (DVE). Multifunction sensor modules provide a lower total life cycle cost than separate individual sensor systems by combining multiple capabilities in a single module. Work in this effort is coordinated with DVE efforts in PE 0602211A, Aviation Technology, Project 47A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.692"
                                            },
                                            "Text": {
                                                "val": "Fabricated a dual-purpose Infrared (IR) sensor with the dual speed Read Out Integrated Circuit (ROIC); continued integration of dual-purpose IR sensors with other low-light night vision technology; developed pilotage image processing algorithms in the dual purpose IR sensor; developed threat warning algorithms for use with IR sensor operating at 1000 Hertz  frame rate; began flight testing to validate pilotage sensor and processing technologies for performance in degraded visual environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.982"
                                            },
                                            "Text": {
                                                "val": "Complete integration of dual-purpose pilotage and threat warning IR sensors with other low-light night vision technology; characterize performance of threat warning algorithms and pilotage sensors under brownout and rain DVE through a series of laboratory, field and flight test measurements; identify performance issues and optimize threat warning algorithms and pilotage sensors.  Follow on work in Fiscal Year (FY) 2017 is captured under the title:  “Sensors and Sensor Fusion for Rotorcraft DVE Mitigation”."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Local Area ISR for Tactical Small Units"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates sensors that enable simultaneous display of wide and narrow field-of-view (FOV) infrared imagery and image fusion of multiple spectral bands for enhanced situational awareness and the ability to image battlefield laser spot locations for improved targeting accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.599"
                                            },
                                            "Text": {
                                                "val": "Conducted design trade study to retrofit existing turret with optical components to provide simultaneous wide FOV and independently steerable narrow FOV capability through optical beam splitting of the existing common sensor payload dual-band Mid Wave (MW)\/Long Wave (LW) IR camera; began maturation of a compact, high definition, 3-band (visible, near infrared, shortwave infrared) camera module to enable imaging of battlefield lasers and multi-band image fusion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.207"
                                            },
                                            "Text": {
                                                "val": "Complete design to retrofit existing turret with optical components to provide simultaneous wide FOV and independently steerable narrow FOV capability; demonstrate compact, high definition, 3-band (visible, near infrared, shortwave infrared) camera module."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.050"
                                            },
                                            "Text": {
                                                "val": "Will mature and optimize upgrade designs for existing turret electronics and hardware to provide  compatibility (command, control and data handling\/processing) with the improved camera modules and associated new capabilities; demonstrate and validate performance of optical components for simultaneous wide and independently steerable narrow field of view capability in preparation for integration into the turret; optimize multi-spectral band fusion approaches for use with high definition 3-band camera module."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pilotage Sensor Fusion"
                                    },
                                    "Description": {
                                        "val": "This effort develops and matures sensor fusion techniques to produce synthetic scene representations that provide greater information content than scenes produced from existing single mode sensor solutions.  This is accomplished through the fusion of active and\/or passive sensor outputs and the maturation of associated real-time processing algorithms and architectures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Collected field data from multiple sensor modalities (e.g. passive\/active infrared, radar, shortwave light detection and ranging) under DVE conditions; identified exploitable features associated with each modality; began development of algorithm approaches to produce synthetic scenes for presentation to the pilot."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Validate exploitable features associated with multiple sensing modalities to aid with operations under DVE; demonstrate algorithm approach for fusion of two sensor modalities that provides increased situational awareness to the pilot as compared to either single sensor modality.  Follow on work in FY17 is captured under the title:  “Sensors and Sensor Fusion for Rotorcraft DVE Mitigation”."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensors and Sensor Fusion for Rotorcraft Degraded Visual Environment (DVE) Mitigation"
                                    },
                                    "Description": {
                                        "val": "This effort leverages work previously accomplished under the “Multifunction Imagers for Rotary Wing” and “Pilotage Sensor Fusion” efforts and will mature sensing and processing approaches to improve pilotage in degraded visual environments.  It develops Longwave Infrared (LWIR) imaging sensors capable of providing actionable imagery over a wide range of DVEs.  It also demonstrates a distributed aperture sensing (DAS) approach in which sensing modules are placed around the airframe to enable 360 degree coverage and provide information on potential threats and obstacles for increased situational awareness.  The effort implements DVE-specific multimodal fusion techniques to leverage the strengths and mitigate the weaknesses of multiple sensor modalities.  Work in this effort is coordinated with DVE efforts in PE 060211A, Aviation Technology, Project 47A, and PE 0603003A, Aviation Advanced Technology, Project 313."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.125"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.125"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate fusion and DAS approaches utilizing Passive and Active IR, and RADAR sensing modalities; simulate the performance of multiple sensor combinations in DVEs; conduct airborne data collections with collocated Passive and Active IR and RADAR sensors in snow and whiteout degraded conditions; demonstrate baseline DAS scene rendering that combines data from all distributed sensors to form a 360 degree view around the aircraft; demonstrate fusion approaches that combine two and three dimensional sensor data; define the baseline approach for the implementation of sensor fusion and synthetic vision in a real-time environment; conduct trade studies to identify candidates for real-time computing hardware and architectures; exploit and leverage ongoing research in the area of digital read out integrated circuit (D-ROIC) technology to develop a D-ROIC longwave infrared camera to address DVE requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}