{
    "id": "b455b667f2e109e49e1acd1ffbde3e0b89260496",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602605F"
        },
        "ProgramElementTitle": {
            "val": "Directed Energy Technology"
        },
        "R1LineNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "126.189"
            },
            "CurrentYear": {
                "val": "115.105"
            },
            "BudgetYearOne": {
                "val": "127.163"
            },
            "BudgetYearOneBase": {
                "val": "127.163"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "120.059"
            },
            "BudgetYearThree": {
                "val": "121.530"
            },
            "BudgetYearFour": {
                "val": "124.018"
            },
            "BudgetYearFive": {
                "val": "125.791"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program covers research in directed energy (DE) technologies, primarily high energy lasers (HELs); including devices, optical beam control and integration; and high power electromagnetics (HPEM).  Laser research includes moderate to high power laser devices that are applicable to a wide range of Air Force applications, optical technologies to propagate lasers beams from a device, and integration of these technologies.  In HPEM, this research examines technologies for applications such as counter-electronics and non-lethal weapons.  Research into other novel DE applications will be conducted.  DE vulnerability\/lethality assessments are conducted and protection technologies are developed.  Research into other advanced non-conventional\/innovative weapons will be conducted.  Tools are developed and used to compare solutions and to determine the most effective and efficient DE technologies to meet Air Force needs.  This program also performs ground-based optical research for space situational awareness (SSA).  In SSA, this research uses the Starfire Optical Range and the Maui Space Surveillance System to develop and implement technologies to identify visual characteristics such as status and health of orbiting space objects.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  \n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "125.866"
                },
                "CurrentYear": {
                    "val": "115.604"
                },
                "BudgetYearOne": {
                    "val": "118.401"
                },
                "BudgetYearOneBase": {
                    "val": "118.401"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "126.189"
                },
                "CurrentYear": {
                    "val": "115.105"
                },
                "BudgetYearOne": {
                    "val": "127.163"
                },
                "BudgetYearOneBase": {
                    "val": "127.163"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.323"
                },
                "CurrentYear": {
                    "val": "-0.499"
                },
                "BudgetYearOne": {
                    "val": "8.762"
                },
                "BudgetYearOneBase": {
                    "val": "8.762"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.499"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.772"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.449"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.762"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.762"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2015 reflects reprogramming to support Research and Development Projects, 10 U.S.C. Section 2358.\n\n\nIn FY2017 increase due to increased priority of high energy laser research."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "624866"
                    },
                    "ProjectTitle": {
                        "val": "Lasers & Imaging Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "77.529"
                        },
                        "CurrentYear": {
                            "val": "75.988"
                        },
                        "BudgetYearOne": {
                            "val": "92.445"
                        },
                        "BudgetYearOneBase": {
                            "val": "92.445"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "85.160"
                        },
                        "BudgetYearThree": {
                            "val": "85.986"
                        },
                        "BudgetYearFour": {
                            "val": "87.750"
                        },
                        "BudgetYearFive": {
                            "val": "89.018"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores the technical feasibility of moderate to high power lasers, including beam control, for applications such as aircraft protection, force protection, and precision engagement from Air Force platforms.  This project investigates the effects of laser weapons on a wide range of systems and components as well as producing, modifying, validating and applying DE and non-DE concept development and assessment tools to determine which technology solutions to pursue.  Research supporting ground-based optical space situational awareness is conducted."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technologies and Directed Energy Assessments"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate high energy laser (HEL) device technologies for Air Force applications.  Develop and demonstrate optical laser beam control technologies including atmospheric compensation and pointing and tracking.  Perform laser system level modeling and simulation validated by laser effects and vulnerability testing.  Develop tools and perform assessments which allow comparisons among DE concepts and tradeoffs between DE and non-DE solutions.  Integrate optical beam control technologies with laser device technologies and demonstrate the combined technologies.  Develop and use technologies to better understand the vulnerability of weapon systems to lasers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.220"
                                            },
                                            "Text": {
                                                "val": "Continued to conduct research supporting a joint Air Force\/DARPA ground demonstration of a high power solid state laser with a beam control system. Used effects testing to establish system requirements and validate modeling efforts. Evaluated subscale turret beam control technologies. Updated and used Integrated Weapons Environment for Analysis (IWEA) to analyze directed and kinetic energy weapons in a common environment to help plan weapons investments. Used intelligence information to evaluate foreign HEL threats and provide weapon system and technology developers with tools and criteria to help protect US systems. Began integration of beam control technologies and monolithic fiber amplifier for ground to air field tests. Continued design of laser system for aircraft self-protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "48.285"
                                            },
                                            "Text": {
                                                "val": "Complete beam control and monolithic fiber amplifier integration and ground tests. Conduct effects testing to establish system requirements and validate modeling efforts. Perform airborne tests of turret beam control technologies. Begin integration of beam control and low power laser technologies for aircraft self-protection. Complete IWEA Build 1 and conduct assessments of concepts for laser weapon systems to help users plan weapons investments. Model and characterize foreign HEL threats to blue systems and provide assessments to developers for hardening materials and designs. Complete research supporting the joint Air Force\/DARPA ground HEL demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "65.570"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "65.570"
                                            },
                                            "Text": {
                                                "val": "Continue with beam control and scaling of monolithic fiber amplifier scaling using advanced fibers. Continue with the development of beam control aero-effects mitigating techniques. Continue with the conduct of effects tests to establish system requirements and validity models. Continue integration of beam control and low power laser system for future pod-mounted moderate power laser demonstration.Transition IWEA Build 1 to external users and complete IWEA Build 2  and conduct assessments of concepts for laser weapon systems.  Model and characterize foreign HEL threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Space Situational Awareness and Satellite Vulnerability"
                                    },
                                    "Description": {
                                        "val": "Develop advanced, long-range, electro-optical technologies that support ground-based optical SSA.  Develop and use technologies to better understand the vulnerability of blue satellite systems to lasers.  Operate the Starfire Optical Range in support of internal and customer requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.309"
                                            },
                                            "Text": {
                                                "val": "Developed dynamic telescope control to keep track of potential threat objects in space.  Demonstrated data analysis techniques to understand characteristics of potential space threats and satellite anomalies.  Demonstrated capabilities for significantly extending existing techniques into 24-hour operations.  Evaluated concepts for persistent monitoring of space events and concepts to image and search the local space around our high-value satellite assets, including those in geosynchronous orbits."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.703"
                                            },
                                            "Text": {
                                                "val": "Begin integration of geosynchronous satellite characterization and local-space search as components of a dynamic telescope demonstration to keep track of potential threat objects in space.  Perform comparison of capabilities for extending telescope operation into daylight hours to provide Air Force Space Command programs with technology options for their requested products.  Demonstrate techniques for persistent monitoring of space events and capability to detect threat objects in close proximity to our high-value satellite assets, including those in geosynchronous orbits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.875"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.875"
                                            },
                                            "Text": {
                                                "val": "Complete integration of geosynchronous satellite characterization and local-space search as components of a dynamic telescope demonstration to keep track of potential threat objects in space. Investigate daylight detection of geosynchronous satellites to address the long-duration gaps during daytime hours when satellites cannot normally be detected by our optical systems. Implement techniques for persistent monitoring of space events and capability to detect threat objects in close proximity to our high-value satellite assets, including those in geosynchronous orbits."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624867"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Weapons & Survivability Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.660"
                        },
                        "CurrentYear": {
                            "val": "39.117"
                        },
                        "BudgetYearOne": {
                            "val": "34.718"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.718"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "34.899"
                        },
                        "BudgetYearThree": {
                            "val": "35.544"
                        },
                        "BudgetYearFour": {
                            "val": "36.268"
                        },
                        "BudgetYearFive": {
                            "val": "36.773"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores the use of HPEM and other unconventional\/innovative weapon concepts to support applications such as nonlethal counter-personnel and electronic warfare including disruption, degradation, and damage of electronic infrastructure on Air Force platforms.  This research includes weapon technology that can provide covert effects and\/or no collateral or human damage.  The project also investigates the effects of potential adversary HPEM weapons and how to mitigate those effects on US assets, as well as producing and applying DE and non-DE concept development and assessment tools to determine which technology solutions to pursue.  HPEM includes but is not limited to high power microwaves, plasmas, particle beams and millimeter waves."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "HPEM and Unconventional  Weapon Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate technologies for HPEM components.  Investigate HPEM and other unconventional weapon concepts using innovative technologies.  Investigate advanced technologies that support force protection tactical applications, including non-lethal counter-personnel applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.697"
                                            },
                                            "Text": {
                                                "val": "Completed, in collaboration with the Navy, the first phase of the ultra-short pulsed laser atmospheric propagation studies by constructing the world's largest controlled turbulence beam line.  Conducted effects studies on electronics based on the assessments from FY14.  Developed compact 50 kilovolt solid state switch.  Developed designs for 100 megavolt test facility accelerator.  Continued development of technologies leading to more efficient, smaller, lighter, and more powerful HPEM systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.711"
                                            },
                                            "Text": {
                                                "val": "Refine ultra-short pulsed laser atmospheric propagation studies.  Conduct effects studies on electronics based on the assessments from FY15. Complete compact 50 kilovolt solid state switch.  Complete designs for 100 megavolt test facility accelerator.  Begin design of smaller, higher power, source technology for the Next Generation High Power Microwave (HPM) demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.921"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.921"
                                            },
                                            "Text": {
                                                "val": "Refine ultra-short pulsed laser atmospheric propagation studies.   Conduct effects studies on electronics based on the assessments from FY15 and FY16. Complete compact 50 kilovolt solid state switch and package it in a militarily relevant platform.  Complete design of smaller, higher power, source technology for the Next Generation HPM demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HPEM Effects and Mitigation Research"
                                    },
                                    "Description": {
                                        "val": "Assess the effects\/lethality of HPEM technologies.  Develop and apply sophisticated models to enhance the development of HPEM and related technology.  Develop tools and perform assessments which allow comparisons among DE concepts and tradeoffs between DE and non-DE solutions.   Investigate technologies to counter the effects of HPEM."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.963"
                                            },
                                            "Text": {
                                                "val": "Developed source for effects testing that operates in three microwave bands.  Completed integration of software into DE High Performance Computing Software Applications Institute, which allows modeling of DE sources and propagation that involves plasmas.  Assessed potential improvements to US weapons systems from employing HPEM weapons technologies for platform protection and target prosecution.  Used intelligence information to evaluate foreign HPEM threats and provide weapon system and technology developers with tools and criteria to help protect US systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.406"
                                            },
                                            "Text": {
                                                "val": "Complete source for effects testing that operates in three microwave bands.  Test and validate DE High Performance Computing Software Applications Institute software, which allows modeling of DE sources and propagation that involves plasmas.  Assess potential improvements to US weapons systems from employing HPEM weapons technologies for platform protection and target prosecution.  Conduct assessments of HPEM and kinetic energy weapon concepts in a common environment to help users plan weapons investments.  Model and characterize HPEM threats to blue systems and provide assessments developers for hardening materials and designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.797"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.797"
                                            },
                                            "Text": {
                                                "val": "Test and validate DE High Performance Computing Software Applications Institute software, which allows modeling of DE sources and propagation that involves plasmas and laser DE weapons.  Assess potential improvements to US weapons systems from employing HPEM weapons technologies for platform protection and target prosecution.  Conduct further assessments of HPEM and kinetic energy weapon concepts in a common environment to help users plan weapons investments.  Transition Modeling, Simulation & Analysis (MS&A) tools to the broader MS&A community.  Model and characterize current and projected HPEM threats to blue systems and provide assessments to developers for hardening materials and designs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}