{
    "id": "cb32b882887424a744f195fbfd32249f27443e24",
    "meta": {
        "filename": "dod-2017_RDTE_2017_DARPA_U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601117E"
        },
        "ProgramElementTitle": {
            "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "59.341"
            },
            "CurrentYear": {
                "val": "56.544"
            },
            "BudgetYearOne": {
                "val": "57.791"
            },
            "BudgetYearOneBase": {
                "val": "57.791"
            },
            "BudgetYearTwo": {
                "val": "65.685"
            },
            "BudgetYearThree": {
                "val": "67.882"
            },
            "BudgetYearFour": {
                "val": "66.456"
            },
            "BudgetYearFive": {
                "val": "66.456"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "60.757"
                },
                "CurrentYear": {
                    "val": "56.544"
                },
                "BudgetYearOne": {
                    "val": "62.807"
                },
                "BudgetYearOneBase": {
                    "val": "62.807"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "59.341"
                },
                "CurrentYear": {
                    "val": "56.544"
                },
                "BudgetYearOne": {
                    "val": "57.791"
                },
                "BudgetYearOneBase": {
                    "val": "57.791"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.416"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.016"
                },
                "BudgetYearOneBase": {
                    "val": "-5.016"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.416"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-5.016"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.016"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015:  Decrease reflects the SBIR\/STTR transfer. \nFY 2016:  N\/A\t\t\nFY 2017:  Decrease reflects completion of several Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program milestones."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MED-01"
                    },
                    "ProjectTitle": {
                        "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.341"
                        },
                        "CurrentYear": {
                            "val": "56.544"
                        },
                        "BudgetYearOne": {
                            "val": "57.791"
                        },
                        "BudgetYearOneBase": {
                            "val": "57.791"
                        },
                        "BudgetYearTwo": {
                            "val": "65.685"
                        },
                        "BudgetYearThree": {
                            "val": "67.882"
                        },
                        "BudgetYearFour": {
                            "val": "66.456"
                        },
                        "BudgetYearFive": {
                            "val": "66.456"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Operational Medical Science Program Element will explore and develop basic research in medical-related information and technology leading to fundamental discoveries, tools, and applications critical to solving DoD challenges.  Programs in this project address the Department's identified medical gaps in warfighter care related to health monitoring and preventing the spread of infectious disease.  Efforts will draw upon the information, computational modeling, and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  To enable in-theater, continuous analysis and treatment of warfighters, this project will explore multiple diagnostic and therapeutic approaches, including the use of bacterial predators as therapeutics against infections caused by antibiotic-resistant pathogens; developing techniques to enable rapid transient immunity for emerging pathogens; and identifying fundamental biological mechanisms that enable certain species to be tolerant to various environmental insults.  Advances in this area may be used as a preventative measure to mitigate widespread disease."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.909"
                                        },
                                        "Text": {
                                            "val": "Supports increased efforts in basic research that engage a wider set of universities and commercial research communities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT)"
                                    },
                                    "Description": {
                                        "val": "The Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program will develop the underlying technologies to rapidly respond to a disease or threat and improve individual readiness and total force health protection by providing capabilities which are currently available only in centralized laboratories in the U.S. to non-tertiary care and individual settings.  ADEPT will develop and exploit biological tools for the in vivo creation of nucleic acid circuits that continuously and autonomously sense and respond to changes in physiologic state and for novel methods to target delivery, enhance immunogenicity, or control activity of vaccines, potentially eliminating the time to manufacture a vaccine ex vivo.  ADEPT advancements to control cellular machinery include research to optimize orthogonality and modularity of genetic control elements; identify methods to increase sensitivity and specificity; and demonstrate methods to control cellular machinery in response to changes in physiological status.  ADEPT will develop methodologies for measuring health-specific biomarkers from a collected biospecimen to enable diagnostics at the point-of-need or resource limited clinical facilities (point-of-care), in-garrison or deployed.  Additionally, ADEPT will develop techniques that will enable the rapid establishment of transient immunity through stimulation of the production of components of the immune system to impart effective but temporary protection.  This transient immunity would bridge the time gap between the delivery of a vaccine and the development of a long term protective immune response.  Applied research efforts are budgeted in PE 0602115E, Project BT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.432"
                                            },
                                            "Text": {
                                                "val": "-  Collected serum from ill, convalescent, or immunized humans and identified two or more antibodies that in combination may provide disease-specific protection.\n-  Demonstrated ability to administer nucleic acid encoding multiple antibodies to protect against existing, unmet, clinical targets; emerging global infectious diseases; and known, engineered biothreats.\n-  Demonstrated onset of protection within hours after delivery and duration of therapeutic response greater than IV administered antibodies.\n-  Demonstrated response and duration of antibody-encoding nucleic acid constructs similar to that conferred by administration of preformed antibodies against infectious disease in a large animal model.\n-  Demonstrated optimized, high sensitivity assay methods for protein and nucleic acid biomarkers, suitable for incorporation in deployable devices.\n-  Demonstrated advanced materials properties and incorporation of developed materials into disposable assay formats.\n-  Demonstrated advanced methods for reagent stabilization and delivery for assays developed for deployable devices.\n-  Demonstrated sample preparation methods in conjunction with developed assays and quantified performance metrics.\n-  Demonstrated performance of developed assays using advance no\/low power microfluidic methods.\n-  Measured performance of developed diagnostic methods and demonstrated capability to measure clinically relevant analyte levels in appropriate biospecimen matrices.\n-  Demonstrated in mammalian cells the function of a synthetic circuit that can control the timing and level of expression of a protein when expressed from an RNA-based expression vector.\n-  Demonstrated in mammalian cells the function of a synthetic circuit that can integrate at least two physiological signals associated with a change in health status and respond to at least two exogenously added small molecules, and respond with a targeted change in cell state.\n-  Demonstrated the ability to generate a synthetic antibody via continuous evolution that can specifically bind to a defined target in mammalian cells.\n-  Investigated non-traditional approaches to treating infectious diseases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.400"
                                            },
                                            "Text": {
                                                "val": "-  Establish biodistribution maps in appropriate models resulting from varied delivery methods, formulations, and devices relevant to nucleic acid constructs for antibody production.\n-  Demonstrate protection conferred by delivery of nucleic acid constructs encoding two or more antibodies in validated infectious disease animal model.\n-  Submit Investigational New Drug (IND) application for transient nucleic acid-based formats against infectious disease.\n-  Demonstrate increased protective response and duration of antibody-encoding nucleic acid constructs against infectious disease in a large animal model.\n-  Conduct IND-enabling non-clinical studies of DNA-monoclonal antibody (mAb) candidate.\n-  Deliver high-sensitivity assay methods for protein and nucleic acid biomarkers for incorporation into deployable devices.\n-  Deliver advanced materials for incorporation into disposable assay formats.\n-  Deliver advanced methods for reagent stabilization and delivery for incorporation into deployable devices.\n-  Deliver sample preparation methods for incorporation into deployable devices.\n-  Demonstrate optimized performance of developed bacterial\/viral detection methods, assays, and materials using advanced no\/low power microfluidic methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.566"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.566"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate production of gene encoded antibodies in human safety trials.\n- Demonstrate efficacy of gene encoded antibodies in a human clinical trial.\n- Demonstrate the ability to identify antibodies against infectious diseases from patients in less than thirty days.\n- Use current good manufacturing processes to synthesize formulations for animal challenge study."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Harnessing Biological Systems"
                                    },
                                    "Description": {
                                        "val": "The Harnessing Biological Systems program will explore fundamental approaches to applying the advantages of nature's building blocks and principles in the design of biological technologies and systems.  Rather than creating biomimetic designs that imitate naturally evolved capabilities this program seeks to transition to a biocentric design approach, developing tools and understanding mechanisms to leverage evolutionary advances from the start.  Key advances expected from this research include identifying approaches to discover and develop new classes of dynamic therapeutics for antibiotic-resistant bacteria.  One example will be to identify the underlying mechanisms by which predatory bacteria prey upon and consume other antibiotic-resistant bacteria that are pathogenic to humans.  This approach represents a significant departure from conventional antibacterial therapies that rely on small molecule antibiotics.  Advances in this area may be applied to a range of biological technologies including the autonomous control of epidemics."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.103"
                                            },
                                            "Text": {
                                                "val": "-  Initiate studies to enhance understanding of biological adaptability in response to external pressures.\n-  Investigate predatory bacteria effectiveness against pathogens of interest. \n-  Initiate studies of the relevant underlying mechanisms of bacterial predation.\n-  Identify fundamental mechanisms that control the transition between unicellular and multicellular function. \n-  Research basic science processes by which bacteria grow and spread throughout a community. \n-  Investigate dynamics of amoeba interactions with bacterial and fungal pathogens as a potential method for improved public health."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.575"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.575"
                                            },
                                            "Text": {
                                                "val": "-  Investigate predatory bacteria effectiveness against pathogens of interest in in vivo models.\n-  Investigate mechanisms of predation and potential resistance. \n-  Develop quantitative models to describe predator-pathogen-host interactions.\n-  Analyze biosynthetic pathways of the gut microbiota to discover and characterize disease tolerance-mediating metabolites."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis and Adaptation of Human Resilience"
                                    },
                                    "Description": {
                                        "val": "The Analysis and Adaptation of Human Resilience program will explore new methods to maintain and optimize warfighter health in response to environmental insults such as new and emerging infectious diseases.  Projects in this area will apply recent advances in comparative biology, genetic sequencing, omics technologies, and bioinformatics to develop new tools for modulating health to ensure warfighter readiness.  One approach to achieve this goal is identifying the fundamental mechanisms that enable certain species to be tolerant to various environmental insults.  Genomic and physiological analyses of a wide array of resilient animal species may be combined with sophisticated algorithms to identify important patterns of survival.  By analyzing patterns in the underlying variability of host responses for resilient animals, one may formulate a survival blueprint to restore and maintain warfighter homeostasis in response to infection.  This approach is orthogonal to traditional infectious disease research, which primarily relies on reducing the pathogen load through drug intervention.  Projects within this program may enable discovery of novel methods to optimize human health against infectious diseases caused by multi-drug resistant pathogens."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.041"
                                            },
                                            "Text": {
                                                "val": "-  Develop animal testbeds to evaluate human-relevant infection across multiple resilient species.\n-  Assess diagnostic technologies that can rapidly detect pathogen load and characterize the different stages of infection in multiple animal species.\n-  Analyze experimental results and bioinformatics datasets to discover key markers of tolerance.\n-  Develop a bioinformatics library of acquired clinical retrospective data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.100"
                                            },
                                            "Text": {
                                                "val": "-  Explore methods for effectively screening animal susceptibility and disease tolerance to infection.\n-  Collect, curate, and integrate retrospective datasets into the analysis of tolerance mechanisms.\n-  Validate algorithms and analytical tools to facilitate the discovery of tolerance mechanisms.\n-  Identify approaches for intervention based on novel tolerance mechanisms in animals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Outpacing Infectious Disease"
                                    },
                                    "Description": {
                                        "val": "The Outpacing Infectious Disease thrust will investigate fundamental methods for using biology as a technology to create adaptive therapeutic response mechanisms to outpace viruses and bacteria.  Today, protective measures such as antibiotics and vaccines are often circumvented by fast-mutating viruses and bacteria that evolve to create new methods for pathogenicity.  New approaches, such as enabling co-evolution and co-transmission of newly developed therapeutics to ultimately outcompete the pathogen, are needed to utilize the power of evolution in vaccine and antibiotic design.  Key advances expected from this research include identifying methods to discover and develop new classes of dynamic therapeutics for fast-mutating viruses and antibiotic-resistant bacteria, as well as recurrent chronic diseases.  This approach represents a significant departure from conventional antibacterial and antiviral therapies, which typically rely on static solutions and continuous re-formulation and re-development in attempt to keep pace with emerging strains and disease variants.  Advances in this area may be applied to the mitigation of known, new, or emerging disease."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.550"
                                            },
                                            "Text": {
                                                "val": "-  Investigate approaches to design and build pathogen-derived therapeutics that control disease by interfering with the pathogen via dynamic mechanisms.\n-  Assess the safety, efficacy, and transmissibility of novel co-evolving therapeutics using in vitro models.\n-  Initiate design of computational models to assess host-disease-therapeutic dynamics at the individual and population levels."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}