{
    "id": "cca5ef5b880224e83004a253372969441699995b",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA2_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602705A"
        },
        "ProgramElementTitle": {
            "val": "Electronics and Electronic Devices"
        },
        "R1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "72.442"
            },
            "CurrentYear": {
                "val": "64.301"
            },
            "BudgetYearOne": {
                "val": "56.322"
            },
            "BudgetYearOneBase": {
                "val": "56.322"
            },
            "BudgetYearTwo": {
                "val": "58.884"
            },
            "BudgetYearThree": {
                "val": "59.914"
            },
            "BudgetYearFour": {
                "val": "61.784"
            },
            "BudgetYearFive": {
                "val": "63.827"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) designs and evaluates, power components and power management technologies, frequency control and timing devices, high power microwave devices, display technologies; and electronic components. The applied research on these technologies enable the ability to perform precision deep fires against critical mobile and fixed targets; investigate all-weather, day or night, theater air defense against advanced enemy missiles and aircraft; as well as investigate enhanced communications and target acquisition through support of capabilities such as autonomous missile systems, advanced land combat vehicles, smart anti-tank munitions, electric weapons, secure jam-resistant communications, automatic target recognition, foliage-penetrating radar, and combat identification. Project EM8 designs and evaluates high-power, microwave, electronic components and technologies. Project H11 designs, investigates and validates advanced power and energy technologies (batteries, alternative energy and hybrids) and power management and distribution techniques (wireless power, intelligent power management). Project H17 designs and evaluates flexible displays in conjunction with the Flexible Display Center. Project H94 researches and evaluates electronic component technologies such as photonics, micro electromechanical systems, imaging laser radar, magnetic materials, ferroelectrics, microwave and millimeter-wave components, and electromechanical systems. \n\nWork in this PE complements and is fully coordinated with efforts in PE 0602120A (Sensors and Electronic Survivability), PE 0602709A (Night Vision Technology), PE 0602782A (Command, Control, Communications Technology), PE 0602783A (Computer and Software Technology), PE 0603001A (Warfighter Advanced Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research Laboratory, Adelphi, MD. and the Army Communications-Electronics Research, Development, and Engineering Center, Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "73.422"
                },
                "CurrentYear": {
                    "val": "55.301"
                },
                "BudgetYearOne": {
                    "val": "57.002"
                },
                "BudgetYearOneBase": {
                    "val": "57.002"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "72.442"
                },
                "CurrentYear": {
                    "val": "64.301"
                },
                "BudgetYearOne": {
                    "val": "56.322"
                },
                "BudgetYearOneBase": {
                    "val": "56.322"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.980"
                },
                "CurrentYear": {
                    "val": "9.000"
                },
                "BudgetYearOne": {
                    "val": "-0.680"
                },
                "BudgetYearOneBase": {
                    "val": "-0.680"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "9.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.980"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.680"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.680"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EM4"
                    },
                    "ProjectTitle": {
                        "val": "Electric Component Technologies (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.000"
                        },
                        "CurrentYear": {
                            "val": "9.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Electronic Component applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Silicon Carbide (SiC) Research-Army Research Laboratory"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "12.000"
                                        },
                                        "Text": {
                                            "val": "Continue research on SiC power devices and power components."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Intelligent Battery Eliminator \/ Lithium-ion Capacitor Material Research, Electrolyte and Cell Experimentation"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Researched and validated cutting-edge battery eliminator technology based on lithium ion ultracapacitor designs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "9.000"
                                        },
                                        "Text": {
                                            "val": "This is a Congressional Interest Item"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EM8"
                    },
                    "ProjectTitle": {
                        "val": "High Power And Energy Component Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.800"
                        },
                        "CurrentYear": {
                            "val": "12.143"
                        },
                        "BudgetYearOne": {
                            "val": "11.416"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.416"
                        },
                        "BudgetYearTwo": {
                            "val": "11.599"
                        },
                        "BudgetYearThree": {
                            "val": "11.645"
                        },
                        "BudgetYearFour": {
                            "val": "11.878"
                        },
                        "BudgetYearFive": {
                            "val": "12.116"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the research, development, and evaluation of high-power electronic components, materials, and related technologies. These technologies have application in compact and efficient power conversion, conditioning, and management sub-systems; energy storage and conversion devices; radio frequency (RF)\/microwave and solid-state laser directed energy weapons (DEW); traditional and non-traditional RF and laser electronic attack; and RF photonics. All project elements are coordinated with and, as appropriate, leveraged by DEW and power\/energy programs in the Air Force, Navy, High Energy Laser Joint Technology Office, Defense Threat Reduction Agency, national labs, university consortia, and relevant industry and foreign partners. The products of this research are required by developers of Army and Department of Defense (DoD) systems to evolve traditional (mechanical-based) sub-systems such as geared transmissions, plate armor, and kinetic projectiles to electrically-based ones. These products will provide the Soldier enhanced survivability and lethality through increased power management and energy savings as well as new fighting capabilities offered only by electrical power.\n\nThis project sustains Army science and technology efforts supporting the Ground Maneuver, Lethality and Soldier portfolios.\n\nThe work in this project is coordinated with the Army Tank and Automotive Research, Development, and Engineering Center (TARDEC); Armaments Research, Development, and Engineering Center (ARDEC); the Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC); and the Army Communications-Electronics Research, Development, and Engineering Center (CERDEC).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork on this project is performed by the Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Power and Energy Technologies"
                                    },
                                    "Description": {
                                        "val": "Research and evaluate electronic materials, structures, and components that will enable the realization of higher energy density and efficiency required by future Army systems such as electromagnetic armor, directed energy weapons, power grid protection, and other pulsed-power systems.  Special emphasis is on components operating at high voltages - greater than (>) 10 kilovolts (kV)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.182"
                                            },
                                            "Text": {
                                                "val": "Investigated and developed advanced wide band gap materials and devices, for operation above 20 kV to support survivability, lethality systems, and high voltage microgrid application requirements; researched and evaluated high voltage packaging needs; and continue research into wide bandgap semiconductors identified in Fiscal Year (FY) 2014."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.233"
                                            },
                                            "Text": {
                                                "val": "Validate a 20 kV device and packaging concept; continue to extend the voltage and current capabilities of power switching components through modeling and research of the materials and fabrication processes; and research materials and device technologies required to understand device operation at 40 kV for use in advanced Directed Energy systems and other Lethality and Survivability applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Solid-State Laser Technology and RF Photonics for Broadband Signal Processing"
                                    },
                                    "Description": {
                                        "val": "Research novel solid-state laser concepts, architectures, and components with the goal of providing advanced laser technology to Army directed energy weapon and tactical laser developers. Exploit breakthroughs in laser technology, develop and employ innovative laser gain material, and utilize photonics to meet the stringent weight\/volume requirements for Army platforms, especially to enhance and improve the generation, transmission, reception, and processing of RF (radio frequency) signals. Applied laser research will be conducted in close collaboration with domestic and foreign material vendors, university researchers, and major laser diode manufacturers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.874"
                                            },
                                            "Text": {
                                                "val": "Investigated techniques for power scaling CW and pulsed mid-wave IR sources for IR countermeasure (IRCM) applications; and explored laser materials with enhanced thermal conductivity that will provide superior ability to meet stringent Army size, weight, and power requirements for counter rocket, artillery, and mortar (C-RAM) applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Explore novel fiber designs to increase power while preserving high beam quality for enabling laser directed energy weapons; and investigate power scaling of continuous wave (CW) and pulsed mid-wave infrared (IR) sources for IR countermeasure (IRCM) applications as well as pulsed eye-safe lasers for scanning Laser Development (LADAR) application."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will investigate bulk solid-state and fiber laser materials and architectures for power scaling with the high beam quality required for directed energy, targeting, and IRCM  applications; and design and develop RF photonic optical signal processing capabilities which will enable the near instantaneous, high resolution spectral analysis of broadband RF signal pulses with bandwidths up to 75 GHz."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy (DE) \/Electronic Attack Technologies\/Spectrum Sensing and Exploitation"
                                    },
                                    "Description": {
                                        "val": "Investigate and evaluate emerging technologies related to DE technology, electronic warfare (EW) survivability\/lethality, operations in the contested and congested electromagnetic environment, and supporting DE and EW high power components, with the goal of enhancing the survivability\/lethality of Army platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.135"
                                            },
                                            "Text": {
                                                "val": "Determined the susceptibility of emerging threat electronics (to include those related to improvised explosive devices (IEDs)) to electronic attack; characterized parameters for use in the development of neutralization waveforms and techniques; investigated Digital Radio Frequency Memory technology and its effects on jamming\/counter-jamming applications; and developed cognitive RF architecture and baseline hardware and algorithms for sensing and exploiting electromagnetic environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.325"
                                            },
                                            "Text": {
                                                "val": "Design electronic protection (EP) device technologies for Next Generation Radar requirements by examining the adaptive RF technology threat against Army radar performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.346"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.346"
                                            },
                                            "Text": {
                                                "val": "Will apply EW device forensic concepts, methodologies, and techniques to Army Counter Unmanned Aerial System (CUAS) mission applications; and study the effects of RF energy against various unmanned aerial vehicle (UAV) targets in order to develop neutralization techniques that can be incorporated into existing and emerging EW systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Components and Materials Research"
                                    },
                                    "Description": {
                                        "val": "Investigate and evaluate compact, high-efficiency, high-temperature, and high-power component technologies (e.g., semiconductor, magnetic, and dielectric devices) for hybrid-electric propulsion, electric power generation and conversion, and smart micro-grid power distribution. Research addresses current and future Army-unique performance and operational requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Investigated both gallium nitride (GaN) and silicon carbide (SiC) based electronic components for device reliability and characterize these materials; investigated advanced control and diagnostic methods for power switches to improve fault tolerance and efficiency; conducted applied research on next-generation materials and fabrication methods for compact power switching components that provide high voltage, high current, and\/or high frequency operation; and investigated and developed advanced power semiconductor devices and modules, for operation above 20kV and at high currents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.234"
                                            },
                                            "Text": {
                                                "val": "Evaluate and design reliability models of current and next generation wide bandgap electronic components for device enhancements; determine advanced control and diagnostic methods for power switches to improve fault tolerance and efficiency; and validate concept for high voltage high performance devices for operations above 20kV."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.464"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.464"
                                            },
                                            "Text": {
                                                "val": "Will evaluate the relationship between material quality and growth processes on electronic properties in GaN-based wide-bandgap materials; investigate available GaN power device architectures and material systems for improving reliability of electronic switching devices; and validate physics-based models of high-voltage power devices to enable improved performance and understanding of device operation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power System Components Integration and Control Research"
                                    },
                                    "Description": {
                                        "val": "Research and evaluate the configuration of electronic components and control strategies required to achieve high-power density and high efficiency power utilization in current and future platform sub-systems and vehicle and micro-grid (installation) applications, to include the operation of military-specific power distribution topologies at the circuit and system levels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.609"
                                            },
                                            "Text": {
                                                "val": "Conducted applied research in power management, intelligent controls, and diagnostics for power conversion modules and circuits to provide more efficient, robust, and reliable power delivery and conversion for vehicle and micro-grid power applications; investigated advanced behavior based Tactical Energy Network control and prediction techniques; and researched distributed control strategies to enable more robust and failure resistant grids (e.g. utilized swarm (hive or colony) control, where each member of the swarm represents a specific piece of equipment)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.351"
                                            },
                                            "Text": {
                                                "val": "Research and validate a universal power conversion concept that converts any input power to any output power for vehicle and micro-grid power applications; investigate controls for Tactical Energy Network control and prediction techniques allowing any power input to feed any output power specification; design distributed control and storage models to demonstrate more reliable and failure tolerant grids; and investigate through modeling and analysis the use of direct current and hybrid grid based technologies for the Army Tactical Energy Network."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.606"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.606"
                                            },
                                            "Text": {
                                                "val": "Will design electric- and magnetic-field sensors and processing algorithms to monitor micro-grid power; characterize power system components and support self-aware energy network architectures; validate distributed models and control algorithms enabling fault tolerance in Army energy networks; evaluate models of novel, distributed control and storage methods to improve energy efficiency of Army tactical energy networks; and investigate concepts for significantly reducing the volume of high-voltage power conditioning circuits, thereby enabling use in a projectiles and other compact lethality and protection systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H11"
                    },
                    "ProjectTitle": {
                        "val": "Tactical  And Component Power Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.519"
                        },
                        "CurrentYear": {
                            "val": "11.810"
                        },
                        "BudgetYearOne": {
                            "val": "8.714"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.714"
                        },
                        "BudgetYearTwo": {
                            "val": "8.295"
                        },
                        "BudgetYearThree": {
                            "val": "7.602"
                        },
                        "BudgetYearFour": {
                            "val": "7.791"
                        },
                        "BudgetYearFive": {
                            "val": "7.987"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project identifies, advances, and enhances emerging power generation, energy storage, and power management components and software. This project researches advancements in enabling power management, decision making, and distribution across the battlefield.  This project also researches materials and components to develop lightweight, higher capacity, safer and more efficient power technologies that will enable self-sustainable, energy aware, continuous power generation while on the move and across battlefield environments. \n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Soldier\/Squad and Innovative Enablers portfolios.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Power Generation Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs, investigates and validates Soldier-borne power generation and energy storage technologies in order to decrease Soldier load and power burden, increase power capabilities by providing more energy to prolong mission run-time. This effort will investigate energy harvesting devices while on the move which will enable a net zero capable Soldier. This effort will also investigate advanced hybrid battery chemistries for wearable, flexible battery designs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.519"
                                            },
                                            "Text": {
                                                "val": "Matured very high energy density hybrid power sources as a wearable conformal power source; designed a smart Soldier power grid capable of integrating energy storage and power generation devices with smart power management and distribution with little to no user interaction; matured internal components to facilitate a renewable multi-fueled Soldier portable power source; investigated a system to integrate wireless power and energy harvesting technologies into the smart Soldier power grid to reduce cabling and connectors; continued to investigate techniques to increase wireless power transfer efficiency and distance; conducted experiments on novel energy harvesting components to increase efficiency and reduce weight of carried power sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.673"
                                            },
                                            "Text": {
                                                "val": "Mature hybrid power sources to increase power and energy densities and reliability for high energy density devices; optimize electrolyte formulations and cathode materials to improve safety for higher energy and power solutions; research existing and novel energy storage and power generation components to ensure their compatibility within the Soldier power grid; increase efficiency and optimize internal components of multi-fueled generator to facilitate development of a smaller, more portable device; investigate various wireless power transfer technologies and increase efficiencies to enhance power transmission distances; research and design interoperable devices capable of utilizing energy harvesting technologies to charge Soldier wearable hybrid power sources to achieve a net-zero energy posture; investigate wireless solution for net-zero energy approach."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.034"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.034"
                                            },
                                            "Text": {
                                                "val": "Will continue to investigate energy harvesting technologies and power generation components that produce usable power\/energy for charging conformal batteries, mature internal component to facilitate a reliable power output, and conduct experiments on energy harvesting components to validate designs for increasing efficiency and power output; continue to investigate advanced lithium and hybrid battery chemistries for conformal battery designs; research novel energy storage chemistries, mature electrolyte and cathode materials to ensure safe, bullet tolerant conformal batteries, and mature components and formulations to safely increase power and energy densities to support extended missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Informed Operations"
                                    },
                                    "Description": {
                                        "val": "This effort investigates power management technologies, components and systems to increase the efficiency of energy output, reduce weight and increase reliability, while increasing fuel and cost efficiency across battlefield environments. This effort funds research in control and interface standards for effective power management, novel power distribution techniques, situational awareness, predictive, and prognostic and diagnostics capabilities for tactical power missions. This effort will also investigate brass board designs for power management and distribution in support of missions in the 1 watt – 300KW range.  Work in this effort is complemented by to PE 0603772A\/project 101."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Developed intelligent power management architecture for mobile power generation grids to enable energy informed operations for integrated command, control, communications, computers, intelligence, surveillance and reconnaissance platforms; designed a system of interconnected power grids of various voltages with multiple controllers using a master\/slave control scheme capable of supporting ad-hoc connections and configuration; established standards for renewable power generation and energy storage and incorporated into demonstration grid; established power management protocols and policies for interfacing with mission systems; developed power planning tools and applications for monitoring and controlling grid status; developed advanced 2kW fuel efficient silent power generation systems with greater than 30% fuel to electric efficiencies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.137"
                                            },
                                            "Text": {
                                                "val": "Investigate new software and physical architectures to more efficiently distribute and manage power across the battlefield while reducing size and weight; develop predictive-analysis modeling software to enhance selection and employment of energy sources during the planning and execution mission phases, respectively; continue investigating techniques to reduce the energy demand of Soldier-worn peripherals; assess draft standards for a centralized micro-grid approach and develop standards for a distributed micro-grid; design a micro-grid architecture that distributes control to various power managers between the mission command system and smart power devices allowing for a mesh power network; continue research and design of smart power devices that can be monitored and controlled by the Commander, staff, or autonomously to prioritize loads, reduce fuel consumption, and ensure reliable mission power; design and fabricate improved renewable, alternative fuel, and high fuel-efficiency power sources to supplement base power and further reduce logistic footprint."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.680"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.680"
                                            },
                                            "Text": {
                                                "val": "Will draft interface specification for new software and physical architectures to more efficiently distribute and manage power across the battlefield; assess draft standards for distributed micro-grid; investigate additional approaches to distributed designs such as hierarchal design; continue research and design of smart power devices that can be monitored and controlled by the Commander, staff, or autonomously to prioritize loads, reduce fuel consumption, and ensure reliable mission power; investigate novel distribution (wireless) technologies to reduced power loss or ease set up burden in power distribution systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H17"
                    },
                    "ProjectTitle": {
                        "val": "Flexible Display Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.555"
                        },
                        "CurrentYear": {
                            "val": "1.136"
                        },
                        "BudgetYearOne": {
                            "val": "2.356"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.356"
                        },
                        "BudgetYearTwo": {
                            "val": "2.393"
                        },
                        "BudgetYearThree": {
                            "val": "2.449"
                        },
                        "BudgetYearFour": {
                            "val": "2.499"
                        },
                        "BudgetYearFive": {
                            "val": "2.549"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The flexible electronics program will conduct applied research on the integration of electronics, power components, and sensors on non-traditional flexible substrates. The program will build upon the two-dimensional flexible electronics towards the integration of electronic components, power systems, and sensors into three-dimensional flexible architectures. The research shall include the testing and analysis of the electronic system and electronic modeling. The applied research shall support the demonstration of Army-relevant sensors on flexible substrates for robust monitoring of the human state. The flexible electronics programs efforts will extend physiological monitoring beyond the single-user, fitness-focused commercial perspective by supporting the Army goal to monitor the Soldier in training environments, determine soldier unique states, apply advance modeling to optimize the team performance based on individual uniqueness, and then apply resource distribution processes in real-time.   \n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is executed by the Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Flexible Electronics Development (previously Flexible Display Center (FDC) and Flexible Electronics Development)"
                                    },
                                    "Description": {
                                        "val": "The flexible electronics program is advancing applied research towards the integration of electronics, power components, and sensors on non-traditional flexible substrates and into three-dimensional architectures. This research supports physiological monitoring to determine soldier-unique states and will be used to optimize team or squad level performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.555"
                                            },
                                            "Text": {
                                                "val": "Designed printable sensor materials and devices that will enable new and enhanced capabilities in areas such as flexible electronic large areas sensors, tagging, tracking, and Soldier monitoring."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.136"
                                            },
                                            "Text": {
                                                "val": "Design flexible hybrid electronic systems integrating traditional silicon electronics, sensors, and power. The applications will include flexible sensing systems with components mounted on two-dimensional flexible substrates and integrated into three-dimensional structures for Soldier and small platform applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.356"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.356"
                                            },
                                            "Text": {
                                                "val": "Will design flexible hybrid electronic systems for human assessment, integrated three-dimensional support structures, and appropriate controls and sensor processing for health monitoring; and explore team or squad level resource optimization."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H94"
                    },
                    "ProjectTitle": {
                        "val": "Elec & Electronic Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.568"
                        },
                        "CurrentYear": {
                            "val": "30.212"
                        },
                        "BudgetYearOne": {
                            "val": "33.836"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.836"
                        },
                        "BudgetYearTwo": {
                            "val": "36.597"
                        },
                        "BudgetYearThree": {
                            "val": "38.218"
                        },
                        "BudgetYearFour": {
                            "val": "39.616"
                        },
                        "BudgetYearFive": {
                            "val": "41.175"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project designs and characterizes electronics, electronic components, and electronic devices for Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) applications and battlefield power and energy applications. Significant areas of component research relevant to C4ISR include: antennas, millimeter wave components and imaging, micro- and nanotechnology, eye-safe laser radar (LADAR), vision and sensor protection, infrared (IR) imaging, photonics, and prognostics and diagnostics. Areas of research relevant to power and energy include power and thermal management, micro-power generators and advanced batteries, fuel reformers, fuel cells for hybrid power sources, and photosynthetic routes to fuel and electricity. \n\nThis project supports Army science and technology efforts in the Command Control and Communications, Soldier, Ground and Air portfolios. Work in this project is fully coordinated with Program Element (PE) 0602709A (Night Vision Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603008A (Command, Control, Communications Advanced Technology), PE 0603313A (Missile and Rocket Advanced Technology) and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antennas and Millimeter Wave Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort designs, characterizes, and validates high performance antenna components and software for multifunction radar and communication systems. Research areas include scanning techniques, broadbanding, beamforming, polarization, platform integration, and affordability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.052"
                                            },
                                            "Text": {
                                                "val": "Characterized the performance of millimeter wave transceivers for covert communications and sensing applications; extended and modified microwave radar rain scattering models to frequencies above 200 GHz to support transmission of data through rain and dust; and developed and characterized conformal antennas for non-standard covert vehicle applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.490"
                                            },
                                            "Text": {
                                                "val": "Devise and characterize carbon nanotube antennas woven into the fabric of the soldier’s uniform; perform in-situ simulation of printed antenna designs and low-profile metaferrite antenna designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.657"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.657"
                                            },
                                            "Text": {
                                                "val": "Will design and develop low profile apertures which meet future low-visibility signature requirements while maintaining radio frequency (RF) performance; use advanced modeling to characterize electromagnetic performance of antennas and RF devices for Army applications; exploit the latest developments in engineered metamaterials with high permeability as the enabling technology for low-profile antennas; create antennas suitable for dismounted operations using carbon nanotube technology; develop antenna array designs using phase-change materials as the enabling technology to allow high performance beam steering; and develop specialized antenna designs for human health monitoring suitable for use by dismounted soldiers actively engaged in tactical operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Micro and Nano Devices"
                                    },
                                    "Description": {
                                        "val": "This effort designs and characterizes micro- and nano-technology components for multi-functional and integrated RF applications, micro-robotics, integrated energetics, control sensor interfaces and sensors for improved battlefield situational awareness. Work being accomplished under PE 0601102A \/ Project H47 (Applied Physics Research) complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.293"
                                            },
                                            "Text": {
                                                "val": "Developed and characterized micro-electro-mechanical systems (MEMS) technologies for enabling frequency agile RF systems, mm-scale robotic platforms, and novel MEMS and sensor fusion solutions for enabling position, navigation, and timing in global positioning system (GPS) denied environments; continued investigation of novel stacked two-dimensional (2D) electronic materials (e.g. graphene, molybdenum disulphide, boron nitride) for Army-relevant high performance electronic devices such as flexible and transparent transistors, antennas, oscillators, and amplifiers; developed nanoscale energetic materials for micro-autonomous vehicle propulsion, technology protection, and fuze initiators; optimized magnetic tunnel junction interface with magnetic permeability bits to enhance memory density and read speed; developed MEMS acoustic vector intensity probes for target localization and wind mitigation; and developed intrusion detection algorithm to enhance communication link security."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.127"
                                            },
                                            "Text": {
                                                "val": "Design and characterize MEMS components for cognitive RF systems, low power GPS, and sensor technologies for improved Position, Navigation and Timing (PNT); design and develop hardware and algorithms for distributed sensing, micro autonomous system control and chip scale integration of energetic nanoporous silicon for fuze initiation; characterize digital circuits on flexible stacked 2D electronic materials (e.g. graphene, molybdenum disulphide, boron nitride); and explore and optimize the RF performance of stacked 2D electronic materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.155"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.155"
                                            },
                                            "Text": {
                                                "val": "Will develop, integrate, and characterize RF MEMS components (e.g., filters, tunable passives and switches) for cognitive and adaptable radio and electronic warfare systems; continue development of a MEMS quad mass gyroscope with integrated active materials and sensor methods for assured PNT; design, analyze and formulate 2D material device structures for high frequency and low power analog RF and digital electronics; validate chip-scaled integration of energetic nanoporous silicon for device protection and fuze initiation; and integrate and characterize size, weight, power, and processing-constrained electronics, MEMS, and control algorithms for micro-autonomous systems, smart munitions, and soldier cognitive systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Millimeter Wave and Microwave Components and Architectures for Advanced Electronic Systems"
                                    },
                                    "Description": {
                                        "val": "This effort researches, designs, and characterizes component materials, structures, devices, and the electromagnetic issues of millimeter wave (mmw) and microwave components and active devices. The goal is to develop components that can enable advanced systems that combine multiple RF functionalities.  Additional research will focus on Mobile Ad-hoc Networks (MANETs) operating under severe energy and bandwidth constraints, which are vulnerable to enemy infiltration.  The objective is to enhance the survivability of MANETs in tactical environments by investigating advanced security suites for MANET access, authentication, and intrusion detection, as well as security and range extensions in the physical device area using advanced Medium Access Control (MAC) layer techniques."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.460"
                                            },
                                            "Text": {
                                                "val": "Developed and tested multi-function RF components capable of receiving weak signals and threat detection using a combination of advanced processing and hardware architectures; investigated novel thermal management techniques for heat removal in high power amplifiers; and developed and characterized efficient, wideband, secured communications at mmw\/terahertz frequencies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.267"
                                            },
                                            "Text": {
                                                "val": "Investigate trade space for device and circuit performance requirements for application to future radar and sensing systems; correlate trade space results with emerging needs from communication systems to enable multiple-function hardware as RF frequency-performance requirements converge."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.617"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.617"
                                            },
                                            "Text": {
                                                "val": "Will investigate non-linear and linear RF architectures for advanced sensing applications; develop thermal models for III-V semiconductor devices enabling operations at multiple millimeter-wave bands; explore tunable and adaptive RF circuit topologies to enhance performance over conventional broadband circuit designs; design, model, and characterize circuits capable of supporting multiple bands while maintaining high power-added efficiency and output linearity; fabricate device and chip-level devices to validate improved RF capability in output power, efficiency, and bandwidth; develop miniature acoustic particle velocity sensors for battlefield threat awareness; develop MEMS-scale electric- and magnetic-field sensors to attach to power-lines for reconnaissance and surveillance applications; establish techniques to quantify protocols; generate secure networking protocols for deployment on resource-constrained devices and wireless\/wired networks; and improve situational awareness through event and data reasoning via machine learning and statistical methods."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vision Protection (formerly Imaging Laser Radar (Ladar) and Vision Protection)"
                                    },
                                    "Description": {
                                        "val": "This effort develops and characterizes materials for passive protection of electro-optic (EO) vision systems from lasers."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.659"
                                            },
                                            "Text": {
                                                "val": "Research active EO shutter systems that do not need a focal plane to activate and explore their implementation in Army optical systems; explore magneto-optic materials for use in protecting IR systems; investigate ladar concepts for ultra-light or large unmanned air vehicle (UAV) navigation; study novel and advanced optical science concepts, such as computational imaging and holography for enhanced imaging and sensing applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.780"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.780"
                                            },
                                            "Text": {
                                                "val": "Will extend the potential of EO techniques for the protection of shortwave-infrared (SWIR) detector and imaging systems against laser threats; and research and improve large-area EO shutters for simplified protection of optical systems on Army platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hazardous Material Detection (formerly Photonics and Opto-Electronic devices)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and characterizes novel sensor components and architectures to enable detection of hazardous substances for enhanced Soldier situational awareness and survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.938"
                                            },
                                            "Text": {
                                                "val": "Characterized ultrafast laser spectroscopy techniques, especially multiplex Coherent Anti-Stokes Raman Scattering (CARS), to enable remote explosives detection; explored infrared photothermal technique used in conjunction with laser Doppler vibrometry for energetic-related material detection; and simulated and characterized advanced optical components in a threat detection device for active protection defeat of both kinetic energy and non-kinetic energy targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.128"
                                            },
                                            "Text": {
                                                "val": "Conduct spectral analysis investigations of candidate spectroscopic detection technologies to include femtosecond Coherent Anti-Stokes Raman Scattering and infrared photothermal spectroscopy; study functional biomaterials in austere environments including the effect of temperature and other degradation pathways; and study and model biological materials designed with specific functionality and stability for their interaction and affinity with non-biological materials such as metals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.910"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.910"
                                            },
                                            "Text": {
                                                "val": "Will develop capability to integrate biological materials into biological assays and sensor systems and evaluate performance after thermal exposure to simulated harsh unconditioned storage conditions; and extend peptide material discovery to develop bio-hybrid materials which incorporate benefits of biological and synthetic materials for advantages such as self-assembly and self-healing and environmental response materials.  Will investigate fiber-based collinear Multiplex Coherent Anti-Raman Spectroscopy (M-CARS) as a viable technique for explosives detection in liquid and solid samples; will characterize sensor components using different technical approaches, including magnetic and electromagnetic induction, to detect buried explosive devices; and investigate sensor node components that enable local data processing on the sensor node, communications between nodes in a sensor network, and distributed sensor information fusion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power and Thermal Management for Small Systems"
                                    },
                                    "Description": {
                                        "val": "This effort investigates designs and fabricates MEMS-based components to improve power generation and micro-cooling technology for both dismounted Soldier and future force applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.340"
                                            },
                                            "Text": {
                                                "val": "Investigated heat management techniques for improving engine waste heat recovery; implemented techniques for thermal interface measurements to characterize heat transfer in novel materials; investigated thermoelectric, pyroelectric, and thermophotovoltaic power generation techniques and materials for applicability in direct power generation; characterized advanced materials for improved fuel conversion efficiency and applied them toward developing improved reaction models; investigated improved techniques for wide bandgap material and device design for power supply and conversion systems; and developed improved models and measurement techniques for prediction of silicon carbide device performance and reliability for high power applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.374"
                                            },
                                            "Text": {
                                                "val": "Implement techniques for thermal interface measurements to characterize heat transfer in novel materials; develop compact 3-dimensional integration techniques for power electronic devices; investigate novel methods of improving condensation heat transfer through acoustic excitation and surface enhancement; investigate integration of phase change materials into electronic packages for temperature spike suppression; investigate improved micro-fabrication techniques for microscale power devices to be used in power supply systems; investigate wireless energy conversion techniques for powering wearable and portable devices; develop fabrication processes for stretchable, wearable, and light-weight power components; investigate thermoelectric, pyroelectric, and thermophotovoltaic power generation techniques and materials for applicability in direct power generation; and characterize advanced materials for improved fuel conversion efficiency and apply them toward developing improved reaction models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.026"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.026"
                                            },
                                            "Text": {
                                                "val": "Will use new thermal interface measurement techniques to identify interface properties for optimizing heat transfer in new materials systems; implement methods for improving condensation heat transfer using acoustic excitation and surface enhancement; optimize micro-fabrication techniques for micro-scale power devices for compact power sources and conversion; experimentally validate stretchable, wearable, light-weight power components integrated into fabric; identify optimum phase change materials for temperature spike suppression in electronic packages; implement superlattice thermoelectric materials, thin-film pyroelectrics, and multi-fuel thermophotovoltaic devices for direct power generation; and optimize reaction models and apply them towards the development of micro-combustion applications with improved fuel conversion efficiencies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Emerging Electronic Devices and Circuits"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and characterizes emerging electronics such as analog, mixed signal, and millimeter wave. Efforts entail design, fabrication, and analysis of electronic devices and integrated circuits for use in extreme environments necessary for Army applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.028"
                                            },
                                            "Text": {
                                                "val": "Matured the design of devices and integrated circuits including built-in self-test of high speed integrated circuits based upon leading-edge group IV and III-V semiconductor materials; and investigated emerging electronics and prognostics and diagnostics strategies for microgrid energy and power applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.681"
                                            },
                                            "Text": {
                                                "val": "Explore emerging materials, components, and circuits that enable low energy and power efficient RF devices; design novel integrated circuits that provide improvements in power efficiencies, linearity, and noise; and explore system\/chip constraints for ultra-linear performance to enable Soldier-level communication in contested RF environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Infrared Technology (previously titled Infrared (IR) Imaging)"
                                    },
                                    "Description": {
                                        "val": "This effort designs and characterizes materials, components, and focal plane arrays (FPAs) for the next generation of night vision systems, missile seekers, and general surveillance devices.  Technologies investigated include mercury cadmium telluride (MCT) material grown on silicon (Si) substrates, strained layer superlattices (SLS), and corrugated quantum well infrared photodetector (C-QWIP) arrays for both the mid-wave infrared (MWIR) and long-wave infrared (LWIR) spectral regions with goals to increase the operating temperature and decrease the cost of FPAs. Work accomplished under PE 0602709A\/project H95 and PE 0601120A\/project 31B complements this effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.575"
                                            },
                                            "Text": {
                                                "val": "Investigate extremely low-doped MCT IR material grown on domestically available lattice matched substrates for different spectral regions, including short wavelength IR (SWIR) and LWIR applications; study effects of thermal cycle annealing on MCT material as it pertains to dopant species and profiles; study the implementation of resonant features on MCT for higher temperature operation; and characterize and analyze R-QWIP material and devices for improved quantum efficiency and operating temperature."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.695"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.695"
                                            },
                                            "Text": {
                                                "val": "Will characterize and analyze broadband and two-color (LWIR\/LWIR and LWIR\/VLWIR) R (Resonant)-QWIP and resonant strained layer superlattice arrays for hyperspectral and other Army applications; investigate resonant MCT structures for LWIR imaging at higher operating temperatures than is currently available; expand device modeling capabilities to three dimensions to garner a better understanding of the interplay between photon absorption, charge drift and diffusion, and passivation with the choice of device architecture (mesa or planar) and material parameters; and develop a process for passivation of MCT IR arrays using cadmium telluride atomic layer deposition for maximal conformal coverage."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This research focuses on the design and characterization of chemistries, materials, and components for advanced batteries, fuel reformers, and fuel cells. Potential Army applications include hybrid power sources, smart munitions, hybrid electric vehicles, and Soldier power applications.  Additionally, investigate the applicability of photosynthesis to provide fuel and electricity for Soldier power applications, and investigate silicon carbide (SiC) power module components that could enable compact, high efficiency, high temperature, and high power density converters for motor drive and pulse power applications. The research accomplished under PE 0601104A\/Project VS2 (multi-scale modeling) complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.928"
                                            },
                                            "Text": {
                                                "val": "Transitioned thin film thermal batteries to U S. Army Armament Research, Development and Engineering Center (ARDEC) for augmented munitions power; determined transport properties of anion exchange polymers for alkaline fuel cells; investigated components for sodium ion batteries, optimized electrolyte composition for silicon anodes for lithium ion batteries, developed three dimensional (3D) strategies for photosynthetic production of hydrogen for alternative energy applications; experimentally validated models developed through the Multiscale Modeling effort for batteries and fuel cells; and investigate gallium nitride material based devices in addition to silicon carbide based Metal Oxide Semiconductor Field Effect Transistors (MOSFETs) for reliability and operability characterization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.971"
                                            },
                                            "Text": {
                                                "val": "Characterize and transition 5-volt lithium ion battery electrodes and electrolytes for development of an sample cell for laboratory testing and assessment; investigate novel battery chemistries for Soldier power; characterize new alkaline membranes for fuel cell applications; develop lower cost catalysts for alkaline fuel cells; develop regenerable sulfur sorbents for desulfurization of JP8 at temperatures of 300-400 degrees C; determine degradation mechanisms and lifetimes of sulfur-tolerant palladium alloys for hydrogen separation from JP8 reformate for use in fuel cells."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.837"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.837"
                                            },
                                            "Text": {
                                                "val": "Will characterize aqueous lithium ion surface electrode interface mechanisms to develop safe, novel, aqueous battery chemistries; fabricate bipolar membrane materials and membrane electrode assemblies for reduced size, weight and complexity of compact fuel cells; investigate effects of 3D anode\/cathode electrolyte cell structures versus conventional structures in lithium ion batteries; further improve regeneration of sulfur-sorbent materials for room temperature JP8 fuel desulfurization; and perform spectroscopic analysis of hydrogen separation in palladium alloys to establish JP8 reformate reaction mechanism."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "This research will develop technologies to specifically address laser threats at different frequencies (e.g. ultraviolet, infrared) and at a variety of pulse widths (continuous wave (CW), nanosecond, femtosecond). This research will develop technologies to protect Army radars by agile spectrum exploitation, reconfigurable high speed switching technology, and novel RF power limiters and switching devices to protect RFFEs in contested environments as well as from self-interference challenges where multiple RF systems are operating in close proximity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.978"
                                            },
                                            "Text": {
                                                "val": "Investigated non-linear electro-optical materials and devices for use in a broad range of sensors (ultraviolet, MWIR, and LWIR) against very short pulse (down to femtosecond) laser threats; investigated materials and novel devices to delay the onset of thermal destruction of optics and optical structures from high energy lasers; improved laser protection by exploring fast electro-optical (EO) shutters, using inorganic crystal-based materials, in conjunction with device tiling to provide increased protection for large aperture sensors; and investigated novel electronic materials to support fast switching devices and power dissipation techniques to protect RF front ends."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "Study new materials and devices to counter the laser threat against sensors, particularly the threat of wavelength-agile lasers as threats evolve toward directed high energy weapons and ultrafast femtosecond pulsed lasers, to include short-wavelength infrared and mid-wavelength infrared (MWIR) sensor protection; investigate new techniques for protection against CW high energy laser threats; and characterize materials as optical limiters against femtosecond pulsed laser threats across a variety of wavelengths (visible through MWIR)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Harvesting"
                                    },
                                    "Description": {
                                        "val": "This research develops technologies to substantially reduce the number of batteries required to accomplish dismounted Soldier\/Squad mission objectives, thereby significantly reducing Soldier-borne load and logistics requirements. Research will explore technologies to harvest electrical power by converting and storing energy via engineered structures and electronic bandgaps, MEMS-based micro-scale power conversion and heterogeneous 3-D assembly of MEMS with other devices to enable efficient, distributed power conversion. Research explores novel paths to local fuel and energy production, including artificial photosynthesis, to extract hydrogen and electricity directly from water and sunlight."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.551"
                                            },
                                            "Text": {
                                                "val": "Explored novel thermophotovoltaic devices to achieve high efficiency conversion considering available microcombustors and wavelength-optimized semiconductor devices; investigated plasmonic and meta-materials for enhanced surface catalysis experiments for enhanced energy harvesting from battlefield-scavenged resources; explored options for reducing parasitic losses for military thermoelectrics; and examined pyroelectric materials and models to determine suitability for energy harvesting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.340"
                                            },
                                            "Text": {
                                                "val": "Study the properties of bandgap engineered indium gallium nitride and highly mismatched alloys to develop the capability to split water to produce hydrogen to use for fuel or as intermediates for fuel; characterize thermoelectric and pyroelectric material properties for energy harvesting; investigate and characterize properties of ultra-energetic (isotopic\/isomeric) materials and matched energy conversion structures as a long endurance energy source; and refine growth parameters for novel photoelectric materials for use with non-solar applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.524"
                                            },
                                            "Text": {
                                                "val": "Will characterize electrical and optical performance of bandgap-engineered gallium nitride for water splitting for hydrogen-derived fuel intermediaries; develop improved, thin-film pyroelectric and thermal materials and packaging for high-rate thermal cycling; investigate properties of ultra-energetic (e.g., isotopic\/isomeric) materials for enhanced energy and\/or gamma release mechanisms; develop photovoltaic devices with surface nanostructures for broad-angle, anti-reflection and light-trapping capabilities to improve power generation; and investigate integration of novel, stretchable, passive electronics for Soldier energy harvesting applications and wireless energy transfer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Efficient Electronics"
                                    },
                                    "Description": {
                                        "val": "This effort addresses sustainment operations by unburdening the Soldier and reducing logistics requirements (e.g., fewer batteries) for communications, computing, and sensing.  The objective is to improve the underlying energy efficiency of supply and demand for soldier-portable and unattended sensor electronics to enable the dismounted Soldier to maintain communications, freedom of movement, and increase mission duration.  The majority of the electronics power used by the dismounted soldier and by unattended sensors is attributable to RF communications.  In addition, freedom of movement and action during sustained and high tempo operations requires seamless battery recharging.  To address these challenges, efficient electronics research includes RF circuits, devices, materials and wireless power distribution.  Energy efficiency improvements will be developed and investigated in support of four key sensor and electronic areas: RF component devices, passively powered components, low-power, long-lived sources, and wireless power transfer."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.023"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.023"
                                            },
                                            "Text": {
                                                "val": "Will measure and characterize performance of heterogeneous materials integrated into radio frequency front-end components (e.g., amplifiers, filters, and switches); design and simulate performance of realistic waveforms on ultra-low power field-programmable gate arrays (FPGA) and accelerator cores; develop an analog integrated circuit characterization capability; explore extramural prospects for low-power RF transceiver design techniques using leading node (analog) device technologies; and characterize passive voltage amplification with MEMS (Micro-Electro-Mechanical System) piezo-transformers and multi-layer copper air-core designs, efficient power management of isotopic power sources, and improved coupling in wireless transmission."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Measurement Technology for Contested Environments (Technologies for Anti Access \/ Area Denial)"
                                    },
                                    "Description": {
                                        "val": "This research focuses on technologies that will enable precise and assured position, navigation and timing in Global Positioning System (GPS)-denied environments. The first objective of this research is to improve the size, weight, power, cost and accuracy of current micro-Inertial Measurement Systems (IMS) through the design, fabrication, and testing of MEMS gyroscopes. The second objective is to develop atomic cell disciplined Opto-Electronic Oscillators (OEOs) or laser frequency combs that can be used as ultra-precision local oscillators with improved stability. The third objective is to address the ability to transmit jam-resistant precision timing signals by investigating the transmission of precision, synchronized timing signals over optical fibers and free-space using lasers. The fourth objective is to explore new RF antenna concepts to extend the reach of IMS systems through pseudolites (ground-based substitutes for GPS satellites) and Soldier-borne systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.512"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.512"
                                            },
                                            "Text": {
                                                "val": "Will design and fabricate a MEMS quad mass gyroscope (QMG) to improve MEMS gyro performance to less than 1 degree-per hour bias instability; design and fabricate a vacuum packaging solution for a MEMS QMG that will achieve an in-package pressure a million times less than atmospheric pressure; investigate and analyze OEOs and laser frequency comb architectures and the direct synchronization of an atomic cell signal to an OEO in order to create an ultra-stable local oscillator source that could increase the period of desired accuracy of military geolocation systems that require GPS synchronization from less than 1 minute to more than 1 hour; identify and develop techniques to suppress noise induced in a transmission media, such as free-space, air, or optical fiber, by transmission of frequency signals via lasers to maintain frequency stability ten times better than GPS; and explore more compact anti-jam GPS and body-worn, textile-integrated antenna designs to support future pseudolite and dismounted Soldier navigation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Tamper (AT) Technology Development"
                                    },
                                    "Description": {
                                        "val": "This effort develops tools, devices, and techniques to protect acquisition program systems and Critical Program Information (CPI) from adversarial threats. This work is executed by the Army Anti-Tamper Office located at AMRDEC at Redstone Arsenal, AL."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Will begin development of AT tools and techniques for commercial microelectronics, architecture-level AT technologies, threat-based sensors, and secure processor Intellectual Property (IP)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}