{
    "id": "cde294d110fdebb4b489c0895f3dc63c77f8c019",
    "meta": {
        "filename": "dod-2017_RDTE_2017_DLA_U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605502S"
        },
        "ProgramElementTitle": {
            "val": "Small Business Innovative Research (SBIR)"
        },
        "R1LineNumber": {
            "val": "156"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "11.805"
            },
            "PriorYear": {
                "val": "5.711"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Defense Logistics Agency’s (DLA's) ability to deliver Americans the right logistics solution in every transaction requires more than successful management of the Department's wholesale supplies and suppliers.  It requires supply chain excellence.  Our military's ability to generate and sustain combat readiness indefinitely, anywhere on the globe requires that DLA-managed materiel flow seamlessly and as needed from the nation's industrial base to where it is ultimately used.\n\nDLA's Small Business Innovative Research (SBIR) program seeks to solicit high-risk research and development proposals from the small business community.  All selections shall demonstrate and involve a high degree of technical risk with yet to be determined technical feasibility.  Phase I proposals should demonstrate the feasibility of the proposed technology and the merit of a Phase II for a prototype or at least a proof-of-concept demonstration.  Future market possibilities and demonstrated commercialization potential have a strong influence on Phase II selections."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.711"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.711"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Small Business Innovative Research (SBIR)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.805"
                        },
                        "PriorYear": {
                            "val": "5.711"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project explores innovative concepts pursuant to Public Law 106-554 (Small Business Reauthorization Act of 2000) and Public Law 107-50 (Small Business Technology Transfer Program Reauthorization Act of 2001), which mandates a two-phase competition for small businesses with innovative technologies with a defense application as well as a commercial value.  The Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) programs will develop new dual-use technologies for possible future Defense Logistics Agency (DLA) needs.  Dual-use means the technologies will be judged on their potential for future private sector investment both as a vehicle for reducing development time and cost, unit costs of new DLA technologies, and as a route to national economic growth through new commercial products.  DLA will conduct the competition as well as award and manage the contracts.\n\nThe Defense Logistics Agency`s SBIR\/STTR investments are divided into multiple Research Areas identified from within several DLA Elements:\n\nJ3 R&D\n- Advanced Battery Manufacturing (BATTNET): Manufacturing Improvements for DLA Lithium Batteries\n- Advanced Castings and Forgings (PRO-Fast):\n- Anti Counterfeiting:\n- Aircraft Alternative Braking System for Reduced Cost of Sustainment\n- Economically Recovering Rare Earth Materials\n- Advanced Technologies for Smart Connected Logistics\n\nJ6 R&D\n- TBD\n\nDMEA\n- TBD"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIR Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.711"
                                            },
                                            "Text": {
                                                "val": "DLA SBIR ($3.710M):  The DLA SBIR Program used three new topics in FY15.  Twenty-six new phase I awards were the result.  DLA selected one new Phase II award this FY.   \n\nDLA awarded a Phase II STTR to a qualifying crossover SBIR project.  Anticipate using the new DLA STTR topic supporting advanced anti-counterfeiting technologies in the DOD-wide 2015.C STTR BAA.  Upon completion, all active Phase I projects have the opportunity to compete for Phase II awards.  \n\nDMEA SBIR ($2.001M):  Designed a capability to use fiber optic cable to simultaneously distribute power (i.e., power over fiber) while providing full duplex information flow to allow miniature microwave system components to be distributed over a relatively long distance via fiber optics. Began work on a  system proof-of-concept design and prototype of an x-ray microscope system that is capable of generating x-ray images in sufficient detail to allow the identification of individual interconnects and gates within an integrated circuit (IC) using a stand-alone non-synchrotron x-ray source."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "DLA SBIR: To continue execution of all active Phase I and Phase II SBIR\/STTR Projects.  In the DOD-wide 2016.1 solicitation, DLA is using four new topics,   Anticipate the selection of one to three topics per topic.  Upon completion, all active Phase I projects have the opportunity to compete for Phase II awards.  DLA expects to award 7 new phase II awards.\n\nTo continue execution of all active Phase I and Phase II STTR Projects.  Upon completion, all active Phase I projects have the opportunity to compete for Phase II awards.  Expect to award an additional Phase II in late FY16   \n\nDMEA SBIR:  DMEA will study the feasibility of developing a tool that illuminates an electronic component with free field electromagnetic (EM) energy in the RF and microwave bands to non-destructively scan the part in both powered-on and powered-off conditions to determine authenticity. DMEA will complete the system proof-of-concept design and prototype of an x-ray microscope system that is capable of generating x-ray images in sufficient detail to allow the identification of individual interconnects and gates within an integrated circuit (IC) using a stand-alone non-synchrotron x-ray source."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "DLA SBIR: To continue execution of all active Phase I and Phase II SBIR\/STTR Projects.  In the DOD-wide 2017.1 solicitation, DLA expects three new topics,   Anticipate the selection of one to three topics per topic.  Upon completion, all active Phase I projects have the opportunity to compete for Phase II awards.  DLA expects to award 7-10 new phase II awards.\n\nTo continue execution of all active Phase I and Phase II STTR Projects.  Upon completion, all active Phase I projects have the opportunity to compete for Phase II awards \n\nDMEA SBIR:  DMEA will continue to seek innovative technical solutions to DoD microelectronics research and development needs and increase private-sector commercialization of these innovations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The SBIR acquisition process seeks to match projects with DLA’s Strategic Focus Areas.  The goal is to align SBIR\/STTR developed technology with current and future DLA requirements.  DLA solicits All new project execution work through the DoD SBIR Broad Agency Announcement (BAA).  There are three separate solicitation periods throughout each year.  (Jan-Feb, May-Jun, and Sep-Oct)"
                        },
                        "PerformanceMetrics": {
                            "val": "SBIR \/STTR programs measure performance in two separate metrics\n\n1.  Phase Progression: In terms of progression from Phase I to Phase II, to Phase III, DLA deems each successive progression success.  DLA Seeks to have a 50% progression from one Phase to the next as a minimum.\n\n2.  Commercialization:  The Congressional language defines “Commercialization,” which is clarified by the Office of Secretary of Defense Office of Small Business Programs (OSD\/OSBP) Re-Authorization Policy Directive:\n- (Investment) The process of developing products, processes, technologies, or services; and\/or \n- (Sales) The production and delivery (whether by the originating party or by others) of products, processes, technologies, or services for sale to or use by the Federal Government or commercial markets    \n\nThe Small Business Administration and OSD\/OSBP assign a Commercialization Index based on progression within the Phases and reported successes"
                        }
                    }
                }
            ]
        }
    }
}