{
    "id": "d283e32186eb58dc13565322c1d9f2159b9aa8c3",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602601F"
        },
        "ProgramElementTitle": {
            "val": "Space Technology"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "96.425"
            },
            "CurrentYear": {
                "val": "109.122"
            },
            "BudgetYearOne": {
                "val": "117.915"
            },
            "BudgetYearOneBase": {
                "val": "117.915"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "121.663"
            },
            "BudgetYearThree": {
                "val": "119.560"
            },
            "BudgetYearFour": {
                "val": "127.134"
            },
            "BudgetYearFive": {
                "val": "128.856"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element focuses on four major areas.  First, space survivability and surveillance develops technologies to understand space weather and the geophysics environment for mitigation and exploitation of these effects to Air Force systems.  Second, spacecraft payload technologies improve satellite payload operations by developing advanced component and subsystem capabilities.  Third, spacecraft protection develops technologies for protecting U.S. space assets in potential hostile settings.  The last major area, spacecraft vehicles, focuses on spacecraft platform and control technologies, and their interactions.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "98.229"
                },
                "CurrentYear": {
                    "val": "116.122"
                },
                "BudgetYearOne": {
                    "val": "108.936"
                },
                "BudgetYearOneBase": {
                    "val": "108.936"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "96.425"
                },
                "CurrentYear": {
                    "val": "109.122"
                },
                "BudgetYearOne": {
                    "val": "117.915"
                },
                "BudgetYearOneBase": {
                    "val": "117.915"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.804"
                },
                "CurrentYear": {
                    "val": "-7.000"
                },
                "BudgetYearOne": {
                    "val": "8.979"
                },
                "BudgetYearOneBase": {
                    "val": "8.979"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-7.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.304"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.500"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.979"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.979"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2016 due to Congressional Directed Reduction for excess to need.\nIncrease in FY 2017 is due to increased emphasis by DoD in space environment research and advanced navigation technology development."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621010"
                    },
                    "ProjectTitle": {
                        "val": "Space Survivability & Surveillance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.637"
                        },
                        "CurrentYear": {
                            "val": "42.970"
                        },
                        "BudgetYearOne": {
                            "val": "39.163"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.163"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "40.361"
                        },
                        "BudgetYearThree": {
                            "val": "28.878"
                        },
                        "BudgetYearFour": {
                            "val": "33.706"
                        },
                        "BudgetYearFive": {
                            "val": "34.408"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technologies to understand and control the space environment for warfighter's future capabilities.  The focus is on characterizing and forecasting the battlespace environment for more realistic space system design, modeling, and simulation, as well as the battlespace environment's effect on space systems' performance.  This includes technologies to specify and forecast the space environment for planning operations, ensure uninterrupted system performance, optimize space-based surveillance operations, and provide capability to mitigate or exploit the space environment for both offensive and defensive operations.  Finally, this project includes the seismic research program that supports national requirements for monitoring nuclear explosions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Environment Research"
                                    },
                                    "Description": {
                                        "val": "Develop techniques, forecasting tools, sensors, and technologies for specifying, monitoring, predicting, and controlling space environmental conditions hazardous to DoD operational space and radar systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.231"
                                            },
                                            "Text": {
                                                "val": "Took delivery of unique pulsed electroacoustic sensor to measure charging inside materials and began testing capability to research material susceptibility to internal charging while exploiting continued material aging research.  Exploited new on-orbit data sources to enhance energetic space environment models.  Initiated research on methods for remote measurement of spacecraft material properties.  Began researching novel techniques for solar energetic particle forecast."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.795"
                                            },
                                            "Text": {
                                                "val": "Initiate research program to quantify\/predict internal charging for new and aged materials.  Continue developing models to predict the generation and transport of solar energetic particles.  Begin developing predictive model for observable and dielectric spacecraft material property changes.  Continue exploitation of new on-orbit data sources to enhance energetic space environment models supporting spacecraft design and mission planning.  Develop global magnetic field models of the Sun, allowing determination of solar wind conditions used for forecasting solar radiation conditions at Earth.  Prior work on solar energetic particles will be assessed for incorporation into predictive space environment model that forecast effects of particle radiation environment on satellites. Techniques for improving the predictions of the timing\/magnitude of geomagnetic storms driven by solar eruptions will be investigated.  Develop a suite of codes that will be used for attribution of satellite communication interference.  Deliver block upgrades to address future needs of the DoD satellite communication user community.  Develop models for error corrections caused by ionospheric disturbances to Over the Horizon Radar (OTHR).  Provide upgrades to the state of the art model currently used for those corrections, focusing on a newly discovered phenomena called traveling ionospheric disturbances, which causes objects located by OTHR to apparently shift in location.  Assess future signature packages that should be added to the hypersonics flow solver.  Continue the assessment of new geometry and material impacts on mission success for strategic systems.  In FY2016 and beyond, Ionospheric Research effort has been combined with this effort to better align technical efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.606"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.606"
                                            },
                                            "Text": {
                                                "val": "Continue developing predictive model for observable and dielectric spacecraft material property changes.  Begin utilizing property change results in development of new design standards.  Continue exploitation of on-orbit data sources to validate energetic space environment models supporting spacecraft design and mission planning.  Select improved solar magnetic field and energetic particle models for further development as transition candidates for incorporation into future spirals of anomaly attribution tools.  Begin analyzing and exploiting data from the on-orbit radiation remediation proof-of-concept experiment, as well as existing on-orbit spacecraft.  Pursue ionosonde auto scaling technologies, as well as real-time characterization of OTHR performance.  Assess impacts of the artic ionosphere on OTHR availability.  Create integrated version of space environment impact on space-ground radio frequency links attribution tool meeting space operations requirements for scintillation and solar impacts on satellite communications, command, and control systems.  Using data from a new weather satellite constellation, evaluate and refine Global Positioning System (GPS) radio frequency exploitation algorithms for global scintillation specification.  Integrate new data into existing baseline model based on ground-based measurements.  Improve state-of-the-art solar magnetic flux transport model for more reliable forecast of solar radio and extreme ultraviolet flux levels, key parameters for Air Force space weather models and forecasts.  Derive an advanced ionosphere-thermosphere model using these parameters and evaluate the performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Surveillance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced target detection techniques, spectral signature libraries, and decision aids for space-based sensors and surveillance systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.392"
                                            },
                                            "Text": {
                                                "val": "Evaluated hyper temporal imaging (HTI) data processing methods and target detection algorithms for space-based, early missile warning.  Delivered space-based HTI sensor performance trade studies for optimal early missile detection.  Explored and evaluated new innovative HTI detection methods for concealed activity monitoring."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.358"
                                            },
                                            "Text": {
                                                "val": "Expand evaluation of HTI data processing methods and target detection algorithms to wider range of real-world and simulated target-background scenes of missile warning scenarios as well as to space-based imagery data that is compressed to reduce satellite downlink problems.  Deliver detailed technical evaluation of potential HTI detection methods for concealed activity, including identification of technology gaps needing additional investigation for use in monitoring difficult threats.  Initiate development of HTI space-based data collection events and ground truth field campaigns for new HTI flight experiment investigating advanced concept for early missile warning and dim target detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.990"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.990"
                                            },
                                            "Text": {
                                                "val": "Deliver algorithm testbed trade studies and benchmarked HTI target detection algorithms for improved detection of increasingly dim infrared target signatures commensurate with new and emerging space-based sensors having higher sensitivity for missile warning and battlespace awareness.  Conduct trade studies of computational methods for compressing large amounts of data from missile warning satellites while maximizing target detection probabilities, minimizing false alarms, and mitigating satellite downlink issues.  Provide final recommendations and complete study of the potential detection of concealed activity from space-based systems.  Continue development of HTI space-based data collection events and ground truth field campaigns for new HTI flight experiment. Initiate modeling and laboratory studies to establish performance baseline for HTI-dedicated space experiment for testing new capability option for early missile warning.  Develop and implement methods for processing and exploiting HTI data for dim target detection in complex environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ionospheric Research"
                                    },
                                    "Description": {
                                        "val": "Develop techniques, forecasting tools, and sensors for ionospheric specification and forecasting, space-based geolocation demonstrations, and determination of potential radar degradation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.590"
                                            },
                                            "Text": {
                                                "val": "Continued investigations for physics-based space weather specification and forecast models related to impacts on DoD systems.  Validated improved modeling capabilities for scintillation impacts on communications, GPS and remote sensing, and for environmentally-induced satellite anomalies.  Began development of next model increments.  Integrated and quantitatively assessed environmental models and system impact data across the solar, magnetosphere, and ionosphere domains to expand capabilities for actionable attribution and forecast of environmentally-caused anomalies on DoD satellites and environmental interference with electromagnetic wave propagation.  Incorporated advanced ionospheric sounding techniques and traveling ionospheric disturbance effects into simulation model for next generation radar systems.  Conducted application-specific trade studies for model components and data types.  Demonstrated high frequency radio geolocation coordinate registration capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016 and beyond, this effort is combined with the Space Environment Research effort in the same project to better align technical efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radiation Remediation Research"
                                    },
                                    "Description": {
                                        "val": "Conduct Radiation Belt Remediation (RBR) research through developing and validating analytical performance models for remediation of Earth radiation belts following high altitude nuclear detonation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.476"
                                            },
                                            "Text": {
                                                "val": "Validated RBR end-to-end model version 2.0 using ground and space-based measurements with the very low frequency particle mapper and satellite experiments.  Conducted fielded RBR capability assessments to determine rough order fielded system requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.756"
                                            },
                                            "Text": {
                                                "val": "Validate RBR end-to-end model version 3.0 using ground and space-based measurements with satellite and terrestrial experiments.  Conduct fielded RBR capability assessments to determine rough order fielded system requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.946"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.946"
                                            },
                                            "Text": {
                                                "val": "Complete fielded RBR capability assessments of ground and space based systems to determine rough order fielded system requirements.  Perform reduction and exploitation of science data from the on-orbit radiation remediation proof-of-concept experiment in support of validation of the final spiral of the RBR end-to-end model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seismic Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop seismic technologies to support national requirements for monitoring nuclear explosions with special focus on regional distances less than 2,000 kilometers from the sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.213"
                                            },
                                            "Text": {
                                                "val": "Assessed relative utility of different scientific and computational advances for improving the accuracy of three-dimensional seismic wave propagation models.  Explored use of details of seismic signals in three-dimensional models for discrimination of explosions from earthquakes.  Extended coverage and increased resolution of unified model."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.532"
                                            },
                                            "Text": {
                                                "val": "Deliver discrimination capabilities using full seismic waveforms based on three-dimensional models to fill critical capability gaps.  Use three-dimensional attenuation models to improve signal loss prediction for seismic signals used in discrimination.  Investigate the use of modern high speed computing capabilities and massive data archives to automate the detection, location, and discrimination of seismic events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.565"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.565"
                                            },
                                            "Text": {
                                                "val": "Advance signal and array processing methods to dramatically improve detection at target sites and increase automation of detection, location, and discrimination of other seismic events from nuclear explosions.  Improve mission-critical discrimination accuracy using source characterizations based on full seismic waveforms.  Develop, test, and apply methods to use surface wave travel times and amplitudes for greater location and discrimination accuracy.  Improve the resolution and accuracy of three-dimensional attenuation models to improve signal loss prediction for seismic signals used in discrimination."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Navigation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies based on cold atom physics that provide autonomous jam-proof precision inertial navigation to augment GPS in case of GPS-denial. Develop atomic clocks based on new technologies to replace legacy GPS atomic clocks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.735"
                                            },
                                            "Text": {
                                                "val": "Continued to advance the development of compact atomic clocks with improved accuracy and stability to replace legacy atomic clocks.  Testing commenced on National Institute of Standards and Technology atomic clock.  Continued construction of a free space, cold atom 3-axis gyroscope\/accelerometer that would enable GPS-free precision navigation.  Tested a completed free space, cold atom single-axis gyroscope\/accelerometer to learn about its strengths and limitations.  Continued development of a confined cold atom gyroscope with reduced size and weight over free space cold atom gyroscopes to expand GPS-free navigation to a larger number of Air Force platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.529"
                                            },
                                            "Text": {
                                                "val": "Continue to advance the development of compact atomic clocks with improved accuracy and stability to replace legacy atomic clocks. Continue construction of a free space, cold atom 3-axis gyroscope\/accelerometer that would enable GPS-free precision navigation. Complete further tests of free space, cold atom single-axis gyroscope\/accelerometer to learn about its strengths and limitations. Develop a confined cold atom gyroscope with reduced size and weight over free space cold atom gyroscopes to provide a GPS-free navigation system for DoD platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.056"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.056"
                                            },
                                            "Text": {
                                                "val": "Continue to advance the development of compact atomic clocks with improved accuracy and stability to replace legacy atomic clocks.  Begin testing of advanced clock from National Institute of Standards and Technology.  Complete development of free space, cold atom 3-axis gyroscope\/accelerometer that will enable GPS-free precision navigation.  Develop test plans for cold atom 3-axis gyroscope\/accelerometer."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624846"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Payload Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.905"
                        },
                        "CurrentYear": {
                            "val": "12.478"
                        },
                        "BudgetYearOne": {
                            "val": "15.732"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.732"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "16.034"
                        },
                        "BudgetYearThree": {
                            "val": "16.530"
                        },
                        "BudgetYearFour": {
                            "val": "16.634"
                        },
                        "BudgetYearFive": {
                            "val": "16.543"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops advanced technologies that enhance spacecraft payload operations by improving component and subsystem capabilities. The project focuses  on development of advanced, space-qualified, survivable electronics, and electronics packaging technologies; development of advanced space data generation and exploitation technologies, including infrared sensors; and development of high-fidelity space simulation models that support space-based surveillance and space asset protection research and development for the warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space-Based Detector Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced infrared device technologies that enable hardened space detector arrays with improved detection to perform acquisition, tracking, and discrimination of space objects and missile warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.963"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and mature an alternative sensor material system to include: increased operating temperature, reduced non-uniformity, and reduced cost.  Explored novel detector enhancement methodologies (radiation hardening techniques, detector architectures, etc.) to mainstream visible-long wavelength infrared focal plane array developments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.289"
                                            },
                                            "Text": {
                                                "val": "Continue alternative sensor material architecture development, focused on minimizing yield limitations and producing a lower cost detector that can perform the mission at more cost-effective operating temperatures.  Complete laboratory demonstration of tunable detector technology and validate basic functionality over a militarily significant range of wavelengths.  Initiate development of radiation tolerant detectors to achieve dim object tracking for next-generation space situational awareness systems.  Complete support for novel cloud-penetrating missile warning experiment.  Continue development of foundational sensor modeling and novel detector enhancement methodologies to leverage tactical infrared detector developments for use in space systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.379"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.379"
                                            },
                                            "Text": {
                                                "val": "Maintain alternative sensor material-based detector development for lowering noise and raising detector efficiency.  Characterize detector performance in both gamma and proton environments to develop full understanding of degradation mechanisms present. Iterate design, growth, and characterization as needed to achieve desired performance in space-radiation environment.  Continue development and verification of first-principle-based model to predict detector degradation in a natural space environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Situational Awareness Sensing (SSA) Research"
                                    },
                                    "Description": {
                                        "val": "Develop innovative means for measuring, modeling, and predicting phenomena for SSA and protection applications. Develop new methods to evaluate how well specific data contributes to identifying particular physical and functional information about a space-based object, and ultimately enable decision-makers to pursue courses of action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.041"
                                            },
                                            "Text": {
                                                "val": "Began execution of experiment campaign to measure satellite components to verify and validate predictive modeling capabilities against laboratory and field measurements.  Began systems analysis to establish performance requirements under validated threat scenarios.  Initiated next-generation analysis of sensing methods and phenomena to exploit for space protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016, this effort will be combined with the Threat Warning Research effort in Project 625018, Spacecraft Protection Technology, to better align technical efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Electronics Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for space-based payload components such as radiation-hardened electronic devices, micro- electro-mechanical system devices, and advanced electronics packaging."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.612"
                                            },
                                            "Text": {
                                                "val": "Completed development of integrated modules using three-dimensional techniques to increase throughput while reducing size, weight, and, especially, power.  Explored new transistor designs that are compatible with current manufacturing techniques but more efficient and radiation tolerant at ultra-small feature sizes (e.g., 7 nanometers).  Expanded on-going electronic device reliability research into other failure modes (e.g., hot carrier injection) to understand defects responsible for reduced lifetimes in small feature-size electronic devices.  Continued exploration of successful integration techniques for system-on-chip integrated circuits."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.224"
                                            },
                                            "Text": {
                                                "val": "Continue research into advanced transistor types for use at ultra-submicron technology nodes.  Document initial small-feature-size reliability findings and transition results to device development community to improve spacecraft electronic lifetime predictions.  Complete investigation of advanced electronic circuit technology and begin transition, if applicable, to development phase.  Initiate development of low-order benchmarking tools for quantifying and assessing the impact that emerging satellite electronics technologies have on component and system-level metrics, such as size, weight, power and cost.  Initiate development of path for trusted electronics as it applies to space electronics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.659"
                                            },
                                            "Text": {
                                                "val": "Continue advanced transistor efforts transitioning from single transistors into circuits on targeted fabrication nodes for digital applications and provide Gallium Nitride transistor radiation results to electronics manufacturing community.  Continue development of benchmarking tool suite, demonstrating capability across multiple user systems and applications.  Transition results to user for selection of technology path.  Continue development of trusted electronics path as it applies to space technology tools and fabrication.  Continue radiation effects research on advanced technologies for space application.  Initiate development of three-dimensional electronics to extend technology node density."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation Tools for Space Applications"
                                    },
                                    "Description": {
                                        "val": "Develop modeling and simulation tools for space-based ground surveillance systems, rendezvous and proximity operations, imaging of space systems, disaggregated satellite architecture, and space control payloads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.364"
                                            },
                                            "Text": {
                                                "val": "Continued to develop spacecraft and mission simulations in close conjunction with customers across the DoD.  Continued to integrate state-of-the-art system performance and mission planning algorithms into modeling and simulation software tools.  Revised flight tools based on recent flight program experience.  Supported technology development and maturation through capability and mission utility studies and size, weight, and power-cost trade studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.129"
                                            },
                                            "Text": {
                                                "val": "Continue to develop spacecraft and mission simulations in close conjunction with customers across the DoD and other government agencies.  Continue to integrate state-of-the-art system performance and mission planning algorithms into modeling and simulation tools.  Revise flight tools based on recent flight program experience.  Support technology maturation through capability and mission utility studies, size, weight, and power-cost trade studies, and wargaming activities.  Provide utility analysis to future flight experiments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.054"
                                            },
                                            "Text": {
                                                "val": "Support technology maturation through capability assessment and mission utility studies; size, weight, and power-cost trade studies; and wargaming activities.  Provide utility analysis to future flight experiments and support refinement of mission parameters.  Develop spacecraft and mission simulations in close conjunction with customers across the DoD and other government agencies, as necessary.  Integrate state-of-the-art system performance and mission planning algorithms into modeling and simulation tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Positioning, Navigation, and Timing Technology"
                                    },
                                    "Description": {
                                        "val": "Identify and develop technologies that enable new, or enhance existing, U.S. positioning, navigation, and timing (PNT) satellite capabilities by increasing resiliency and availability of accuracy, and\/or increasing the affordability of providing current capabilities. Develop technologies to meet identified Air Force Space Command\/Space and Missile Systems Center PNT space payload technology needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.925"
                                            },
                                            "Text": {
                                                "val": "Conducted experiments to establish the sensitivity of PNT payload units\/sub-units to off-nominal operating conditions and to establish laboratory readiness for incorporation of experimental hardware from other, on-going PNT technology developments.  Conducted studies to identify alternative and innovative technology options for PNT payloads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.836"
                                            },
                                            "Text": {
                                                "val": "Continue experiments establishing the sensitivity of various PNT payload units\/sub-units to off-nominal operating conditions and establish laboratory readiness for incorporation of experimental hardware from other, on-going PNT technology developments.  Continue studies to identify alternative and innovative technologies that are viable for PNT payloads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.640"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.640"
                                            },
                                            "Text": {
                                                "val": "Incorporate advanced amplifiers into in-house PNT payload laboratory testbed.  Continue experiments establishing the sensitivity of various PNT payload units\/sub-units to off-nominal operating conditions and establish laboratory readiness for incorporation of experimental hardware from other, on-going PNT technology developments.  Continue studies to identify alternative and innovative technologies that are viable for PNT payloads."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625018"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Protection Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.143"
                        },
                        "CurrentYear": {
                            "val": "15.049"
                        },
                        "BudgetYearOne": {
                            "val": "19.411"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.411"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "21.971"
                        },
                        "BudgetYearThree": {
                            "val": "26.355"
                        },
                        "BudgetYearFour": {
                            "val": "27.768"
                        },
                        "BudgetYearFive": {
                            "val": "28.216"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the technologies for protecting U.S. space assets in potentially hostile environments to assure continued space system operation without performance loss in support of warfighter requirements.  The project focuses on identifying and assessing spacecraft system vulnerabilities, developing threat warning technologies, and developing technologies to mitigate the effects of both intentional and unintentional threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Threat Warning Research"
                                    },
                                    "Description": {
                                        "val": "Develop satellite threat warning technologies and tools for space defense. Exploit on-board inherent satellite resources, satellite-as-a-sensor, and self-aware satellite technologies.  Develop technologies to detect, assess, and respond to threats and anomalies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.143"
                                            },
                                            "Text": {
                                                "val": "Down selected and matured next generation proximity detection sensor technologies and sensor suite integration.  Provided technology support for the next Joint Space Operations Center (JSpOC) Mission Systems upgrade.  Completed instantiation of JSpOC Mission Systems (JMS) space situational awareness testbed.  Developed SSA closed loop simulation showing automated threat detection and response actions.  Evaluated technologies to enable better monitoring of space objects in geosynchronous orbit."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.049"
                                            },
                                            "Text": {
                                                "val": "Complete experimental measurements of satellite components to verify and validate predictive modeling capabilities.  Continue analysis of next-generation sensing methods and phenomena to exploit for space protection.  Complete assessments of proximity sensor options and transition findings, as appropriate, to satellite system developers.  Begin new SSA-focused data analysis methods including physics-based sensor model development for use in data filtering; advanced filtering techniques accommodating nonlinear dynamics and non-normal random variable distributions; and data-driven methods applicable where physical models are highly uncertain or altogether unknown.  Initiate development of advanced algorithms for satellite threat detection and response for both ground-based and space-based implementations.  Continue development of capabilities to increase satellite autonomy and perform closed loop demonstration showing threat detection and responsive courses of action."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.411"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.411"
                                            },
                                            "Text": {
                                                "val": "Continue development of advanced algorithms for sensor data fusion and satellite threat detections, assessment and response.  Begin integrating results of advanced algorithm development with satellite autonomous operation demonstrating improved threat detection and response capabilities.  Continue SSA-focused data analysis methods including physics-based sensor model development for use in data filtering.  Continue advancing filtering techniques accommodating nonlinear dynamics and non-normal random variable distributions.  Complete data driven methods applicable where physical models are highly uncertain or altogether unknown.  Initiate analysis of new electro-optical and radio frequency sensor concepts for space object identification and characterization.  Continue development of closed loop sensor tasking prototype for space surveillance combining commercial and government sensor assets.  Complete demonstration of end-to-end threat detection, assessment, and course of action response system implemented within space operations environment.  Evaluate potential ability of commercial remote sensing data and information to fill gaps in coverage for monitoring and tracking ground and space objects.  Investigate potential sensor tasking, data management, and dissemination architectures for utilization of commercial global geospatial-referenced information for finding and maintaining custody of mobile ground targets.  Investigate potential engagements with commercial space data providers for testing new enabling technologies on commercial satellites."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "628809"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Vehicle Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "38.740"
                        },
                        "CurrentYear": {
                            "val": "38.625"
                        },
                        "BudgetYearOne": {
                            "val": "43.609"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.609"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "43.297"
                        },
                        "BudgetYearThree": {
                            "val": "47.797"
                        },
                        "BudgetYearFour": {
                            "val": "49.026"
                        },
                        "BudgetYearFive": {
                            "val": "49.689"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project focuses on spacecraft platforms (e.g., structures, power, and thermal management); satellite control (e.g., signal processing and control); and space experiments of maturing technologies for space qualification."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Power\/Thermal Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for advanced space platform subsystems such as cryocoolers, compact, high efficiency solar power cells and arrays, and innovative power generation concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.419"
                                            },
                                            "Text": {
                                                "val": "Continued to examine new solid state, zero vibration cryocooler methods.  Performed studies on how new solid state technologies may be integrated directly to a focal plane array to show representative thermal loading.  Continued development of greater than 40% efficient solar cell approaches.  Investigated advanced photon management approaches.  Continued optimizing flexible solar array for mass and volume efficiency."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.496"
                                            },
                                            "Text": {
                                                "val": "Complete solid state refrigeration research and document low-temperature semiconductor materials findings.  Focus development of greater than 40% efficient solar cells by demonstrating increased photocurrent using nano-enhanced cells. Continue to investigate advanced photon management approaches to increase efficiency and radiation hardness.  Complete Flex-Array initial development for 60 kW\/m3 power density performance.  Initiate follow-on development for achieving 70-80 kW\/m3 array performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.933"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.933"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation of nano-enhanced solar cell approaches.  Evaluate alternative cell and array approaches for greater than 40% solar cell efficiency.  Continue investigation of approaches, such as advanced photon management, to increase end-of-life array performance.  Continue development of advanced array technologies to meet 70-80 kW\/m3 array performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Structures and Controls Research"
                                    },
                                    "Description": {
                                        "val": "Develop revolutionary and enabling technologies, including lighter weight, lower cost, high performance structures for space platforms; guidance, navigation, and controls hardware and software for next generation of space superiority systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.758"
                                            },
                                            "Text": {
                                                "val": "Improved and refined collaborative autonomous spacecraft guidance, navigation, and control efforts supporting distributed spacecraft missions.  Continued efforts to integrate guidance, navigation, and control methods with advanced spacecraft autonomy decision architectures.  Integrated multi-spacecraft and autonomous spacecraft efforts to establish multiple autonomous spacecraft technology capability.  Developed improved constitutive models for composite materials.  Continued research to improve the fabrication and manufacture of precision and high tolerance composite structures.  Performed research in thermal management technologies for heat dissipation of high power and high energy density electronics.  Delivered and transitioned analytic and numerical tools and demonstrate multi-physics optimization of satellite structures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.886"
                                            },
                                            "Text": {
                                                "val": "Continue advanced guidance and navigation algorithms integration into advanced autonomous spacecraft software.  Continue collaborative autonomous multi-spacecraft algorithms in laboratory and high-fidelity simulations\/breadboards including embedded processor implementations.  Begin reactive maneuver strategies for spacecraft resiliency in laboratory simulation.  Develop alternative GPS technologies for contested environments.  Transition methods to improve the fabrication and manufacture of precision and high tolerance composite structures to spacecraft prime contractors.  Initiate development of technologies to increase the resiliency and affordability of spacecraft structures through the development and test of new, actively-controlled thermal technologies.  Continue core research in thermal technologies that increase high-power heat dissipation for high-energy density electronics and radio-frequency components currently slated for Air Force communications and GPS spacecraft.  Explore new meta-material technologies to improve the electromagnetic interaction characteristics of Air Force spacecraft structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.911"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.911"
                                            },
                                            "Text": {
                                                "val": "Complete advanced guidance and navigation algorithms integration into advanced autonomous spacecraft software.  Continue collaborative autonomous multi-spacecraft control algorithms in laboratory and high-fidelity simulations\/breadboards including embedded processor implementations.  Continue reactive maneuver strategies for spacecraft resiliency in laboratory simulation.  Initiate research in verification and validation techniques for autonomous spacecraft flight software.  Begin development of technologies to increase protection for U.S. on-orbit assets through high-strain composites, actively-controlled thermal technologies, and local area sensing.  Complete and transition thermal technologies that enable high-energy density electronics and radio-frequency components currently slated for Air Force communications and GPS spacecraft.  Continue developing meta-material concepts and energy responsive technologies to improve the electromagnetic interaction characteristics of spacecraft structures.  Initiate advanced spacecraft production and assembly technologies to increase system performance and affordability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Experiments"
                                    },
                                    "Description": {
                                        "val": "Develop flight experiments to improve the capabilities of existing operational space systems and to enable new transformational space capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.612"
                                            },
                                            "Text": {
                                                "val": "Continued pre-launch preparations of the on-orbit radiation remediation proof-of-concept experiment.  Completed science payload designs and long lead procurement for maneuverable geosynchronous space vehicle experiment.  Verified system design for science data collections.  Verified payload subsystem hardware and software after component\/subsystem delivery.  Prepared for component\/subsystem tests, completed experiment planning for maneuverable geosynchronous experimental platform design payload configurations, and began to prepare for final spacecraft integration and test.  Completed very low frequency particle mapper space vehicle assembly integration and test."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.208"
                                            },
                                            "Text": {
                                                "val": "Complete final integration, testing, and launch vehicle integration of satellite experiment to investigate remediation techniques for \nenhanced space radiation.  Train the operations team and conduct mission rehearsals.  Launch experimental satellite and conduct on-orbit checkout and one year experimental operations.  Complete development and continue testing and verification of a fourth generation geosynchronous orbit (GEO) based missile warning payload to demonstrate hyper temporal imaging (HTI) capabilities to detect missile launches under sun-lit clouds, potentially enabling all weather early missile detection.  Complete testing and verification of an integrated, on-board sensing, assessment, and autonomy technology demonstration payload at GEO, demonstrating GEO asset resiliency to a specific set of on-orbit events enabling system mission assurance in a degraded space environment.  Assess technology readiness and risks for a space based integrated demonstration of an advanced GPS payload for contested environments.  Develop mission science objectives and on orbit data collection\/analysis requirements to support an integrated experiment in the FY2021-2023 timeframe."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.423"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.423"
                                            },
                                            "Text": {
                                                "val": "Complete on-orbit early checkout for radiation remediation proof-of-concept experiment and complete one year of experimental activities.  Continue satellite experimental operations to investigate remediation techniques for enhanced space radiation.  Initiate on-orbit testing and verification of a fourth generation geosynchronous orbit (GEO) based missile warning payload to demonstrate hyper temporal imaging (HTI) capabilities to detect missile launches under sun-lit clouds, potentially enabling all weather early missile detection.  Complete on-orbit testing and verification of an integrated, on-board sensing, assessment, and autonomy technology demonstration payload at GEO, demonstrating GEO asset resiliency to a specific set of on-orbit events enabling system mission assurance in a degraded space environment.  Develop and initiate test planning for next-generation small satellite space experiment.  Develop on orbit experiment plan and refine mission objectives\/data requirements for space based integrated demonstration of an advanced GPS payload for contested environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Communication Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for next-generation space communications terminals and equipment and methods\/techniques to enable future space system operational command and control concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.951"
                                            },
                                            "Text": {
                                                "val": "Continued applied research and development efforts (modeling, simulation, and laboratory testing) to reduce component technical risks and to meet technology needs.  Specifically, worked to develop a propagation flight experiment to characterize the W and V frequency bands for future military satellite communications.  Began evaluation of optical communication links with small spacecraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.035"
                                            },
                                            "Text": {
                                                "val": "Complete design phase of W and V frequency band flight experiment.  Establish Continental U.S. ground station receiver network and verify connectivity.  Initiate development of science and experiment plans. Continue development of models, simulations, and laboratory testing to support the flight experiment.  Continue investigations of optical communications options."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.342"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.342"
                                            },
                                            "Text": {
                                                "val": "Complete experimental payload build and ground receiver installation and testing for the W and V frequency band flight experiment.  Complete breadboard testing of prototype modem concepts to support W and V frequency band terminals.  Perform fabrication and testing of a multi-beam reflector antenna to support W and V frequency band satellite terminals.  Initiate development of a laboratory testbed for a smart-radio network concept for satellite communication to mitigate impacts from spectrum congestion and interference."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}