{
    "id": "d58601c81bbd89949cc11b4844f18c17e0494c52",
    "meta": {
        "filename": "dod-2017_RDTE_2017_CBDP_U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (RDT&E MGT SUPPORT)"
        },
        "R1LineNumber": {
            "val": "149"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "104.597"
            },
            "CurrentYear": {
                "val": "102.238"
            },
            "BudgetYearOne": {
                "val": "85.754"
            },
            "BudgetYearOneBase": {
                "val": "85.754"
            },
            "BudgetYearTwo": {
                "val": "117.960"
            },
            "BudgetYearThree": {
                "val": "115.422"
            },
            "BudgetYearFour": {
                "val": "111.106"
            },
            "BudgetYearFive": {
                "val": "113.063"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Budget Activity includes research, development, testing and evaluation management support for the Department of Defense (DoD) Chemical and Biological Defense Program (CBDP).\n\nProgram Element 0605384BP supports Joint Doctrine and Training (Project DT6), sustains the technical test capability at West Desert Test Center (WDTC) (Project DW6); sustains the core Department of Defense (DoD) Science and Technology (S&T) laboratory infrastructure (Project LS6), provides for program management and financial management support (Project MS6), and supports the Joint Concept Development and Experimentation (JCDE) program (Project O49).  \n\nThe Joint Training and Doctrine Support (DT6) project supports the development of Joint Doctrine and Tactics, Techniques, and Procedures (TTPs) for developing CB defense systems.  This project also supports CB modeling and simulation to support the Warfighter.\n\nThe Major Range and Test Facility Base (MRTFB) is a set of test installations, facilities, and ranges which are regarded as \"national assets\".  These assets are sized, operated, and maintained primarily for DoD test and evaluation missions.  However, the MRTFB facilities and ranges are also available to commercial and other users on a reimbursable basis.  WDTC is designated as the primary element of the MRTFB to primarily conduct CB Defense test and evaluation.  The DW6 Project provides operating support to WDTC to ensure that DoD test customers are only charged direct costs of testing and that overhead expenses are centrally funded.  It finances the required institutional test operating costs.  Institutional test operating costs include institutional civilian and contractor labor; repair and maintenance of test instrumentation, equipment, and facilities; and replacement of test equipment.\n\nThe Laboratory Support (LS6) project includes laboratory infrastructure to maintain and enhance DoD infrastructure capabilities to counter an expanding threat space, exploit advances in technology; and develop and transition CB defense equipment and countermeasures to the Warfighter.\n\nThe management support (MS6) project, provides management support for the DoD CBDP to allow program overview and integration of overall medical and non-medical programs by the Assistant Secretary of Defense for Nuclear, Chemical, and Biological Defense Programs (ASD(NCB)), through the Deputy Assistant Secretary of Defense for Chemical Biological Defense Programs (DATSD(CBD)); funds management by the Defense Threat Reduction Agency (DTRA); Development, coordination, and approval of joint CBRND requirements, management of multi-service and joint CBRND doctrine, tactics, techniques and procedures; training, leader development, education, exercises, and development of the CBDP Program Objective Memorandum (POM) by the Joint Requirements Office; Joint RDA planning, input to the Annual Report to Congress and Program Objective Memorandum (POM) development by the Program Analysis and Integration Office (PAIO); review of Joint plans and the consolidated CB Defense POM Strategy by Army in its Executive Agent role.  \n\nThe management support project also includes the Test and Evaluation (T&E) Executive mission to establish test infrastructure investment strategy and adequate testing for Developmental Testing (DT) and Operational Testing (OT) of Department of Defense (DoD) Chemical Biological Defense (CBD) systems and components throughout the systems' acquisition life cycle, as required in the RDA Plan under the Joint Test Infrastructure Working Group (JTIWG) program.  The JTIWG program includes T&E Early Involvement, test threat planning, Fielded Equipment Assessments, T&E studies, and T&E Standards planning and development to support testing the CBD systems for all services to include radiological, nuclear, medical T&E efforts.  \n\nThe Joint Concept Development and Experimentation (O49) project supports the planning, conduct, evaluation, and reporting on Joint tests (for other than developmental hardware) and accomplishment of operational research assessments in support of requirements received from the Services and the Combatant Commanders for already fielded equipment and systems.\n\nThis Budget Activity also provides for Program Element 0605502BP, which supports the Small Business Innovative Research (SBIR) program.  The overall objective of the CBD SBIR program is to improve the transition or transfer of innovative CBD technologies between DoD components and the private sector for mutual benefit.  The CBD program includes those technology efforts that maximize a strong defensive posture in a CB environment using passive and active means as deterrents.  These technologies include CB detection; information assessment (identification, modeling, and intelligence); contamination avoidance; and protection of both individual soldiers and equipment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "105.927"
                },
                "CurrentYear": {
                    "val": "102.264"
                },
                "BudgetYearOne": {
                    "val": "108.292"
                },
                "BudgetYearOneBase": {
                    "val": "108.292"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "104.597"
                },
                "CurrentYear": {
                    "val": "102.238"
                },
                "BudgetYearOne": {
                    "val": "85.754"
                },
                "BudgetYearOneBase": {
                    "val": "85.754"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.330"
                },
                "CurrentYear": {
                    "val": "-0.026"
                },
                "BudgetYearOne": {
                    "val": "-22.538"
                },
                "BudgetYearOneBase": {
                    "val": "-22.538"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.026"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.225"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.465"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.360"
                                },
                                "BudgetYearOne": {
                                    "val": "-22.538"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-22.538"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY17 - Adjustments due to underexecution and fact-of-life changes ($15M).  Other Departmental adjustments ($7M).\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DT6"
                    },
                    "ProjectTitle": {
                        "val": "JOINT DOCTRINE AND TRAINING SUPPORT (RDT&E MGT SUPPORT)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.065"
                        },
                        "CurrentYear": {
                            "val": "4.744"
                        },
                        "BudgetYearOne": {
                            "val": "3.185"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.185"
                        },
                        "BudgetYearTwo": {
                            "val": "5.953"
                        },
                        "BudgetYearThree": {
                            "val": "5.720"
                        },
                        "BudgetYearFour": {
                            "val": "5.325"
                        },
                        "BudgetYearFive": {
                            "val": "5.429"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The activities of this project directly support the Joint Service CB defense program; in particular, the development of Joint Chemical, Biological, Radiological, and Nuclear (CBRN) defense capability requirements and the improvement of CBRN defense related doctrine, education, training, and awareness at the Joint and Service levels.  This effort provides for: (1) Development, coordination, and integration of Joint CBRN defense capability requirements; (2) Development\/revision of medical and non-medical CBRN defense Multi-Service Tactics, Techniques, and Procedures (MTTP) and development\/revision of Joint Doctrine and Tactics, Techniques, and Procedures (JTTP); (3) The CBDP Joint Senior Leader Course (JSLC); (4) Assistance in correcting training and doctrine deficiencies covered in the lessons learned process, combat operations, capability development studies and Department of Defense Inspector General (DODIG) and Government Accountability Office (GAO) reports and; (5) Support of current and planned CBRN defense studies, analysis, training, exercises, and war games; determine overlaps, duplication, and shortfalls; and build and execute programs to correct shortfalls in all aspects of CBRN defense across all DoD mission areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) JRO DT"
                                    },
                                    "Description": {
                                        "val": "The purpose of this requirement is to provide technical and subject matter expert (SME) support in the areas of: related Chemical, Biological, Radiological, and Nuclear Defense (CBRND)\/Countering Weapons of Mass Destruction (CWMD); Joint and Multi-Service doctrine development; Joint and Service training, leadership development, education, and exercises. \n\nSpecifically, support is needed to:\n1.  Conduct technical reviews of Joint and Multi-service CBRN Defense\/CWMD doctrinal materials and develop CBRND\/CWMD related MTTP manuals.\n2.  Plan and conduct CBRN defense\/CWMD Joint Professional Military Education (JPME).\n3.  Provide CBRN defense\/CWMD planning, execution and SME support to Combatant Command (CCMD) and Joint Task Force (JTF) level exercises.\n4.  Conduct staff and leader CBRN defense\/CWMD training for CCMD and JTF level commands.\n\nProvides support to the National Defense University (NDU) Center for the Study of Weapons of Mass Destruction (WMD) to support their efforts as the Chairman's focal point for CWMD JPME."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.065"
                                            },
                                            "Text": {
                                                "val": "Continued to support Joint and Multi-service doctrine development.  This included preparation of various Joint publications which then inform MTTPs.  JRO supported COCOM scenario development and controller\/evaluator training by providing SMEs to exercises.  JRO supported training efforts at various Joint Senior Leadership schools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.652"
                                            },
                                            "Text": {
                                                "val": "Continue to support Joint and Multi-service doctrine development.  This includes preparation of various Joint publications which then inform MTTPs.  JRO will continue to support COCOM scenario development and controller\/evaluator training by providing SMEs to exercises.  JRO will continue to support training efforts at various Joint Senior Leadership schools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.185"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.185"
                                            },
                                            "Text": {
                                                "val": "Continue to support Joint and Multi-service doctrine development.  This includes preparation of various Joint publications which then inform MTTPs.  JRO will continue to support COCOM scenario development and controller\/evaluator training by providing SMEs to exercises.  JRO will continue to support training efforts at various Joint Senior Leadership schools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.092"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY16 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW6"
                    },
                    "ProjectTitle": {
                        "val": "MAJOR RANGE AND TEST FACILITY BASE (MRTFB)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "55.245"
                        },
                        "CurrentYear": {
                            "val": "51.878"
                        },
                        "BudgetYearOne": {
                            "val": "50.639"
                        },
                        "BudgetYearOneBase": {
                            "val": "50.639"
                        },
                        "BudgetYearTwo": {
                            "val": "53.164"
                        },
                        "BudgetYearThree": {
                            "val": "52.862"
                        },
                        "BudgetYearFour": {
                            "val": "53.039"
                        },
                        "BudgetYearFive": {
                            "val": "53.673"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project provides the technical and operational capability for testing Department of Defense (DoD) Chemical and Biological (CB) defense materiel, equipment, and systems from concept through production to include associated special operations Tactics, Techniques and Procedures Development (TTPD) activities at West Desert Test Center (WDTC), a Major Range and Test Facility Base (MRTFB) located at Dugway Proving Ground (DPG).  Project provides overhead (institutional) funding required to operate WDTC in compliance with Section 232 of the National Defense Authorization Act (NDAA) for FY03 (Public Law 107-314 - December 2002).\n\nWDTC is the reliance center for all DoD CB defense testing and provides the United States' only combined range, chamber, toxic chemical lab, and bio-safety level-3 (BSL-3) test facility. Total institutional test operating costs are to be provided by the OSD Chemical and Biological Defense Program IAW Program Budget Decision 250 (1996).\n\nWDTC uses state-of-the-art chemical and life sciences test facilities and test chambers to perform CB defense testing of protective gear, decontamination systems, detectors, equipment, and non-materiel CB defense solutions while maintaining safety, security, and surety of chemical agents and biological pathogens.  WDTC also provides test ranges, to include fully instrumented outdoor ranges, for TTPD activities and testing with simulants that can be correlated to the laboratory testing with live agents to ensure reliable and repeatable data is generated to support acquisition decisions of CB defense equipment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.834"
                                            },
                                            "Text": {
                                                "val": "Maintained WDTC technical test capability and operations to include institutional civilian labor costs.  These civilian personnel ensured the safe and efficient operations of the MRTFB and included safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represented the civilian labor and MRTFB operating costs required to support operations, which could not be directly tied to a single test customer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.518"
                                            },
                                            "Text": {
                                                "val": "Maintains WDTC technical test capability and operations to include institutional civilian labor costs.  These civilian personnel ensure the safe and efficient operations of the MRTFB and include safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor and MRTFB operating costs required to support operations, which cannot be directly tied to a single test customer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.856"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.856"
                                            },
                                            "Text": {
                                                "val": "Maintains WDTC technical test capability and operations to include institutional civilian labor costs.  These civilian personnel ensure the safe and efficient operations of the MRTFB and include safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor and MRTFB operating costs required to support operations, which cannot be directly tied to a single test customer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.454"
                                            },
                                            "Text": {
                                                "val": "Provided for ongoing sustainment of existing test instrumentation and equipment at WDTC, in support of their operations.  Supported annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.504"
                                            },
                                            "Text": {
                                                "val": "Provides for ongoing sustainment of existing test instrumentation and equipment at WDTC, in support of their operations.  Supports annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.319"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.319"
                                            },
                                            "Text": {
                                                "val": "Provides for ongoing sustainment of existing test instrumentation and equipment at WDTC, in support of their operations.  Supports annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.687"
                                            },
                                            "Text": {
                                                "val": "Provided WDTC with a dedicated and specially trained, 24-hour, support staff who operated and maintained all critical control systems, such as, highly complex test specific heating, ventilating, and air conditioning (HVAC) systems and decontamination systems within WDTC's Materiel Test Facility (MTF), Combined Chemical Test Facility (CCTF), and Life Sciences Test Facility (LSTF) Complex."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.956"
                                            },
                                            "Text": {
                                                "val": "Provides WDTC with a dedicated and specially trained, 24-hour, support staff who operate and maintain all critical control systems, such as, HVAC systems and decontamination systems within WDTC's MTF, CCTF, and LSTF Complex."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.696"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.696"
                                            },
                                            "Text": {
                                                "val": "Provides WDTC with a dedicated and specially trained, 24-hour, support staff who operate and maintain all critical control systems, such as, test specific HVAC systems and decontamination systems within WDTC's MTF, CCTF, and LSTF Complex."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.298"
                                            },
                                            "Text": {
                                                "val": "Supported the WDTC defense mission by funding contractor labor overhead costs.  This was the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation.  This provided the additional support through contractual efforts to support variable workload rates and address capacity shortfalls created by civilian authorization limits."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.870"
                                            },
                                            "Text": {
                                                "val": "Supports the WDTC defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.825"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.825"
                                            },
                                            "Text": {
                                                "val": "Supports the WDTC defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation.  Provides the additional support through contractual efforts to support variable workload rates and address capacity shortfalls created by civilian authorization limits."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) NTA TEST"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.972"
                                            },
                                            "Text": {
                                                "val": "Accepted delivery of two Secondary Containment Modules (SCM) and initiated integration of synthesis capability, analytical processes, and methods developed through FY14.  This capability is critical to facilitate successful transition between science and technology (S&T) and test and evaluation (T&E) for NTA and evolving threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.975"
                                            },
                                            "Text": {
                                                "val": "Supports the verification and validation efforts of infrastructure improvements for programs of record testing.  Continues to maintain synthesis capability in other than Class 1 compounds.  Continues to support the readiness of test infrastructure, instrumentation, and equipment along with applying current test procedures for other than Class 1 compounds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.943"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.943"
                                            },
                                            "Text": {
                                                "val": "Maintain synthesis capability of class 1 NTA compounds and other NTA classes in support of program of record test and evaluation.  Develop NTA test methods for uniform materials and protective masks.  Develop chemical dissemination and challenge monitoring methods for other NTA classes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.055"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY16 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "LS6"
                    },
                    "ProjectTitle": {
                        "val": "LABORATORY SUPPORT"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.950"
                        },
                        "CurrentYear": {
                            "val": "10.120"
                        },
                        "BudgetYearOne": {
                            "val": "9.339"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.339"
                        },
                        "BudgetYearTwo": {
                            "val": "13.864"
                        },
                        "BudgetYearThree": {
                            "val": "13.655"
                        },
                        "BudgetYearFour": {
                            "val": "12.949"
                        },
                        "BudgetYearFive": {
                            "val": "13.202"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (LS6) provides for the sustainment and modernization of the DoD laboratory infrastructure capabilities to counter an expanding threat space, exploit advances in technology, and develop and transition chemical and biological (CB) defense equipment and countermeasures to the Warfighter.  This laboratory infrastructure project upgrades key systems to the current state-of-the-art capabilities.  Key systems include: gas filters, mechanical\/electrical, fume hoods, duct work and structural systems.  Provides for the initial equipment outfitting of new facilities.  Ensures that the necessary surety operations can be conducted effectively and safely in support of Chemical and Biological Defense Program (CBDP) RDTE programs.  As a force multiplier, this project will provide more robust capabilities to the CBDP and ensure continuity of operations and environmental compliance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) LABINF - Edgewood Chemical Biological Center Surety Facility Sustainment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.703"
                                            },
                                            "Text": {
                                                "val": "Performed preventative maintenance projects in key surety buildings to assure the efficiency and extend the life of equipment, and reduce the occurrence of unscheduled equipment outages.  \n\nModernized aging chemical and biological surety laboratories up to state of the art standards to ensure continued support of CBDP's RDTE programs to include toxic lab demolition, force protection project, water treatment system, high pressure air compressor system and distribution piping."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.721"
                                            },
                                            "Text": {
                                                "val": "Perform general facility sustainment and modernization in key surety facilities that support the Chemical Biological Defense Program (CBDP).  Provides for gas filter maintenance and changeout, sustainment of critical laboratory systems (fume hoods, exhaust systems, control systems, electrical\/mechanical systems, plumbing, emergency backup power), and modernization of key chemical and biological surety laboratories."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.839"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.839"
                                            },
                                            "Text": {
                                                "val": "Perform general facility sustainment and modernization in key surety facilities that support the CBDP.  Provides for gas filter maintenance and change out, sustainment of critical laboratory systems (fume hoods, exhaust systems, control systems, electrical\/mechanical systems, plumbing, emergency backup power), and modernization of key chemical and biological surety laboratories."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) LABINF - USAMRIID\/USAMRICD Infrastructure Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.247"
                                            },
                                            "Text": {
                                                "val": "Provide laboratory infrastructure support to laboratory operations, facilities sustainment, and regulatory compliance for critical chemical biological defense activities at the U.S. Army Medical Research Institute for Infectious Diseases and the U.S. Army Medical Research Institute for Chemical Defense."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.171"
                                            },
                                            "Text": {
                                                "val": "Provide laboratory infrastructure support to laboratory operations, facilities sustainment, and regulatory compliance for critical chemical biological defense activities at the U.S. Army Medical Research Institute for Infectious Diseases and the U.S. Army Medical Research Institute for Chemical Defense."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Provide laboratory infrastructure support to laboratory operations, facilities sustainment, and regulatory compliance for critical chemical biological defense activities at the U.S. Army Medical Research Institute for Infectious Diseases and the U.S. Army Medical Research Institute for Chemical Defense."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) ZSBIR"
                                    },
                                    "Description": {
                                        "val": "SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.228"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY16 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MS6"
                    },
                    "ProjectTitle": {
                        "val": "RDT&E MGT SUPPORT"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.404"
                        },
                        "CurrentYear": {
                            "val": "31.385"
                        },
                        "BudgetYearOne": {
                            "val": "21.212"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.212"
                        },
                        "BudgetYearTwo": {
                            "val": "39.986"
                        },
                        "BudgetYearThree": {
                            "val": "38.516"
                        },
                        "BudgetYearFour": {
                            "val": "35.658"
                        },
                        "BudgetYearFive": {
                            "val": "36.544"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides management support for the DoD Chemical and Biological Defense Program (CBDP).  It includes program oversight and integration of overall non-CBRN Defense Equipment (non-CDE) and CBRN Defense Equipment (CDE) programs by the Assistant Secretary of Defense for Nuclear, Chemical, and Biological Defense Programs (ASD(NCB)) and defense programs through the Deputy Assistant Secretary of Defense for Chemical and Biological Defense (DASD(CBD)).  Funds execution management is provided by DTRA. \n\nThe project also provides for the development, coordination and integration of Joint Chemical, Biological, Radiological and Nuclear (CBRN) defense capability requirements, including assistance and support to the Combatant Commanders (COCOMs) and Services to improve CBRN defense related doctrine, education, training, and awareness by the Joint Requirements Office (JRO); preparation of Joint Capability Integration and Development System (JCIDS) documents in accordance with Chairman of The Joint Chiefs of Staff Instruction CJCSI 3170.01I dated 23 January 2015; Joint CBRN Defense Research, Development, and Acquisition (RDA) planning; input to the CBD Annual Report to Congress; and program guidance development by the Program Analysis and Integration Office (PAIO).\n\nThe project includes programming support for the Joint Service CB Information System (JSCBIS) which serves as a budgetary and informational database for the DoD CBDP.  Also included within the project is financial management services to include fund distribution, execution reporting, and fiscal financial statements.\n\nThis project also supports the Chemical, Biological, Radiological and Nuclear Defense (CBRND) Test and Evaluation (T&E) Executive, who is responsible for the planning, balancing, and oversight of test infrastructure and test technology requirements to support Developmental Testing (DT) and Operational Testing (OT) of DoD CBRND systems, as outlined in the RDA Plan.  The CBRND T&E Executive oversees the Enterprise processes to develop and sustain standardized T&E methodologies and validated instrumentation and infrastructure to ensure the adequacy of test for CBRND systems in alignment with acquisition milestones and associated decision points.  The Joint Test Infrastructure Working Group (JTIWG) program supports T&E Early Involvement; test threat planning; T&E studies; and T&E standards planning and development to support CBRND testing for all Services to include medical T&E efforts.  \n\nThe CBRND T&E Executive directly supports OSD T&E oversight acquisition programs and provides the mechanism for early T&E involvement in the acquisition process.  The CBRND T&E Executive provides the T&E infrastructure investment strategy and coordinates investment planning and T&E capabilities validation among the Joint Service Community to ensure that program needs are met.  The CBRND T&E Executive oversees the T&E processes to ensure end to end feedback loops to support to the Warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) JRO MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.411"
                                            },
                                            "Text": {
                                                "val": "Implemented CBRN Defense medical and non-medical capabilities development by representing the Services and COCOMs in JCIDS and acting as their proponent for coordinating and integrating CBRND operational capabilities.  Chaired the Countering Weapons of Mass Destruction (CWMD) Working Group for the Protection Functional Capabilities Board (FCB).  Served as the Joint Staff focal point for CBRN reports, assessments, meetings, agreements, concepts and studies, Advanced Technology Demonstrations (ATDs), and Joint Capability Technology Demonstrations (JCTDs).  Lead the CBDP Enterprise Program Objective Memorandum (POM) development.  Prepared various JCIDS documents, including Analysis of Alternatives (AoAs), Information System Initial Capability Documents (IS ICDs), Capability Development Documents (CDDs), and Capability Production Documents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.516"
                                            },
                                            "Text": {
                                                "val": "Will implement CBRN Defense medical and non-medical capabilities development by representing the Services and COCOMs in JCIDS and acting as their proponent for coordinating and integrating CBRND operational capabilities.  Will chair the CWMD Working Group for the Protection Functional Capabilities Board (FCB).  Will serve as the Joint Staff focal point for CBRN reports, assessments, meetings, agreements, concepts and studies, ATDs, and JCTDs.  Will lead the CBDP Enterprise POM development.  Will prepare various JCIDS documents, including AoAs, IS ICDs, CDDs, and CPDs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.474"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.474"
                                            },
                                            "Text": {
                                                "val": "Will implement CBRN Defense medical and non-medical capabilities development by representing the Services and COCOMs in JCIDS and acting as their proponent for coordinating and integrating CBRND operational capabilities.  Will chair the CWMD Working Group for the Protection FCB.  Will serve as the Joint Staff focal point for CBRN reports, assessments, meetings, agreements, concepts and studies, ATDs, and JCTDs.  Will lead the CBDP Enterprise POM development.  Will prepare various JCIDS documents, including AoAs, IS ICDs, CDDs, and CPDs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) JTIWG"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.743"
                                            },
                                            "Text": {
                                                "val": "Performed the following activities in support of T&E Executive mission to ensure credible testing and evaluation: T&E Early Involvement; T&E Studies; testing, evaluation and decision support for CBDP systems; support the DOT&E for OSD T&E Oversight; support the NCB in infrastructure planning; input to the POM process; oversee test centers to ensure compliance with OSD policies and regulations; and establishing T&E Standards to support the White House Subcommittee on Standards and other interagency groups.\n\nSupported JRO ICTs and OSD and acquisition IPTs by providing technical assistance to structure acquisition programs, planning for Analysis of Alternatives, and developing test scopes.  \n\nCoordinated involvement of the OTAs and other T&E organizations in T&E infrastructure planning, development, validation, and test execution.  \n\nDeveloped threat test support documentation to support DT, DT\/OT and OT in which an operational threat must be realistically presented to properly characterize material and doctrine solutions.\n \nProvided technical expertise to JPEO-CBD in TEMP development and execution.  Reviewed and approved TEMPs.  Programs supported include JBTDS; JCAD integration into Stryker Joint Nuclear, Biological, and Chemical Reconnaissance System; NGCD Increments 1 through 3; JECP; CIDAS; JESEW; JPDE-HME; DR-SKO, Stryker NBCRV, RDS, NGDS; JEM; JWARN; CHRP; CALS; all variants of JSAM; and other activities including JUPITR ATD, and Chemical Demilitarization\n\nContinued support to JPEO-CBD, JSTO, and WDTC for specific test methodology and test technology needs; technology transition planning for T&E methodologies, resources and infrastructure; and participation in scientific review panels.\nProvided support to OTAs in coordination of Lead OTA assignment, integration of test planning, issue resolution, and facilitation of OSD approval of test documents.  \n\nContinued to lead the International T&E methodology development and standardization efforts to support partnering agreements with Australia, Canada, France, Israel, Norway and the UK in order to leverage unique T&E resources and share test costs.  \nProvided T&E infrastructure input to the POM process and supported the Services, JRO, PAIO, and NCB in development and defense of POM and Budget submissions.\n\nProvided guidance to the CBDP Enterprise for Non-Traditional Agent (NTA) testing for developmental testing.\n\nParticipated and supported OSD WIPTs, IIPTs and EEBs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.808"
                                            },
                                            "Text": {
                                                "val": "Continue T&E Executive mission support to ensure credible testing; T&E Early Involvement; T&E Studies; evaluation and decision support for CBDP systems; support the DOT&E for OSD T&E Oversight; and support the NCB in infrastructure planning; input to the POM process; and establishing T&E Standards to support the White House Subcommittee on Standards and other interagency groups.  \nContinue efforts to develop, refine, and\/or streamline processes for identifying, assessing, and addressing gaps in T&E capabilities to ensure timely support to acquisition programs.\nContinue mission to improve the quality and reduce the costs of test planning and execution; eliminate unnecessary redundancies in test infrastructure.\n\nContinue direct support of the JRO ICTs and IPTs providing technical assistance to structure acquisition programs, plan for Analysis of Alternatives, and develop test scopes.  \n\nContinue direct coordination of early involvement of the OTAs and other T&E organizations in T&E infrastructure planning, development, and validation.  \n\nContinue development of threat test support documentation to support DT and OT. \nContinue direct support to the JPEO-CBD.  Anticipated programs supported include JBTDS; NGCD Increments 1 through 4; UIPE II; JECP; NGDS; JBADS; JCACS ATD; JESEW; JPDE-HME; JEM; JCAD integration in into Stryker Nuclear, Biological, and Chemical Reconnaissance System; JWARN; CALS; all variants of JSAM; and other active acquisition programs including JUPITR ATD. \n\nContinue support to JPEO-CBD, JSTO, and WDTC for specific test methodology and test technology needs; technology transition planning for T&E methodologies, resources and infrastructure; and participation in scientific review panels.\n\nContinue to provide guidance to improve TEMPs for acquisition programs; approval of TEMPs; development of threat support documentation; and validation of T&E Capabilities and associated standards.  \n\nContinue supporting OTAs in coordination of Lead OTA assignment, integration of test planning, issue resolution, and facilitation of OSD approval of test documents.  \n\nContinue to lead the International T&E methodology development and standardization efforts to support the Australia, Canadian, UK, and US MOU and other international partnering agreements.  \nProvide T&E infrastructure input to the POM process and support the Services, JRO, PAIO, and NCB in development and defense of POM and Budget submissions.\n\nDevelop Aerosol and surface contamination detection and measurement capabilities and transition them for chemical sensing T&E.\n\nConduct Red Team, Table Top Exercises (TTXs) and TEMP training for IPTs.\n\nParticipate in DT and OT Test Readiness Reviews (TRR) to determine if the testing planning is adequate for execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.716"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.716"
                                            },
                                            "Text": {
                                                "val": "Continue T&E Executive mission support to ensure credible testing; T&E Early Involvement; T&E Studies; evaluation and decision support for CBDP systems; support the DOT&E for OSD T&E Oversight; and support the NCB in infrastructure planning; input to the POM process; and establishing T&E Standards to support the White House Subcommittee on Standards and other interagency groups.  \nContinue efforts to develop, refine, and\/or streamline processes for identifying, assessing, and addressing gaps in T&E capabilities to ensure timely support to acquisition programs.\nContinue mission to improve the quality and reduce the costs of test planning and execution; eliminate unnecessary redundancies in test infrastructure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) OSD MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.268"
                                            },
                                            "Text": {
                                                "val": "Perform program reviews\/assessments, provide programmatic PPBE oversight\/analysis, and provide congressional issue analysis and support.  Support financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.095"
                                            },
                                            "Text": {
                                                "val": "Perform program reviews\/assessments, provide programmatic PPBE oversight\/analysis, and provide congressional issue analysis and support.  Support financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.922"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.922"
                                            },
                                            "Text": {
                                                "val": "Perform program reviews\/assessments, provide programmatic PPBE oversight\/analysis, and provide congressional issue analysis and support.  Support financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) DFAS EFD ADJUSTMENT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.660"
                                            },
                                            "Text": {
                                                "val": "Adjustment to balance to DFAS financial reporting within OSD.  This is solely an accounting transaction."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) PAIO MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.322"
                                            },
                                            "Text": {
                                                "val": "Developed assessments to support RDA Planning.  Provided analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Responded to specialized evaluation studies throughout the PPBE process.  Provided JSCBIS database management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.424"
                                            },
                                            "Text": {
                                                "val": "Develop assessments to support RDA Planning.  Provide analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Respond to specialized evaluation studies throughout the PPBE process.  Provide JSCBIS database management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "Develop assessments to support RDA Planning.  Provide analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Respond to specialized evaluation studies throughout the PPBE process.  Provide JSCBIS database management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.542"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY16 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "O49"
                    },
                    "ProjectTitle": {
                        "val": "JOINT CONCEPT DEVELOPMENT AND EXPERIMENTATION PROGRAM"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.933"
                        },
                        "CurrentYear": {
                            "val": "4.111"
                        },
                        "BudgetYearOne": {
                            "val": "1.379"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.379"
                        },
                        "BudgetYearTwo": {
                            "val": "4.993"
                        },
                        "BudgetYearThree": {
                            "val": "4.669"
                        },
                        "BudgetYearFour": {
                            "val": "4.135"
                        },
                        "BudgetYearFive": {
                            "val": "4.215"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The objectives of the Joint Concept Development and Experimentation (JCDE) program are to support the Joint Requirements Office to develop, coordinate, and execute CBRND studies, experiments, analyses and architecture, in order to develop future operational concepts and support the efficient and effective generation of CBRN requirements.\n\nSpecific lines of effort across the Future Years Defense Program (FYDP) include: qualitatively characterizing emerging CBRN threats and operational risks to the Joint Force; conducting innovative approaches to deal with technical studies; analyzing Concepts of Operations for employing and developing capabilities; and analyzing specific issues that contribute to POM development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) JCDE"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.933"
                                            },
                                            "Text": {
                                                "val": "Continued JCDE analysis.  Performed Advanced Threat Analysis with several more categories of threat.  Determine best representative agents for consideration in requirements and testing.  Conducted detailed quantitative analyses to determine detection and challenge levels from key representative solid, dusty, liquid, viral, and bacterial threats.  Conduct detailed operational risk analyses to support CBDP leadership decisions.  Completed biosurveillance architecture.  Completed a new Concept for CBRN Defense to replace the final portion of the 2007 Countering Weapons of Mass Destruction (CWMD) Joint Integrating Concept (JIC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.036"
                                            },
                                            "Text": {
                                                "val": "Will continue JCDE analysis.  Will continue to perform Advanced Threat Analysis with several more categories of threat.  Will update best representative agents for consideration in requirements and testing.  Will conduct detailed quantitative analyses to determine detection and challenge levels from key representative threats determined in the FY15 Advanced Threat Studies.  Will update detailed operational risk analyses to support CBDP leadership decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.379"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.379"
                                            },
                                            "Text": {
                                                "val": "Will continue JCDE analysis.  Will continue to perform Advanced Threat Analysis with several more categories of threat.  Will update best representative agents for consideration in requirements and testing.  Will conduct detailed quantitative analyses to determine detection and challenge levels from key representative threats determined in the FY15 Advanced Threat Studies.  Will update detailed operational risk analyses to support CBDP leadership decisions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.075"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY16 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}