{
    "id": "d82ace37e6135efd83bce740faf759c70df65253",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA2_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602787A"
        },
        "ProgramElementTitle": {
            "val": "Medical Technology"
        },
        "R1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "74.285"
            },
            "CurrentYear": {
                "val": "76.853"
            },
            "BudgetYearOne": {
                "val": "77.111"
            },
            "BudgetYearOneBase": {
                "val": "77.111"
            },
            "BudgetYearTwo": {
                "val": "82.334"
            },
            "BudgetYearThree": {
                "val": "82.912"
            },
            "BudgetYearFour": {
                "val": "84.549"
            },
            "BudgetYearFive": {
                "val": "86.586"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2015 and 2016 Project 874 funds both Combat Casualty Care and Clinical and Rehabilitative Medicine efforts. In FY17 the Clinical and Rehabilitative Medicine efforts will be funded in Project ET4. Starting in FY17 the FH2 funding and research will be merged into Project 869. Additionally, starting in FY17 the toxic substances research efforts will move from Project VB4 to Project 869."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports application of knowledge gained through basic research to refine drugs, vaccines, medical devices, diagnostics, medical practices\/procedures, and other preventive measures essential to the protection and sustainment of Warfighter health. Research is conducted in five principal areas: Combat Casualty Care; Military Operational Medicine; Military Relevant Infectious Diseases Clinical and Rehabilitative Medicine; and Systems Biology\/Network Sciences. Research is funded in six projects.  \n\nProject 869 refines knowledge and technologies on screening tools and preventive measures for Post-Traumatic Stress Disorder (PTSD) and mild traumatic brain injuries, physiological monitors, and interventions to protect Warfighter's from injuries resulting from operational stress, and exposure to hazardous environments and materials.  Also conducts research on medically valid testing devices (i.e. the test mannequins that are true to the human form and physiologically and anatomically accurate) and predictive models used for the refinement of Warfighter protective equipment. This project is being coordinated with the Defense Health Program. Starting in FY17 the FH2 funding and research will be consolidated into this project. Additionally, starting in FY17 the toxic substances research efforts will move from project VB4 to project 869.\n\nProject 870 designs and refines drugs, vaccines, medical diagnostic assays\/tests devices, other preventive measures for protection and treatment against naturally occurring infectious diseases and wound infections of military importance, as identified by worldwide medical surveillance and military threat analysis. This project is being coordinated with the Defense Health Program.  \n\nProject 874 identifies and evaluates drugs, biologics (products derived from living organisms), medical devices, and diagnostics for field trauma care systems, resuscitation, and life support, and post-evacuation restorative and rehabilitative care. Focus is identifying more effective critical care technologies and protocols to treat severe bleeding, traumatic brain injury, burns and other combat related traumatic injuries, and treatments for ocular (eye) injury and visual system dysfunction.  Additional focus areas are laboratory and animal studies of regenerating skin, muscle, nerves, and bone tissue for the care and treatment of combat trauma casualties. This project is being coordinated with the Defense Health Program. In FY15 and 16 this project funds both Combat Casualty Care and Clinical and Rehabilitative Medicine efforts. In FY17 the Clinical and Rehabilitative Medicine efforts will be funded in project ET4.\n\nProject ET4, which is a restructure of efforts funded elsewhere in this Program Element, starts in FY17 and the funding for the Clinical and Rehabilitative Medicine Research Program moves from project 874 to project ET4. Project ET4 identifies and evaluates drugs, biologics, medical devices, treatments and diagnostics for post-evacuation restorative, regenerative and rehabilitative care, as well as systems for use by field medics and surgeons for ocular trauma. Research focus is on identifying more effective technologies and protocols to treat ocular injury and visual system dysfunction, as well as laboratory and animal studies for regenerating skin, muscle, nerves, vascular and bone tissues for the care and treatment of battle-injured casualties. This project is being coordinated with the Defense Health Program. \n\nProject FH2 conducts applied research focused on sustainment of a healthy Warfighters throughout the entire deployment life cycle. Starting in FY17 the FH2 funding and research will be consolidated into project 869.\n\nProject VB4 includes applied research in systems biology to provide a highly effective mechanism to integrate biological tests and computer simulations in clinical trials and in animal studies. The PTSD and Coagulopathy exemplars have demonstrated the power of an iterative systems biology approach and are moving projects related to objective diagnostics and improved and personalized therapeutic strategies. Development of the SysBioCube (a data analysis, management and integration system) has provided an ability for complex collaborative efforts to share, process and evaluate data using innovative technologies. These concerted refinement efforts using systems biology are showing reduction of time and funding for solutions to intractable problems of critical military importance. Starting in FY17 the toxic substances efforts will move from project VB4 to project 869. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nAll medical applied research is conducted in compliance with Food and Drug Administration (FDA) or Environmental Protection Agency (EPA) regulations. The FDA requires thorough testing in animals (preclinical testing) to ensure safety and, where possible, effectiveness prior to evaluation in controlled human clinical trials (upon transition to 6.3 Advanced Technology Development). This PE focuses on research and refinement of technologies such as product formulation and purification and laboratory test refinement with the aim of identifying candidate solutions. This work often involves testing in animal models. The EPA also requires thorough testing of products, such as sterilants, disinfectants, repellents, and insecticides to ensure the environment is adequately protected before these products are licensed for use.\n\nProgram refinement and execution is externally peer-reviewed and fully coordinated with all Services as well as other agencies through the Joint Technology Coordinating Groups of the Armed Services Biomedical Research Evaluation and Management (ASBREM) Community of Interest (COI). The ASBREM COI, formed under the authority of the Assistant Secretary of Defense for Research and Engineering, serves to facilitate coordination and prevent unnecessary duplication of effort within the Department of Defenses (DoD) biomedical research and refinement community, as well as their associated enabling research areas.\n\nWork funded in this project PE is fully coordinated with efforts undertaken in PE 0603002A and the Defense Health Program.\n\nWork in this PE is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD and its overseas laboratories; Army Medical Research Institute of Infectious Diseases (USAMRIID) and the Armed Forces Institute of Regenerative Medicine (AFIRM), Fort Detrick, MD; Army Center for Environmental Health Research (USACEHR), Fort Detrick, MD; Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; the Army Dental Trauma Research Detachment and the Army Institute of Surgical Research (USAISR), Joint Base San Antonio, TX; Army Aeromedical Research Laboratory (USAARL), Fort Rucker, AL; and the Naval Medical Research Center (NMRC), Silver Spring, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "76.044"
                },
                "CurrentYear": {
                    "val": "76.853"
                },
                "BudgetYearOne": {
                    "val": "77.111"
                },
                "BudgetYearOneBase": {
                    "val": "77.111"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "74.285"
                },
                "CurrentYear": {
                    "val": "76.853"
                },
                "BudgetYearOne": {
                    "val": "77.111"
                },
                "BudgetYearOneBase": {
                    "val": "77.111"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.759"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.759"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "869"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Health Prot & Perf Stnds"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.929"
                        },
                        "CurrentYear": {
                            "val": "30.043"
                        },
                        "BudgetYearOne": {
                            "val": "37.409"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.409"
                        },
                        "BudgetYearTwo": {
                            "val": "39.213"
                        },
                        "BudgetYearThree": {
                            "val": "39.462"
                        },
                        "BudgetYearFour": {
                            "val": "40.244"
                        },
                        "BudgetYearFive": {
                            "val": "41.369"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Starting in Fiscal Year (FY) 2017 Project FH2 (Force Health Protection – Applied Research) funding and research efforts are merged into Project 869.  Additionally in FY17 the toxic substances research and funding will move from Project VB4 (System Biology And Network Science Technology) into Project 869."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts research to prevent and protect Warfighters from training and operational injuries, refine mechanisms for detection of physiological (human physical and biochemical function) and psychological (mental) health problems, evaluate hazards to head, neck, spine, eyes, and ears, set the standards for rapid return-to-duty, and determine new methods to sustain and enhance performance across the operational spectrum. This research provides medical information important to the design and operational use of military systems, and this work forms the basis for behavioral, training, pharmacological (drug actions), and nutritional interventions. \n\nThe four main areas of study are: \n(1) Environmental Health and Protection \n(2) Physiological Health\n(3) Injury Prevention and Reduction\n(4) Psychological Health and Resilience\n\nAdditionally the Warfighter Systems Engineering Architecture task advances medical Science and Technology (S&T) in the areas of injury prevention and performance sustainment in the context of human interaction with new Soldier systems and provide greater insight into informing new research in development of Warfighter systems and the interactions between Warfighters and the systems they employ.  \n\nPromising efforts identified in this project are further matured under Program Element (PE) 0603002A, project MM3.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n\nWork in this project is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; the United States Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; the United States Institute of Surgical Research (USAISR), Joint Base San Antonio, TX; and the United Styates Army Aeromedical Research Laboratory (USAARL), Fort Rucker, AL. \n\nEfforts in this project support the Soldier Portfolio and the principal areas of Combat Casualty Care and Military Operational Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Physiological Health - Nutritional Sustainment and Fatigue Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates methods for managing and controlling the effects of fatigue on Warfighter operational performance and the impact of nutritional strategies to optimize operational performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.534"
                                            },
                                            "Text": {
                                                "val": "Established nutrition approaches that promoted resistance to physical, cognitive and environmental stressors and promoted muscle and bone recovery. Developed next generation predictive algorithms that estimated overheating for incorporation into wearable sensor systems. Established sensors and bio-mathematical models (math equations to explain biological processes) capable of predicting cognitive status and likelihood of risk for musculoskeletal (muscle, bone, tendons, and ligaments) injury. Determined patterns of physiological (human mechanical, physical, and biochemical functions), behavioral, and cognitive-affective responses in individuals during exposure to multiple stressors and developed a working operational definition of physiological resilience and algorithms to predict individualized resilience."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.617"
                                            },
                                            "Text": {
                                                "val": "Determine the role of eating rate in energy balance. Establish the effects of nutritional interventions on the localized immune response during wound healing. Determine the effectiveness of novel feeding platforms (dining facility organization) for the improvement of dietary quality during garrison feeding. Determine relevant predictors, moderators and outcome metrics that enhance the ability to predict a Warfighters capacity to recover quickly, both mentally and physically. Establish a capability to sense and predict physiological responses in individual Warfighters following exposure to environmental stressors or during operational missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.105"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.105"
                                            },
                                            "Text": {
                                                "val": "Will perform field experiments to establish nutritional parameters that can enhance resistance to stress and augment wound healing. Will evaluate how nutritional interventions can enhance recovery of brain function following caloric deficit. Will determine the effectiveness of a prophylactic (treatment for prevention of disease) nutrient or dietary nutrient cocktail for improving deleterious effects of impact, acceleration, and\/or blast –induced head injury. Will validate a preliminary descriptive model outlining factors linking the central nervous system and other organs\/ systems that impact resilience, using data from field studies. Will down select candidate physiological biomarkers (indicator of a process, event, condition or change within the body) of resilience based upon objective measures of success during relevant Military scenarios. Will conduct laboratory study to evaluate intra-individual (trait) responsivity under varied sleep loss conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Concussion\/Mild Traumatic Brain Injury (mTBI) Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates methods to detect and treat concussion as well as identify and evaluate the effects of cognitive deficits (decreases in the ability of individuals to acquire knowledge and understanding through thought experience and the senses) and risk factors for spinal injury in Military vehicle occupants during operations. In FY17 this effort moves from project FH2 to project 869."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.422"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.422"
                                            },
                                            "Text": {
                                                "val": "Will determine incidence and risk factors for spinal injury and evaluate the military vehicle occupant environment. Will develop provisional spinal injury criteria and assessment methods for occupant protection. Will determine the severity and duration of neurobehavioral and neuropathological (behavioral traits and structure of the brain) disruptions resulting from re-exposure to blast and\/or impact-induced head injuries with intervals between insults ranging from 1 to 72 hours and compared to single head insults. Will determine if a traumatic underwater stressor or intermittent electric shock can infer heightened vulnerability to mTBI by comparison of the magnitude and duration of functional impairments resulting from blast mTBI alone using a small animal model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection - Physiological (human physical and biochemical functions) Awareness Tools and Warrior Sustainment in Extreme Environments"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates the combined impact of extreme temperatures, humidity, and altitude on human health and performance and determines novel mitigation strategies to enhance tolerance, sustain performance, and protect the Warfighter against environmental injury. This effort provides evidence-based practice recommendations, biomarkers of adaptation, and models for protecting health and performance against combinations of environmental threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.309"
                                            },
                                            "Text": {
                                                "val": "Identified physiological reflexes that improve hand and finger dexterity during cold exposure and refined localized heating strategies to improve dexterity in cold weather operations. Developed decision aids for trade-off analyses of the impact of body armor protection and load on aerobic performance capabilities in temperate and hot environments. Determined if thermoregulatory (ability of an organism to keep its body temperature within certain boundaries) fatigue and altitude exposure increase susceptibility for non-freezing cold injury symptoms including numbness. Identified biomarkers (indicator of a process, event, condition or change within the body) predictive of individual risk for developing acute mountain sickness at high altitude operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.446"
                                            },
                                            "Text": {
                                                "val": "Perform laboratory and field studies to refine predictive models of altitude sickness, acclimatization status, and work performance at high altitude. Develop a mobile application for a personal computer-based Altitude Readiness Management System decision aid, and automated altitude acclimatization monitor for a rapid ascent to high altitudes. Determine if thermoregulatory (ability of an organism to keep its body temperature within certain boundaries) fatigue or high altitude exposures increase susceptibility of non-freezing cold injury and hypothermia. Determine if localized warming that will improve peripheral blood circulation will also decrease susceptibility to non-freezing cold injury. Establish the effectiveness of novel pharmaceutical treatments for heat injury in an animal model to inform the development of promising drug interventions proposed to reduce the severity or alleviate organ damage and enhance recovery."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.578"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.578"
                                            },
                                            "Text": {
                                                "val": "Will determine the combined impact of heat, humidity, and altitude on human health and performance and will research mitigation strategies to enhance tolerance and sustain performance against environmental injury or environmental threats. Will determine the reliability, reproducibility, and validity of a militarily-relevant dexterity assessment instrument during cold-air exposures. Will determine the scientific basis for developing focused heating and cooling solutions for improved peripheral blood circulation to maintain fine motor hand dexterity, core and skin temperatures, and optimize physical and cognitive performance during extreme climate operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biomarkers of Exposure and Environmental Biomonitoring (measurement of the body’s response to toxic chemical compounds, elements, or their metabolites, in biological substances)"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement and evaluation of methods to detect exposure to environmental contaminants and toxic chemicals during military operations. This effort develops an integrated experimental and computational platform to characterize host responses to environmental hazards in terms of pathogenic (disease causing) and adaptive processes, yielding mechanistically based drug targets and molecular diagnostics. The funding for this research effort was previously in project VB4 and moved to project 869 in FY17."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.925"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.925"
                                            },
                                            "Text": {
                                                "val": "Will utilize an integrated experimental and computational platform to evaluate host responses to environmental hazards in terms of pathogenic and adaptive processes. Will evaluate target mechanisms for drug efficacy and molecular diagnostics. Will determine candidate biomarkers of liver and kidney injury caused by military relevant chemicals and other environmental stressors. Will evaluate mathematical models that predict dose and time based host response biomarkers, in serum or urine, to metal and volatile organic compound toxicity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Neurosensory Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "This area includes research efforts to develop prevention based strategies and medically based injury criteria for hearing, vestibular (sensory system supporting movement and sense of balance, located in the inner ear), and ocular\/facial protection devices, develop and evaluate neurosensory operational risk factors, develop medically based guidelines to assess neurosensory performance and model the effects of acoustic and impact trauma, as stressors on vision and hearing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.437"
                                            },
                                            "Text": {
                                                "val": "Developed spinal injury criteria and protection assessment methodologies for military vehicle occupants. Developed methods for assessing the effectiveness of prevention strategies against hearing and vestibular injuries. Developed assessment criteria for prediction of eye injury resulting from blunt, ballistic, and blast-wave forces, and determined injury prevention criteria for eye injury induced by repetitive blast exposures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.463"
                                            },
                                            "Text": {
                                                "val": "Perform crash and blast relevant vertical acceleration experiments to determine improved predictions and diagnostics of spinal injury. Characterize middle ear function under impulse (sudden loud) noise for improvement of current hearing injury models. Validate test criteria, and develop predictive ocular (eye) injury algorithm to evaluate protective eyewear."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.191"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.191"
                                            },
                                            "Text": {
                                                "val": "Will continue collecting data from human volunteers on the middle ear's response to impulsive sounds; will begin evaluating the complex interaction between auditory and vestibular protective systems. Will determine threshold blast overpressure and impulse exposure leading to cellular level ocular injury and refine scaling laws to be able to relate experiments conducted in small animal models to exposure conditions in humans."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Musculoskeletal Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and assesses the effects of repetitive motion during military operations and training on the human body; will provide mathematical models to predict the likelihood of physical injuries following continuous operations and muscle fatigue; evaluates current standards for return-to-duty; and establishes improved medical test methods with the goal of rapid return to duty of Warfighters following injury."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.031"
                                            },
                                            "Text": {
                                                "val": "Developed mathematical models of functional neuromuscular adaptation (changes in the way the nervous system communicates with the musculoskeletal system) following muscle injury and determined the effect of inflammatory processes on muscle repair and regeneration. These models predicted the relative risk of re-injury, and incomplete healing. Determined the modifiable and non-modifiable risk hazards for musculoskeletal injuries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.054"
                                            },
                                            "Text": {
                                                "val": "Utilize mathematical models of neuromuscular processes (central nervous system control of muscle functioning) to develop interventions that promote repair and regeneration following muscle injury and modify the inflammatory response and reduce the risk of incomplete healing or subsequent re-injury. Utilize knowledge of risk factors obtained from basic studies to develop interventions to prevent and mitigate risks in the training and operational environments that could lead to musculoskeletal (muscle, bone, tendons, and ligaments) injuries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.481"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.481"
                                            },
                                            "Text": {
                                                "val": "Will determine the roles of endocrine (hormones) and intracellular signaling molecules (within the cell) involved in skeletal muscle and bone development, regeneration, and repair utilizing cell based animal and human models for transition to clinical trials. Will develop a mathematical model of ideal bone density and structure that offsets risk of stress fracture. Will evaluate situations that create unnecessary musculoskeletal risk hazards, and make recommendations for improvement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Injury Return-to-Duty (RTD) Standards"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates current standards for rapid RTD and establishes improved and validated medical standards and test methods with the goal of more rapid and safe RTD of injured Warfighters. Starting in FY17 the work performed here will be captured in other areas (Injury Prevention and Reduction - Neurosensory Injury Prevention and Injury Prevention and Reduction - Musculoskeletal Injury Prevention."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.952"
                                            },
                                            "Text": {
                                                "val": "Characterized current Warfighter injury trends in training and operations contributing to lost duty days, reduced mission effectiveness, and occupational disability. Determined the effects of physical, auditory, and visual system injury on military occupational performance and define minimal pre-RTD performance standards Warfighter. Evaluated Warfighters with traumatic brain injury (TBI) and co-morbid auditory or vision deficits."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.636"
                                            },
                                            "Text": {
                                                "val": "Develop standards based on current Warfighter trends of Warfighter injuries contributing to lost duty days, reduced mission effectiveness and occupational disability, specific to Military Occupational Specialties. Perform studies to update the neurosensory (sensory activity or functions of the nervous system) performance return to duty toolkit previously transitioned to the Defense Center of Excellence for Psychological health and TBI. Determine the effects of physical injury on military occupational performance and define minimal standards for Warfighter performance prior to returning to duty."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health - Psychological Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates early interventions to prevent and reduce combat-related behavioral health problems, including symptoms of post-traumatic stress disorder (PTSD), depression, anger problems, anxiety, substance abuse, post-concussive symptoms, and other health risk behaviors.  Also assesses and refines tools and interventions to enhance and sustain psychological resilience throughout the Warfighter's career."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.188"
                                            },
                                            "Text": {
                                                "val": "Developed and disseminated validated strategies and early interventions to enhance and sustain mental health and well-being throughout the Warfighters careers and determined evidence-based recommendations for reintegration strategies. Benchmarked behavioral health problems, risk, and resilience physiological biomarkers in Warfighters and their Families. Conducted analyses of neurocognitive (relating to or involving the central nervous system and cognitive abilities) test scores associated with a wide variety of psychological RTD outcomes. Conducted studies that explored the utility of sleep monitors and neurocognitive tools for psychological RTD decision making. Assessed various mechanisms and interventions for reducing deployment-related anxiety. Developed and validated unit-based, post-deployment resilience training for Warfighters. Conducted trials with active duty Warfighters assessing optimal intervention methods for PTSD, including medications. Determined the correlation between levels of individual biomarkers and PTSD interventions, i.e. supplementing the current standard of care with extended exposure to surrogate traumatic events and virtual reality, to recreate the context of the original traumatic exposure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.960"
                                            },
                                            "Text": {
                                                "val": "Explore the effectiveness of improved sleep quality and quantity on the recovery from concussion. Perform studies to improve a Mindfulness training package to develop recommendations for Comprehensive Warfighter and Family Fitness (CSF2). Analyze data from previous studies to determine if an alcohol use screening questionnaire can be effectively used in Warfighters. Perform studies to revise Family resilience training across the deployment cycle. Develop evidence-based recommendations for identifying and addressing difficulties with post-combat adjustment. Conduct studies to verify whether a computer-based tool can help Warfighters deal with occupational stress and have more positive post-deployment outcomes, to include a reduction in anger symptoms. Perform studies to improve and validate unit-based resilience training for Reserve Components. Begin to evaluate evidence-based behavioral health leader training. Provide recommendations for provider toolkit using sleep quality parameters to inform RTD decisions. Conduct studies to understand how to best increase Warfighter use of DoD provided behavioral health care. Extend the Systems Biology Enterprise PTSD biomarker research to identify biomarker differences, based on gender; biomarkers will aid in distinguishing PTSD from frequently co-occurring or co-morbidities i.e. Mild Traumatic Brain Injury and Major Depressive Disorder. Through pre- and post-deployment specimen collection, identify alterations in gastrointestinal and immune response systems signaling PTSD onset. Continue studies to determine if a diet formulated with a blend of omega-3 fatty acids, glutamine, Vitamin D3 and zinc provides enhanced resiliency against psychological stressors and acute head trauma, in a small animal model."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.674"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.674"
                                            },
                                            "Text": {
                                                "val": "Will initiate studies to determine if a diet formulated with a balanced omega-3\/6 fatty acids ratio, glutamine, and antioxidants provides enhanced resiliency against psychological stressors (collaborative effort across task areas). Will compare animal models of PTSD to identify model strengths and weaknesses (biologic changes underlying behavioral response correlation) facilitating optimal matching\/utilization of models to specific research objectives. Will evaluate PTSD diagnostic biomarkers specific to females, will evaluate PTSD disease trajectory (stages\/subtypes) to inform early intervention and treatment selection. Will continue work to evaluate risk and resilience markers for Warfighters including those deploying to non-combat operations. Will document linkages between sleep problems and mission-related mistakes as well as suicide-related thoughts. Will continue to determine the risk and resilience markers for family functioning, specifically, the impact of military community transformation (downsizing and increasing) and deployment on family member health and marital functioning. Will continue to provide resilience training best practices by validating a measure of resilience training utilization and sleep awareness training. Will continue work to deliver a revised Unit Behavioral Health Needs Assessment tool. Will continue to conduct studies to verify whether a computer-based tool can help Warfighters deal with occupational stress and have more positive post-deployment outcomes, to include a reduction in anger symptoms and optimize cognitive flexibility. Will deliver recommendations for implementation of unit-based social fitness training. Will develop measures of leadership behaviors for improving behavioral health, anger and risk-taking in units. Will deliver recommendations for increasing positive attitudes toward behavioral health care. Will provide recommendations for a provider toolkit to assist in return-to-duty decisions. Will continue studies to increase treatment engagement and adherence and determine best model for increasing provider use of evidence-based practices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health & Resilience - Suicide Prevention"
                                    },
                                    "Description": {
                                        "val": "This effort supports methods to identify causative and preventive factors in military suicides."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.979"
                                            },
                                            "Text": {
                                                "val": "Determined risk and protective factors associated with suicide behavior and intent. Determined effective risk assessment and management methods for suicide prevention. Delivered interventions to unit leaders and unit members following suicide events in a combat environment including interventions to manage grief and bereavement, and suicide prevention strategies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.865"
                                            },
                                            "Text": {
                                                "val": "Continue to advance the study from FY15 efforts to determine whether a brief cognitive behavioral intervention can encourage Warfighters to seek treatment. Continue to develop evidence-based guidelines for leaders to manage suicide events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.954"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.954"
                                            },
                                            "Text": {
                                                "val": "Will complete a study examining predictive ability of screening tools. Will continue the effort to deliver guidelines for leaders and complete analyses of study data to begin drafting guidelines on how to best handle suicide events. Will finish data collection and analysis to deliver a short cognitive behavioral intervention to encourage treatment seeking. Will begin work to target key high risk emotional and behavioral transition points to decrease suicide behaviors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health & Resilience - Concussion\/Mild Traumatic Brain Injury (mTBI) Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates methods to detect and treat concussion as well as identify and evaluate the effects of cognitive deficits (decreases in the ability of individuals to acquire knowledge and understanding through thought experience and the senses) in Warfighters during operations. In FY17 the work performed here will be captured in other areas (Concussion\/mTBI Interventions)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.053"
                                            },
                                            "Text": {
                                                "val": "Characterized sleep duration, timing, and continuity on post-concussive symptoms using objective sleep measures. Determined the relative utility of existing neurocognitive tools (computerized tests that assess different aspects of cognitive functioning such as ANAM, DANA, ImPact, AXON and others) for assessment of post-concussive symptoms.  Developed algorithms to predict concussion likelihood based on post-exposure symptoms and brain injury."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.876"
                                            },
                                            "Text": {
                                                "val": "Conduct studies to inform development of a concussion dosimeter (hardware sensor embedded with an injury prediction algorithm) working prototype to predict the likelihood of concussion based on measurements collected with sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Millennium Cohort Research"
                                    },
                                    "Description": {
                                        "val": "This effort supports a long-term study of Warfighters that includes psychological, physical and spiritual impacts of military service throughout their lifetime. The Millennium Cohort and Deployment Health Task area employs prospective epidemiological (study of health-event patterns in a society) surveillance research designed to address mental health and comorbid (multiple concurrent) disorders, including neurological and other chronic degenerative disorders, fitness and readiness performance outcomes, and longer-term physical and mental health illnesses and disease over the life cycle of military Servicemen and women. Funding for this research effort moves from project FH2 to project 869 starting in FY17."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.301"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.301"
                                            },
                                            "Text": {
                                                "val": "Will continue to evaluate the impact of military service on Warfighter and Family physical and psychological health. Specifically, will assess the long-term impact of sexual assault experiences among military men and women. Will assess the long-term health outcomes among individuals with a history of traumatic brain injury. Will examine the Performance Triad components (sleep, diet, and exercise) and association with health outcomes. Will investigate the long-term effects of military service on the risk and prevalence of cardiopulmonary (link between the cardiovascular and respiratory systems) and metabolic diseases (anomalies in the way the body processes food sources to generate energy) and continue work to identify populations with greater likelihood of utilizing Department of Veterans Affairs (VA) health services. Will continue to collect follow-up survey data on participants in the 2017-2018 survey cycle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Systems Engineering Architecture"
                                    },
                                    "Description": {
                                        "val": "This effort will advance medical science in the areas of injury prevention to optimize and performance sustainment. This effort develops bio- mathematical models and networked physiological sensor systems that accurately predict metabolic cost, thermal strain and other negative health impacts to the Warfighter during physical challenges, i.e. during load carriage or operating in extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.446"
                                            },
                                            "Text": {
                                                "val": "Advanced medical S&T in the areas of injury prevention and performance sustainment in the context of human interaction with new Warfighter systems. Provided greater insight into informing new research across the S&T community (medical and non-medical) in development of Warfighter systems and the interactions between Warfighters and the systems they employ. Leveraged the work being done in Physiological Health, Injury Prevention & Reduction, both musculoskeletal (muscle, bone, tendons, and ligaments) and neurosensory, Psychological Health and Resilience and Environmental Health to inform the Warfighter Systems Engineering Architecture initiative."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.126"
                                            },
                                            "Text": {
                                                "val": "Advance medical research in the areas of injury prevention and performance optimization in the context of human interaction with new Warfighter systems and provide greater insight into informing new research across the research and development community (medical and non-medical) in development of optimized Warfighter systems and the interactions between Warfighters and the systems they employ. This effort leverages research conducted in Physiological Health, Injury Prevention & Reduction, both musculoskeletal and neurosensory, (the sensory activity or functions of the nervous system), sensory activity or functions of the nervous system. Psychological Health and Resilience and Environmental Health and Protection to inform the Warfighter Systems Engineering Architecture initiative."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.778"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.778"
                                            },
                                            "Text": {
                                                "val": "Will develop bio-mathematical models and networked physiological sensor systems that accurately predict human metabolism rates, thermal strain and negative health impacts of Warfighters during physical challenges i.e. complex operational scenarios in extreme environments. These medical research tools will help prevent injuries and optimize physiological and cognitive performance of the Warfighter integrated with the new Warfighter systems. Will inform new research across the research and development community (medical and non-medical) in development of optimized systems and the interactions between the Warfighter and the systems they employ. Will leverage research in Physiological Health, Injury Prevention and Reduction, both musculoskeletal and neurosensory, Psychological Health and Resilience and Environmental Health and Protection to inform the Warfighter Systems Engineering Architecture initiative."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "870"
                    },
                    "ProjectTitle": {
                        "val": "Dod Med Def Ag Inf Dis"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.426"
                        },
                        "CurrentYear": {
                            "val": "19.245"
                        },
                        "BudgetYearOne": {
                            "val": "20.478"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.478"
                        },
                        "BudgetYearTwo": {
                            "val": "22.144"
                        },
                        "BudgetYearThree": {
                            "val": "22.624"
                        },
                        "BudgetYearFour": {
                            "val": "23.074"
                        },
                        "BudgetYearFive": {
                            "val": "23.403"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2017 the Drugs to Prevent\/Treat Parasitic Diseases and Vaccines for Prevention of Malaria research areas are merged into Applied Research on drugs and vaccines against parasitic diseases."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research for medical countermeasures to naturally occurring infectious diseases that pose a significant threat to the operational effectiveness of forces deployed outside the United States. Effective preventive countermeasures (protective\/therapeutic drugs and vaccines and insect repellents and traps) protect the Force from disease and sustain operations by avoiding the need for evacuations from the theater of operations. Diseases of military importance are malaria, bacterial diarrhea, and viral diseases (e.g., dengue fever and hantavirus). In addition to countermeasures, this project funds refinement of improved diagnostic tools to facilitate early identification of infectious disease threats in an operational environment, informing Commanders of the need to institute preventive actions and improve medical care. Major goals are to integrate genomics (DNA-based) and proteomics (protein-based) as well as other new biotechnologies into the refinement of new concepts for new vaccine, drug, and diagnostics candidates.\n\nResearch conducted in this project focuses on the following four areas:\n\n(1) Prevention\/Treatment of Parasitic (organisms living in or on another organisms) Diseases\n(2) Bacterial Disease Threats (diseases caused by bacteria)\n(3) Viral Disease Threats (diseases caused by viruses)\n(4) Diagnostic Systems and Vector Identification and Control\n \nFor the refinement of drugs and biological products, studies in the laboratory and in animal models provide a proof-of-concept for these candidate products, including safety, toxicity (degree to which a substance can damage an organism), and effectiveness, and are necessary to provide evidence to the Food and Drug Administration (FDA) to justify approval for a product to enter into future human subject testing. Additional non-clinical studies are often needed in applied research even after candidate products enter into human testing during advanced technology development, usually at the direction of the FDA, to assess potential safety issues. Drug and vaccine refinement bears high technical risk. Of those candidates identified as promising in initial screens, the vast majority are eliminated after additional safety, toxicity, and\/or effectiveness testing. Similarly, vaccine candidates have a high failure rate, because animal testing may not be a good predictor of human response, and therefore candidate technologies\/products are often eliminated after going into human trials. Because of this high failure rate, a continuing effort to identify other potential candidates to sustain a working pipeline of countermeasures is critical for replacing those products that fail in testing.  \n\nWork is managed by the United States Army Medical Research and Materiel Command (USAMRMC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments.   \n\nPromising medical countermeasures identified in this project are further matured under PE 0603002A, project 810.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD, and its overseas laboratories; the U.S. Army Medical Research Institute of Infectious Disease (USAMRIID), Fort Detrick, MD; and the NMRC, Silver Spring, MD, and its overseas laboratories."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Drugs to Prevent\/Treat Parasitic Diseases"
                                    },
                                    "Description": {
                                        "val": "This effort conducts assessments on and improves candidate drugs coming from the DoD discovery program and from other collaborations for prevention and treatment of malaria to counter the continuing spread of drug resistance to current drugs; conducts assessments in animal models of currently available drugs for use against cutaneous leishmaniasis (a skin-based disease transmitted by sand flies); and selects the most effective and safe candidates for continued refinement and possible clinical testing. In FY17 this research area and the Vaccines for Prevention of Malaria research area are merged into one task area titled Parasitic Diseases – Drugs and Vaccines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.299"
                                            },
                                            "Text": {
                                                "val": "Continued to optimize candidate drugs and drug combinations to stay ahead of emerging drug resistance in malaria parasite(s)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.304"
                                            },
                                            "Text": {
                                                "val": "Use small animal and non-human primate testing to down-select lead candidate malaria prophylaxis (measures taken to prevent health problems) drugs based on the Triazine (six-sided ring molecule composed of 3 carbon and 3 nitrogen atoms) class of compounds. Evaluate safety and effectiveness of lead relapse curative drugs (Primaquine and Tafenoquine) in small animal models of malarias (persons getting sick a second time after drug treatment due to re-growth of parasites not eliminated during initial treatment)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vaccines for Prevention of Malaria"
                                    },
                                    "Description": {
                                        "val": "This effort conducts studies to investigate new candidate vaccines for preventing malaria and selects the best candidate(s) for continued refinement.  A highly effective vaccine would reduce or eliminate the use of anti-malarial drugs and would minimize the progression and impact of drug resistance to current\/future drugs. In FY17 this research area and the Drugs to Prevent\/Treat Parasitic Diseases research area are merged into one task area titled Parasitic Diseases – Drugs and Vaccines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.743"
                                            },
                                            "Text": {
                                                "val": "Completed the development of a human challenge model for malaria; volunteers vaccinated with a malaria vaccine candidate were deliberately infected with a malarial parasite through the bite of malaria-infected mosquitoes to assess whether or not the candidate vaccine prevented or delayed malaria infection. Tested individual novel Plasmodium falciparum (causes severe form of malaria) antigens and antigen combinations in small animals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.025"
                                            },
                                            "Text": {
                                                "val": "Assess mechanisms of protective immunity of new malaria protein-based vaccine candidates in small animals. Evaluate immune response of human volunteers successfully protected from infection by weakened sporozoites (infective stage of malaria parasite transmitted by mosquitoes), to discriminate protective from non-protective immune responses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applied Research on drugs and vaccines against parasitic diseases"
                                    },
                                    "Description": {
                                        "val": "This effort assesses and improves on candidate drugs coming from the DoD discovery program and from other collaborations for prevention and treatment of malaria; to counter the continuing spread of drug resistance to current drugs; assesses currently available drugs for use against cutaneous leishmaniasis (a skin-based disease transmitted by sand flies) in animal models; and selects the most effective and safe candidates for continued refinement and possible clinical testing. This effort also conducts studies to investigate new candidate vaccines for preventing malaria and selects the best candidate(s) for continued refinement. A highly effective vaccine would reduce or eliminate the use of anti-malarial drugs and would minimize the progression and impact of drug resistance to current\/future drugs. In FY17 the Drugs to Prevent\/Treat Parasitic Diseases and Vaccines for Prevention of Malaria research areas are merged into Applied Research on drugs and vaccines against parasitic diseases."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.179"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.179"
                                            },
                                            "Text": {
                                                "val": "Will use small animals to further analyze performance of a single lead candidate malaria prophylaxis (measures taken to prevent health problems) drug based on the Triazine (six-sided ring molecule composed of three carbon and three nitrogen atoms) class of compounds from initial three candidates recently evaluated in clinical trials. This initial testing will allow picking one candidate to advance, and then optimize this lead for human use. Will conduct safety testing in validated animal models in order to test reformulated and down selected compound to human trials. Will also begin studies in small animals to assess P. vivax formulated vaccine candidate for human use. Will assess formulation of new protein candidate antigens in collaboration with Glaxo SmithKline RTS,S (also known as Mosquirix (TM)) malarial vaccine platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostic Systems and Vector Identification and Control"
                                    },
                                    "Description": {
                                        "val": "This effort designs and prototypes new medical diagnostic and surveillance tools for the field, focusing on bedside and field-deployable diagnostic systems and refines interventions that protect Warfighters from biting insects such as sand flies (transmit leishmaniasis) and mosquitoes (transmit dengue, Japanese encephalitis, malaria, etc.)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.649"
                                            },
                                            "Text": {
                                                "val": "Researched and developed pathogen specific assays for selected disease causing pathogens to expand the capability of the fielded and commercially available Rapid Human Diagnostic Devices (RHDDs). Refined pathogen detection assays and field test surveillance devices developed to detect pathogens in medically important arthropods (e.g., ticks, mosquitoes and sandflies). Tested new vector repellent compounds\/formulations for application to personal protection measures i.e. uniform treatment or bednets"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.244"
                                            },
                                            "Text": {
                                                "val": "Develop tests to detect arthropod-borne pathogens for use on field deployable detection platform. Develop a multiplex assay (capable of detecting multiple pathogens at the same time). Conduct field evaluations for the rapid surveillance test to detect Chikungunya virus."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.218"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.218"
                                            },
                                            "Text": {
                                                "val": "Will develop multiplexed pathogen detection systems (capable of detecting multiple pathogens at the same time) that are cost effective, sustainable and usable to screen for priority emerging or re-emerging pathogens. These must support broad, routine surveillance programs or be focused on targeted, outbreak investigations to confirm specific pathogens. Will conduct product screening on new or existing RHDD that are FDA-cleared devices or devices intended to be FDA approved for the rapid (2 hours or less) diagnosis of military-relevant infectious diseases. These will be usable at Battalion Aid Station. Will develop new generation of vector repellant and control methods. Will develop spatial repellent efficacy testing protocols and systems that enable testing and development of best candidates for military use. Will develop bite-protection\/resistance testing capability for fabrics treated with repellants."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Threats Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs and laboratory tests new vaccine candidates against hemorrhagic fever viruses, i.e. Dengue Virus, Hantaviruses Lassa fever Virus  and Crimean-Congo hemorrhagic fever virus, and assesses other non-vaccine technologies to protect against hemorrhagic fever viruses. Efforts also include establishing and maintaining of clinical trial sites worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.678"
                                            },
                                            "Text": {
                                                "val": "Identified and maintained vaccine test site infrastructure for evaluation of dengue vaccine candidates in human clinical trials. Assessed vaccination safety and immunogenicity data, applied this data as down selection criteria to identify superior performing vaccine candidates or administration strategies for advancement to testing of hantavirus and dengue vaccine candidates in human volunteers. Tested research strategies to develop novel assays to rapidly measure hantavirus neutralizing antibodies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.241"
                                            },
                                            "Text": {
                                                "val": "Assess host immune responses against dengue virus antigens among experimental vaccine recipients. Expand vaccine test site infrastructure in selected communities at risk for dengue virus exposure. Improve methods for identification and characterization of protective antibodies. Assess immune vaccinated or un-vaccinated and exposure risk factors among human population groups in areas where dengue exposure is historically prevalent. Assess alternative vaccine (e.g. DNA) delivery strategies such as muscle and skin electroporation (introduction of a substance into skin and muscle by electric current), needle-free jet injection for Hantavirus vaccine. Upon success with the DNA vaccine approach, further develop additional DNA vaccines and combination vaccines against viruses-of-interest, e.g. Crimean Congo Hemorrhagic Fever). Continue investigation of DNA vaccines to produce antibody products that could be used as post-exposure prophylactics (given after a subject is exposed to the disease pathogen to prevent further disease progression)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.545"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.545"
                                            },
                                            "Text": {
                                                "val": "Will assess host immune responses against dengue virus antigens among experimental vaccine recipients. Will expand vaccine test site infrastructure in selected communities at risk for dengue virus exposure. Will improve methods for identification and characterization of protective antibodies. Will assess immune vaccinated or un-vaccinated and exposure risk factors among human population groups in areas where dengue exposure is historically prevalent. Will assess alternative vaccine (e.g. DNA) delivery strategies such as muscle and skin electroporation (introduction of a substance into skin and muscle by electric current), needle-free jet injection for Hantavirus vaccine. Upon success with the DNA vaccine approach, will further develop additional DNA vaccines and combination vaccines against viruses-of-interest, e.g. Crimean Congo Hemorrhagic Fever) Will continue investigation of DNA vaccines to produce antibody products that could be used as post-exposure prophylactics (given after a subject is exposed to the disease pathogen to prevent further disease progression)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Threats"
                                    },
                                    "Description": {
                                        "val": "This effort conducts studies to refine bacterial countermeasures, including vaccine candidates, to prevent diarrhea (most commonly caused by enterotoxigenic E. coli, Campylobacter and Shigella), wound infection and scrub typhus (a debilitating mite-borne disease)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.057"
                                            },
                                            "Text": {
                                                "val": "Refined and evaluated vaccine candidates for Shigella and enterotoxigenic E. coli. Studied clinical grade prototype diarrheal disease vaccine candidates for animal testing. Identified and prepare vaccination field trial sites.  Maintain chigger (mite) colony used as the challenge model to evaluate current Scrub typhus vaccine candidates. Identified and characterized mechanisms of antibiotic resistance occurring in scrub typhus infections."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.431"
                                            },
                                            "Text": {
                                                "val": "Down-selection from FY15 vaccine formulations, refine and evaluate vaccine candidates against each of the three major bacterial causes of diarrhea (Shigella, enterotoxigenic E. coli and Campylobacter). Study clinical grade (suitable for injection into human volunteers) diarrheal disease vaccine candidates in small animals for safety and effectiveness. Identify and prepare clinical trial field sites for evaluation of candidate vaccines. Maintain a chigger colony used as the challenge model to evaluate the effectiveness of Scrub typhus vaccine candidates. Study the mechanisms of immune protection to scrub typhus."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.536"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.536"
                                            },
                                            "Text": {
                                                "val": "Will continue to refine and evaluate additional vaccine candidates against Shigella and enterotoxigenic E. coli organisms. Will continue to test these additional diarrheal vaccine candidates in small animals for the assessment of their safety and effectiveness. Will continue to identify and prepare new clinical field sites for evaluation of candidate vaccines. Will continue to maintain core capabilities in scrub typhus research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "874"
                    },
                    "ProjectTitle": {
                        "val": "Cbt Casualty Care Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.394"
                        },
                        "CurrentYear": {
                            "val": "17.005"
                        },
                        "BudgetYearOne": {
                            "val": "10.033"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.033"
                        },
                        "BudgetYearTwo": {
                            "val": "11.598"
                        },
                        "BudgetYearThree": {
                            "val": "9.868"
                        },
                        "BudgetYearFour": {
                            "val": "10.052"
                        },
                        "BudgetYearFive": {
                            "val": "10.380"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2017 the Clinical and Rehabilitative Medicine funding will move to Project ET4."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project refines and assesses concepts, techniques, and materiel that improve survivability and ensure better medical treatment outcomes for Warfighters wounded in combat and other military operations. Combat casualty care research addresses control of severe bleeding, resuscitation and stabilization, predictive indicators and decision aids for life support systems , treatment of burns, and traumatic injuries to hard and soft tissues of the face, mouth, and extremities and traumatic brain injury (TBI). Clinical and rehabilitative medicine research addresses tissue repair and functional restoration including transplant technologies, orthopedic injuries, eye injuries, genitourinary (reproductive and excretory organs) injury, and face trauma. \n\nResearch involves extensive collaboration with multiple academic institutions to refine treatments for combat wounds through Armed Forces Institute of Regenerative Medicine (AFIRM). This project is coordinated with the Military Departments and other government organizations to avoid duplication.\n\nResearch conducted in this project focuses on the following five areas: \n(1) Damage Control Resuscitation \n(2) Combat Trauma Therapies \n(3) Combat Critical Care Engineering \n(4) Clinical and Rehabilitative Medicine (moves to ET4 in FY17) \n(5) Traumatic Brain Injury\n\nAll drugs, biological products, and medical devices are refined in accordance with Food and Drug Administration (FDA) regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.  \n\nPromising efforts identified in this project are further matured under Program Element (PE) 0603002A, Project 840.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork on this project is performed by United States Army Institute of Surgical Research (USAISR), the United States Army Dental Trauma Research Detachment (USADTRD), Joint Base San Antonio, TX; the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; and the AFIRM, at Multiple Institutions across the US. \n\nEfforts in this project support the Soldier Portfolio and the principal areas of Combat Casualty Care and Clinical and Rehabilitative Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and refines knowledge products (such as clinical practice guidelines, manuals, protocols, studies, and media), materials, and systems for control of internal bleeding; minimizing the effects of traumatic blood loss; preserving, storing, and transporting blood and blood products; and resuscitation following trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.568"
                                            },
                                            "Text": {
                                                "val": "Conducted studies to determine effective means to control bleeding when clotting ability is impaired due to trauma. Conducted animal studies into how plasma (fluid component of blood) in combination with other blood products and\/or drugs may stop trauma induced bleeding, reverse blood clotting problems and minimize inflammation. These studies improved Warfighter trauma survival and improve longer term treatment \/ recovery."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.903"
                                            },
                                            "Text": {
                                                "val": "Start animal studies to explore clinical consequences of long-term application of hemorrhage (bleeding) control products and devices. Perform animal studies leveraging FY15 work, evaluating the effectiveness of drug\/blood product \/ fluid combinations in stopping life-threatening bleeding while maximizing the potential survival of tissues surrounding the trauma \/ wound site."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.072"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.072"
                                            },
                                            "Text": {
                                                "val": "As a follow on to the FY16 work, will continue to evaluate consequences of long-term application of hemorrhage control products and devices. Will evaluate novel products and approaches to treat bleeding from chest, abdominal, arm pit, and groin wounds and large, soft tissue wounds. Will assess drugs and key molecular components of blood required to optimize initial pre-hospital low volume hemostatic (acting to arrest bleeding) damage control resuscitation and tissue stabilization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to enhance the ability to diagnose, stabilize, and accelerate wound healing and repair of damaged tissue for casualties with severe wounds to the face, mouth and extremities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.210"
                                            },
                                            "Text": {
                                                "val": "Continued development of anti-biofilm gel (a protein gel that kills colonies of wound-infecting bacteria). Performed studies to determine means to alleviate persistent wound inflammation subsequently preventing tissue destruction and excessive scarring."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.395"
                                            },
                                            "Text": {
                                                "val": "Establish a quantifiable animal model of acutely (sudden onset) inflamed wounds to provide means to evaluate ability of anti-biofilm wound gel developed in FY15 along with novel products to reduce inflammation, preserve normal tissue, and prevent excessive scarring. Start animal wound healing studies using combinations of skin components to evaluate effects on wound contraction and scarring."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.585"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.585"
                                            },
                                            "Text": {
                                                "val": "Will develop and test combined agents (a bacteria-killing protein in combination with a chemical that disperses bacterial colonies) to treat contaminated facial, mouth, and extremity wounds using a quantifiable small animal model of acutely (sudden onset) inflamed wounds. Will perform studies of human, naturally occurring anti-inflammatory agents to treat uncontrolled inflammation harmful to wound healing and skin graft success after burn injury of the face and mouth area."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Critical Care Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort refines diagnostic and therapeutic medical devices as well as associated algorithms, software, and data-processing systems for resuscitation, stabilization, life support, surgical support and preservation of vital organ function that can be applied across the pre-hospital, operational field setting, and initial definitive care facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.329"
                                            },
                                            "Text": {
                                                "val": "Conducted studies to identify the physiological effects of optimizing blood flow returning to the heart, as a fluidless resuscitation strategy. Continued research to optimize algorithms to improve fluid resuscitation, prevent hemorrhagic shock, and to develop decision support algorithms to guide provision of critical care to casualties at point of injury, during transport, and in field hospitals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.993"
                                            },
                                            "Text": {
                                                "val": "Will continued studies from FY15 to identify the physiological effects of optimizing blood flow returning to the heart, as a fluidless resuscitation strategy. Complete development of first generation patient monitors using light-based sensors and integration of blood-loss prediction algorithm. Start retrospective analysis of trauma registry data to define doctrine for telehealth direction of triage and advanced resuscitation efforts by medics, and facilitate clinical practice guideline development supporting the Committee on Tactical Combat Casualty research requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.417"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.417"
                                            },
                                            "Text": {
                                                "val": "Will evaluate an algorithm for prediction of need for life saving interventions in an animal model of burn injury. Will develop a severe injury animal model to evaluate closed loop and automated resuscitation systems (medical devices that automatically provide treatment to the patient based on physiological changes without direct input from care provider). Will model the physiology of extracorporeal life support devices (devices that oxygenate and purify the blood outside of the body) in conjunction with different modes of mechanical ventilation. Will evaluate technologies to reduce preventable deaths from difficult airway management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort conducts laboratory and animal studies to better understand mechanisms of regenerating and restoring traumatically-injured tissues of skin, muscle, nerve, bone tissue, and soft tissue (e.g. skin and muscle, including the genitalia and abdomen) as well as studies regarding ocular (eye) and visual system traumatic injury for the care and treatment of battle-injured casualties. In FY17 tis effort moves to project ET4."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.332"
                                            },
                                            "Text": {
                                                "val": ": Down-selected and further developed drug delivery, diagnostic, tissue repair, and treatment strategies including drugs and stem cell therapies for eye trauma. Based on FY14 work, evaluated candidate strategies for burn and wound-healing bone and soft tissue repair and strategies to repair extremities, craniomaxillofacial, genital, and abdominal regions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.522"
                                            },
                                            "Text": {
                                                "val": "Down-select and develop drug delivery, diagnostic, tissue repair, and treatment strategies including drugs and stem cell therapies for eye trauma to determine the best candidates to advance to safety and efficacy preclinical trials. Evaluate candidate strategies for burn injury, bone and soft tissue repair, and strategies to address injury to the extremities, face, genital, and abdominal regions. Perform studies to determine the applicability of using cell-based therapies (e.g. stem cells) to repair or restore skin, testicular, muscle, and bone tissues and advance lead technologies to preclinical safety and efficacy studies. Will continue studies in animal models of improved life support technologies for treatment of single and multiple organ failure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury (TBI)"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement of drug (includes mature drug technologies; FDA approved for other indications) and therapeutic (i.e. novel use of stem cells or selective brain cooling) strategies to manage TBI resulting from battlefield trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.955"
                                            },
                                            "Text": {
                                                "val": "Continued to screen and evaluate drugs and other treatment strategies (including brain cooling), stem cell constructs, sleep enhancement, and nutraceuticals (products derived from food sources that provide extra health benefits) for treatment of TBI."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.192"
                                            },
                                            "Text": {
                                                "val": "Down-select candidate drugs and other treatment strategies for treatment of TBI. Characterize polytrauma (multiple trauma injuries)\/TBI animal models to develop potential TBI drug treatments. Characterize the brain tissue neuroplasticity (ability of the nervous system to adapt to injury) to enhance and exploit that potential in treatment strategies for greater functional recovery from TBI."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.959"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.959"
                                            },
                                            "Text": {
                                                "val": "Will examine the correlation of neuroplasticity (ability of the nervous system to adapt to injury) markers to changes in neural cell connections and growth during recovery from TBI. Will conduct studies to determine key molecular targets for neural cell protection and brain tissue regeneration following brain injury."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ET4"
                    },
                    "ProjectTitle": {
                        "val": "Appl Resch in Clinical and Rehabilitative Medicine"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "7.273"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.273"
                        },
                        "BudgetYearTwo": {
                            "val": "7.378"
                        },
                        "BudgetYearThree": {
                            "val": "8.948"
                        },
                        "BudgetYearFour": {
                            "val": "9.130"
                        },
                        "BudgetYearFive": {
                            "val": "9.343"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2017 the Clinical and Rehabilitative Medicine funding will move from Project 874 to Project ET4."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project identifies and evaluates drugs, biologics (products derived from living organisms), medical devices, treatments and diagnostics for post-evacuation restorative, regenerative and rehabilitative care, as well as systems for use by field medics and surgeons for ocular trauma. Research focus is on identifying more effective technologies and protocols to treat ocular injury and visual system dysfunction, as well as laboratory and animal studies for regenerating skin, muscle, nerves, vascular and bone tissues for the care and treatment of traumatic injury. This project is being coordinated with the Defense Health Program. Research involves extensive collaboration with multiple academic institutions to refine treatments for combat wounds through Armed Forces Institute of Regenerative Medicine (AFIRM). This project is coordinated with the Military Departments and other government organizations to avoid duplication.\n\nResearch conducted in this project focuses on Clinical and Rehabilitative Medicine.\n\nAll drugs, biological products, and medical devices are refined in accordance with Food and Drug Administration (FDA) regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.  \n\nPromising efforts identified in this project are further matured under Program Element (PE) 0603002A, Project ET5. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork on this project is performed by United States Army Institute of Surgical Research (USAISR), Joint Base San Antonio, TX; and the AFIRM, at Multiple Institutions across the United States."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort conducts laboratory and animal studies for the purpose of regenerating and restoring traumatically-injured tissues, including skin, muscle, nerve, bone tissue, and the ocular system."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.273"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.273"
                                            },
                                            "Text": {
                                                "val": "Will conduct pre-clinical screening, down-selection and further development of drug delivery, diagnostics, tissue repair, and treatment strategies including drugs and stem cell therapies for eye trauma. Will advance therapeutic and treatment strategies for eye injuries to safety and efficacy preclinical trials. Will further evaluate promising candidate strategies for burn injury, bone and soft tissue repair, and therapies that address injury to the extremities, face, genital and abdominal body regions. Will evaluate advanced cell-based therapies (e.g. stem cells) that repair or restore skin, testicular, muscle, and bone tissues in animal models. Will further develop novel immunomodulation (modification of the immune response \/ immune system functioning) technologies and strategies to improve outcomes in hand and face transplant procedures. Will further develop improved vascular technologies that reduce the requirement for vein harvest."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FH2"
                    },
                    "ProjectTitle": {
                        "val": "Force Health Protection - Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.856"
                        },
                        "CurrentYear": {
                            "val": "5.278"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Starting in Fiscal Year (FY) 2017 Project FH2 (Force Health Protection – Applied Research) funding and research efforts will move into Project 869 (Warfighter Health Protection and Performance Standards)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts research to support applied research directed toward the sustainment of a healthy Warfighters from accession through retirement.  This research focuses on enhanced protection of Warfighters against health threats in military operations and training. Stressors that adversely affect individual Warfighter health readiness are identified and studied to refine interventions that will protect Warfighters and improve their health and performance in stressful environments. This is follow-on research that extends and applies findings from over a decade of research on Gulf War Illnesses and other chronic multi-symptom illnesses that have suspected nerve and behavioral alterations caused by environmental contaminants and deployment stressors. Key databases include the Millennium Cohort Study and the Total Army Injury and Health Outcomes Database. These databases allow us to evaluate interactions of psychological stress and other deployment and occupational stressors that affect Warfighter health behaviors.\n\nForce Health Protection applied research is conducted in close coordination with the Department of Veterans Affairs. This project contains no duplication with any effort within the Military Departments and includes direct participation by other Services working on Army projects.\n\nResearch conducted in this project focuses on the following three areas:\n(1) Millennium Cohort Research\n(2) Biomarkers of Exposure and Environmental Biomonitoring\n(3) Physiological Response and Blast and Blunt Trauma Models of Thoracic (Chest) and Pulmonary (Lung) Injuries\n \nPromising efforts identified in this project are further matured under Program Element 0603002A, Project FH4.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.    \n \nWork in this project is performed by the United States Army Center for Environmental Health Research (USACEHR), Fort Detrick, MD; the Naval Health Research Center (NHRC), San Diego, CA; and the United States Army Research Institute of Environmental Medicine (USARIEM), Natick, MA. \n\nEfforts in this project support the Soldier Portfolio and the principal area of Combat Casualty Care."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Millennium Cohort Research"
                                    },
                                    "Description": {
                                        "val": "This effort supports a long-term study of Warfighters that includes psychological, physical and spiritual impacts of military service throughout their lifetime. The Millennium Cohort and Deployment Health Task area employs prospective epidemiological (study of health-event patterns in a society) surveillance research designed to address mental health and comorbid (multiple concurrent) disorders, including neurological and other chronic degenerative disorders, fitness and readiness performance outcomes, and longer-term physical and mental health illnesses and disease over the life cycle of military Warfighters. Funding moved to project 869 in FY17."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.432"
                                            },
                                            "Text": {
                                                "val": "Evaluated the impact of child health on Family functioning and Service Member health outcomes and investigated the impact of the Family's response to deployment on the mental health of the deployed Warfighter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.796"
                                            },
                                            "Text": {
                                                "val": "Continue the FY15 evaluation of the impact of child health on Family functioning and Warfighter health outcomes and investigate the impact of the Family's response to deployment on the mental health of the deployed Service Member. Finalize survey data collection on new and follow-up Millennium Cohort enrollees, and begin the process of detecting, correcting and removing corrupt entries in the survey data (2014-2015 survey cycle). Evaluate long-term functional and physical health of early cohort deployed Service Member. Assess negative coping behaviors such as misuse of alcohol and tobacco use in Warfighter cohorts and likelihood of utilizing Department of Veterans Affairs (VA) health services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physiological Response and Blast and Blunt Trauma Models of Thoracic (Chest) and Pulmonary (Lung) Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports modeling and assessment of the combined effects of blast, impact, and ballistic trauma on the chest and lung system. Funding moved to project 869 in FY17 (Concussion\/Mild Traumatic Brain Injury (mTBI) Interventions)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.424"
                                            },
                                            "Text": {
                                                "val": "Developed models to assess endurance for military relevant tasks including algorithm development to predict musculoskeletal adaptations to fatigue. Expanded biomechanical (application of mechanical principles to living organism) performance modeling to incorporate relevant tasks, such as lifting and marksmanship that use the upper body and core."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.482"
                                            },
                                            "Text": {
                                                "val": "Refine performance models developed in FY15 that assessed endurance for military relevant tasks including algorithm development to predict musculoskeletal adaptations to fatigue. Refine biomechanical performance models developed in FY15, to incorporate military relevant tasks, such as lifting and marksmanship that use the upper body and core."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VB4"
                    },
                    "ProjectTitle": {
                        "val": "System  Biology And Network Science Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.680"
                        },
                        "CurrentYear": {
                            "val": "5.282"
                        },
                        "BudgetYearOne": {
                            "val": "1.918"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.918"
                        },
                        "BudgetYearTwo": {
                            "val": "2.001"
                        },
                        "BudgetYearThree": {
                            "val": "2.010"
                        },
                        "BudgetYearFour": {
                            "val": "2.049"
                        },
                        "BudgetYearFive": {
                            "val": "2.091"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Starting in Fiscal Year (FY) 2017 the toxic substances research efforts and funding will move from Project VB4 (System Biology And Network Science Technology) into Project 869."
                        },
                        "ProjectMissionDescription": {
                            "val": "This projects efforts support biological and clinical applied research using the data analysis and integration grid (SysBioCube) as an overarching means of complex data usage to solve critical health problems. The primary capability of systems biology (field of study that focuses on complex interactions within biological systems, using a holistic approach) is the integration and analysis of complex human and animal study data and development of computational disease models, using global multi-omic methods to identify and discriminate unique combinations of biological molecules corresponding to clinical conditions (physiologic, immunologic, endocrine, etc.), supporting transition of research to clinical applications. This capability applies a systematic integrated approach to trace progression of illnesses and diseases and has already shown that the approach significantly reduces time, funds and effort invested in medical product development and refinement. An application of systems biology is to characterize physiological pathways altered by toxic substances enabling identification of the causative toxic substances as well as to understand the injury mechanisms. The detection\/identification of physiological markers of exposure to toxic substances can then be used to support medical countermeasure decisions or development of targeted therapeutic drugs. \n\nThese examples of more complex, yet integrated approaches to projects studying biological systems (Post-Traumatic Stress Disorder (PTSD) Project) have been shown to reduce both the time and expense of medical product development for the Army\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the United States Army Medical Research and Materiel Command (USAMRMC), Fort Detrick, MD \/ United States Army Center for Environmental Health Research (USACEHR).\n\nEfforts in this project support the Soldier Portfolio and the principal area of Systems Biology\/Network Sciences."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Biology"
                                    },
                                    "Description": {
                                        "val": "The core capability for multidisciplinary applied research in systems biology  enables integration and analysis of complex data from human and animal studies and development of computational network models, allowing researchers to differentiate among molecular signatures (unique combinations of biological molecules corresponding to clinical conditions) of disease, and supports transition of research to clinical applications. Conduct applied research to identify and characterize (the substance itself and how it causes harm) toxic substances, e.g. toxic industrial chemicals. The molecular and physiological markers of intoxication are then applied to support diagnostic tools development of medical countermeasures. Current studies are addressing exposures to industrial chemicals, toxicogenomics (study of what genes are involved with responding to a toxic substance and those genes associated with susceptibility to the toxic substance) of metals, health surveillance with assessment of micro-biome, metabolomics of heat injury, and modeling toxicity pathways. The task funding for the toxic substances research effort moves to project 869 in FY17."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.680"
                                            },
                                            "Text": {
                                                "val": "Designed and utilized new tools to solve problems that arise in the course of extracting signatures (distinctive and unique characteristics of a condition or event) related to suicide, coagulopathy and chronic pain in Warfighters. Evaluated and integrated computer modeling with high-content global molecular data sets from PTSD clinical studies and utilized PTSD animal models to further therapeutic studies \/ Followed the successful pattern of combining clinical trials with animal models, applied this to study coagulopathy and mechanisms of chronic pain. Developed and enhanced capabilities to support transition of research to advanced development by incorporating newly emerging digital Food and Drug Administration (FDA)-approved approaches. Evaluated high-content data sets from environmental exposures using computational platforms to identify biomarkers altered in physiological pathways and developed a panel of biomarkers to evaluate adverse reactions from exposure to environmental health hazards with a focus on toxicity markers of a specific organ system. Verified the pathway(s) (through tissues\/cells) that a toxic substance exerts its effects and validated biomarkers of that effect in the rodent model."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.282"
                                            },
                                            "Text": {
                                                "val": "Improve and apply tools in the SysBioCube (USAMRMC’s information management suite, hosted by the National Cancer Institute (NCI)\/National Institutes of Health (NIH) via the Frederick National Laboratory for Cancer Research (FNLCR)) to begin to define unique molecular patterns \/ signatures related to suicidality (suicidal tendencies), coagulopathy, and chronic pain. Evaluate and model molecular data from PTSD clinical studies to further define signatures within PTSD sufferers into distinct subgroups. Further refine and establish PTSD diagnostic biomarkers, to improve therapeutic drug effectiveness and support therapeutic drug discovery. Use PTSD biomarker in animal models to verify new therapeutic drug targeting. Construct a laboratory developed test (LDT) for PTSD using commercial off-the-shelf technology, and evaluate it in selected medical treatment facilities; continue to advance tests for identification of subgroups of PTSD to aid in informing appropriate therapeutic approaches and pursue FDA approval. Begin the design of tests for future diagnostic capabilities that would permit simultaneous measurement of multiple organ specific biomarkers indicative of exposure to a toxic substance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.918"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.918"
                                            },
                                            "Text": {
                                                "val": "Will continue to expand Systems Biology (SB) scientific efforts and to facilitate collaborative partnerships with Army, Department of Defense (DoD) and extramural laboratories. Will continue overseeing data sharing and data integration activities and continue to expand the SysBioCube capabilities to accommodate usage growth and integration of large, complex data sets. For coagulopathy, will complete the collection of time-course samples from trauma patients and proceed to determine the molecular effects of various clinical treatments to improve (or not) the clinical status. Will conduct data analyses of findings with chronic pain, suicidality, infection and effects of microgravity (functions as a stressor) to integrate with clinical results. Will evaluate nutritional supplements in the mouse model simulating features of PTSD in order to assess improved resolution or recovery. Will integrate clinical and multi-molecular studies of PTSD in humans to confirm a candidate panel(s) to diagnose chronic PTSD for advancement to a LDT which will be confirmed by a commercial lab; will identify three to four DoD clinical sites which will have the facilities to evaluate the LDT as a precursor for moving forward with an FDA product. Will evaluate clinical trials using standard PTSD therapy regimens to determine which aspects of PTSD are improved (or not) and to begin to associate initial status of the patients in order to inform therapeutic strategies ‘personalized’ for the individual’s condition."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}