{
    "id": "d864c52e68e28b10c0ca82433c679ee1adf91712",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603423F"
        },
        "ProgramElementTitle": {
            "val": "Global Positioning System III - Operational Control Segment"
        },
        "R1LineNumber": {
            "val": "110"
        },
        "MdapCode": {
            "val": "456"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "2378.898"
            },
            "PriorYear": {
                "val": "334.631"
            },
            "CurrentYear": {
                "val": "349.181"
            },
            "BudgetYearOne": {
                "val": "393.268"
            },
            "BudgetYearOneBase": {
                "val": "393.268"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "252.530"
            },
            "BudgetYearThree": {
                "val": "232.783"
            },
            "BudgetYearFour": {
                "val": "124.860"
            },
            "BudgetYearFive": {
                "val": "127.073"
            },
            "CostToComplete": {
                "val": "1387.576"
            },
            "TotalCost": {
                "val": "5580.800"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Global Positioning System (GPS) is a space based positioning, navigation and timing distribution system which operates through all weather. GPS supports both civil and military users in air, space, sea and land operations. GPS is a satellite-based radio navigation system that serves military and civil users worldwide. GPS users process satellite signals to determine accurate position, velocity and time. GPS must comply with 10 United States Code (USC) sec 2281 which requires that the Secretary of Defense ensures the continued sustainment and operation of GPS for military and civilian purposes and 51 USC sec 50112, which requires that GPS complies with certain standards and facilitates international cooperation.\n\nThis Program Element (PE) funds the Research & Development (R&D) for the GPS next generation operational control system (OCX) and the GPS Enterprise Integrator (EI). This includes advanced concept development, systems analysis, modernized control segment development, mission planning development, training simulators, integrated logistics support products, test resources, systems engineering required to meet the government's obligations to the international, military and civil communities, and system requirements verification. OCX acquisition was established to 1) provide command and control of legacy and GPS III satellites, 2)  incorporate situational awareness to support Navigation Warfare (NAVWAR) and signal monitoring, 3) enable mission capability upgrades to support a  warfighter effects- based approach to operations and 4) integrate DoD information assurance and cyber security controls and capabilities. GPS Enterprise Integrator is responsible for architecture and system definition (the analysis and definition, management, maintenance, and evolution of the GPS Enterprise requirements and interface technical documents) as well as for the planning, execution, and fielding of the GPS Enterprise.\n\nOCX funds will support efforts such as engineering studies and analyses, architectural engineering studies, trade studies, technology needs forecasting, modernization initiatives, systems engineering, system development, test and evaluation efforts and mission operations. These activities support upgrades and product improvements for military and civil applications necessary to enable efforts to protect U.S. military and Allies' use of GPS. Additionally, funds will ensure OCX efforts meet current and future Joint Requirements Oversight Council-approved required capabilities.\n\nThe GPS Enterprise consists of Space, Ground Control, Nuclear Detonation (NUDET) Detection System (NDS) and User Equipment Segments. The government is responsible for the integration of the GPS Segments such that they provide worldwide GPS capability to support the warfighter and over a billion national security, civil, Allied, and commercial GPS users.\n\nThe GPS Enterprise Integrator project includes the efforts associated with the Government's prime contract tasks necessary to accomplish this critical integrating function with the entire GPS user community. The Enterprise Integrator maintains the GPS current architecture and system definition, controls and validates interfaces, ensures compatibility of Generation II and III systems, and develops\/manages plans for execution and fielding of the GPS Enterprise. Further, the Enterprise Integrator provides modeling, simulation and technical analyses of impacts for Government-directed enterprise-level trades among the GPS segments leading to definition, management, maintenance, and evolution of the GPS Enterprise requirements and interface technical documents to build and ensure the integrity of the enterprise technical baseline, and perform system requirements verification.\n\nIn addition, the GPS Enterprise Integrator project funds the technical evolution, risk reduction, enterprise-level testing and delivery of all GPS Enterprise capabilities. Examples for Generation II include electronic protection and additional civil signals; for Generation III, additional anti-jamming protection. To accomplish this, the GPS Enterprise Integrator delivers Test and Verification capabilities, Requirements and Interface Management, and Systems Integration support across the Space, Control, and User Segments. In this capacity, the Enterprise Integrator is responsible for managing this cross-program work to provide these and other capabilities.\n\nGPS Enterprise Integrator's analyses guide government decisions to ensure efficient and effective synchronization and execution across all Generation II and III GPS programs. For Enterprise-wide integration to be successful, the Integrator: works with the GPS and NDS prime contractor teams to develop plans for early risk reduction System Integration Demonstrations to ensure system interfaces and functionality meet user and system requirements; ensures all equipment and documentation is ready when needed; integrates and analyzes enterprise schedules; and conducts formal test and verification, including Requirement Verification Plans and System Test Plans and Procedures. GPS Enterprise Integrator performs all these efforts across all GPS programs in all acquisition phases. The government owns the Enterprise system requirements and integration, and highly leverages the Enterprise Integrator team to eliminate the need to fund a development prime contractor to perform these functions. This enhances government control, oversight and program accountability.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that were fielded or received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "299.060"
                },
                "CurrentYear": {
                    "val": "350.232"
                },
                "BudgetYearOne": {
                    "val": "222.288"
                },
                "BudgetYearOneBase": {
                    "val": "222.288"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "334.631"
                },
                "CurrentYear": {
                    "val": "349.181"
                },
                "BudgetYearOne": {
                    "val": "393.268"
                },
                "BudgetYearOneBase": {
                    "val": "393.268"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "35.571"
                },
                "CurrentYear": {
                    "val": "-1.051"
                },
                "BudgetYearOne": {
                    "val": "170.980"
                },
                "BudgetYearOneBase": {
                    "val": "170.980"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-1.051"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "35.571"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "170.980"
                                },
                                "BudgetYearOneBase": {
                                    "val": "170.980"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY15: +$35.571 Above Threshold Reprogramming (ATR) for OCX overrun\nFY17: +$170.980M to fund OCX to the Service Cost Position (SCP)"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "67A021"
                    },
                    "ProjectTitle": {
                        "val": "OCX"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2276.545"
                        },
                        "PriorYear": {
                            "val": "278.552"
                        },
                        "CurrentYear": {
                            "val": "288.125"
                        },
                        "BudgetYearOne": {
                            "val": "331.362"
                        },
                        "BudgetYearOneBase": {
                            "val": "331.362"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "189.417"
                        },
                        "BudgetYearThree": {
                            "val": "168.477"
                        },
                        "BudgetYearFour": {
                            "val": "74.453"
                        },
                        "BudgetYearFive": {
                            "val": "75.772"
                        },
                        "CostToComplete": {
                            "val": "1131.744"
                        },
                        "TotalCost": {
                            "val": "4814.447"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Global Positioning System (GPS) is a space based positioning, navigation and timing distribution system which operates through all weather. This project funds the research and development for the GPS next generation operational control system (OCX). This includes, but is not limited to, advanced concept development, systems engineering and analysis, modernized control segment and mission planning, development, training simulators, integrated logistics support products, and test resources.\n\nOCX acquisition was established to 1) provide command and control of legacy and GPS III satellites, 2) incorporate situational awareness to support Navigation Warfare (NAVWAR) and signal monitoring, 3) enable mission capability upgrades to support a warfighter effects-based approach to operations, and 4) integrate DoD information assurance and cyber security controls and capabilities. OCX funds will support efforts such as engineering studies and analyses, architectural engineering studies, trade studies, technology needs forecasting, technology development, systems engineering, system development, test and evaluation efforts and mission operations in support of upgrades and product improvements for military and civil applications necessary to support efforts to protect U.S. military and Allies' use of GPS. Additionally, funds will ensure efforts to meet current and future Joint Requirements Oversight Council (JROC) approved required capabilities.\n\nOCX Block 0 (through Iteration 1.5) is the Launch and Control System (LCS) intended to conduct Launch and Early Orbit (LEO) operations and the on-orbit checkout of all GPS III satellites. OCX Block 0 is a subset of OCX Block 1.\n\nOCX Block 1 (adds Iterations 1.6, 1.7 and 2.1 to Block 0) fields the operational capability to control all legacy satellites and civil signals (L1C\/A), military signals (L1P(Y), L2P(Y)) as well as the GPS III satellites and the modernized civil signal (L2C) and the aviation safety-of-flight signal (L5). In addition, Block 1 will field the basic operational capability to control the modernized military signals (L1M and L2M (M-Code)), and the globally compatible signal (L1C). It also fully meets information assurance\/cyber defense requirements.\n\nOCX Block 2 (adds Iteration 2.2 to Block 1) fields the advanced operational capability to control the advanced features of the modernized military signals (L1M and L2M (M-Code))."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "OCX Development"
                                    },
                                    "Description": {
                                        "val": "Development of the GPS next generation operational control system to launch GPS III and operate a mixed GPS II and GPS III constellation and provide for a robust Information Assurance system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "262.298"
                                            },
                                            "Text": {
                                                "val": "Continued preparation and dry runs for qualification testing on OCX Block 0. Completed Iteration 1.6 Block 1 segment-level systems engineering for the command and control of GPS II satellites, legacy signals, and modernized signals. Conducted Iteration 1.6 Critical Design Review (CDR). Continued systems engineering for Iterations 1.7, 2.1 (Block 1), and 2.2 (Block 2)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "250.991"
                                            },
                                            "Text": {
                                                "val": "Conduct factory and site acceptance testing, receive approval to operate and connect, and certify & accept OCX Block 0 for launch and checkout operations of GPS III satellites. Continue Iteration 1.5 (Block 1) risk reduction testing, Iteration 1.6 (Block 1) software development and integration activities.  Conduct Iteration 1.6 Delta CDRs, and conduct qualification testing and production for OCX Monitor Station Receiver Element (OMSRE). Continue development of the remaining modernized civil and military signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "287.962"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "287.962"
                                            },
                                            "Text": {
                                                "val": "FY17 Funding to the Service Cost Position (SCP) will allow the program to complete Iteration 1.6 software development, integration and testing, and begin Iteration 1.7 and 2.1 software development and integration activities. Complete qualification testing for system simulator and begin accreditation process. Ship, install, receive interim authority to test, and integrate the monitoring stations equipment and OMSRE. Begin final testing and integration activities for all of Block 1. Begin Iteration 2.2 (Block 2) systems engineering. Continue security certification activities leading to Authority to Operate (ATO)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical Support"
                                    },
                                    "Description": {
                                        "val": "Development of the Standardized Space Trainer (SST) to provide GPS III operator training. Development of Enterprise Mission Planning Systems. Facilities upgrades for Control Stations and associated equipment and servers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.254"
                                            },
                                            "Text": {
                                                "val": "Continued work on the SST and developed demonstration capabilities; continued development of Enterprise Mission Planning Systems. Continued work on the facility upgrades to include the Master Control Station (MCS), Alternate Master Control Station (AMCS), and remote monitor station sites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.134"
                                            },
                                            "Text": {
                                                "val": "Continue work on the SST and develop demonstration capabilities; continue development of Enterprise Mission Planning Systems. Continue work and begin fielding to facilities to include the MCS, AMCS, sustainment assets and remote monitor station sites."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "43.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "43.400"
                                            },
                                            "Text": {
                                                "val": "Continue work on the SST and develop demonstration capabilities; continue development of Enterprise Mission Planning Systems. Continue work on the facility upgrades to include the MCS, AMCS, and remote monitor station sites."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA07: PE 0305265F"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "204.864"
                                        },
                                        "CurrentYear": {
                                            "val": "180.359"
                                        },
                                        "BudgetYearOne": {
                                            "val": "141.888"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "141.888"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "110.860"
                                        },
                                        "BudgetYearThree": {
                                            "val": "43.561"
                                        },
                                        "BudgetYearFour": {
                                            "val": "78.866"
                                        },
                                        "BudgetYearFive": {
                                            "val": "80.265"
                                        },
                                        "CostToComplete": {
                                            "val": "464.191"
                                        },
                                        "TotalCost": {
                                            "val": "1304.854"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MPAF: BA05: Line Item # GPS III"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "312.326"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "312.326"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPAF: BA01: Line Item # GPSIII"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "199.218"
                                        },
                                        "BudgetYearOne": {
                                            "val": "34.059"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "34.059"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "761.515"
                                        },
                                        "BudgetYearThree": {
                                            "val": "899.241"
                                        },
                                        "BudgetYearFour": {
                                            "val": "761.565"
                                        },
                                        "BudgetYearFive": {
                                            "val": "554.763"
                                        },
                                        "CostToComplete": {
                                            "val": "3737.790"
                                        },
                                        "TotalCost": {
                                            "val": "6948.151"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DOT"
                                    },
                                    "Title": {
                                        "val": "DOT (FAA) Civil Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.000"
                                        },
                                        "CurrentYear": {
                                            "val": "8.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.100"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.100"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "33.100"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "DOT (FAA) funding in FY 2016 - 2018 is TBD. $25.1M is required."
                        },
                        "AcquisitionStrategy": {
                            "val": "The Air Force is pursuing a \"Block\" approach to the next generation GPS control segment (OCX) to respond to warfighter capability requirements.  The strategy calls for capability (e.g., better signal maintainability, Unified S-Band (USB), Search and Rescue (SAR) GPS, and near-real time C2) on-ramps for the follow-on contract for GPS III SVs (starting no earlier than SV11) which will require updates to the OCX ground segment. Enterprise studies will ensure GPS Enterprise synchronization across space and ground segments."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Phase B OCX Block 1 & 2 Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aurora, CO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1672.117"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "236.428"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "226.834"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "259.830"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "259.830"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1267.897"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3663.106"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2911.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Technical Mission Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.063"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.734"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "14.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "14.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "73.320"
                                                    },
                                                    "TotalCost": {
                                                        "val": "104.217"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Enterprise SE&I"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "39.349"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.391"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "15.600"
                                                    },
                                                    "TotalCost": {
                                                        "val": "68.040"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Modernization\/SE & Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "53.028"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.119"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "17.550"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "17.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "17.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "89.440"
                                                    },
                                                    "TotalCost": {
                                                        "val": "182.337"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX AMCS Facility Dev"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.300"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.072"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.850"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.120"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.942"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Standard Space Trainer (SST)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sonalyst, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Waterford, CT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.500"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "26.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "47.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Enterprise Mission Planning"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton Eng Services"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "33.800"
                                                    },
                                                    "TotalCost": {
                                                        "val": "50.300"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Phase A Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "289.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "289.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS OCX T&E"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.600"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.103"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.730"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.730"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.796"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.229"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS OCX FFRDC 1"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "101.975"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.710"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.221"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "32.240"
                                                    },
                                                    "TotalCost": {
                                                        "val": "156.346"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX FFRDC 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.690"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.145"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.536"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.552"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.552"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.870"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.793"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX FFRDC 3"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SEI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pittsburgh, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.030"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.030"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "95.956"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.456"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "17.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "17.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "89.440"
                                                    },
                                                    "TotalCost": {
                                                        "val": "220.202"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.165"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.450"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.450"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.450"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.340"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.405"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Program Replan:  Schedule to change"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SV01 Launch (LCS support)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Monitor Station \/Legacy Ground Antenna Installs"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GPS System Simulator (GSYS) CIQT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Iteration 1.7 Incremental CDR (Include Iteration 1.6 CDR and update dates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Iteration 2.1 Incremental CDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GSYS Factory Qualification Test (FQT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GSYS Accreditation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Iteration 1.7\/2.1 FQT TRR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OCX Blocks 1 & 2 MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OCX Block 1 RTO"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67A025"
                    },
                    "ProjectTitle": {
                        "val": "GPS Enterprise Integrator"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "102.353"
                        },
                        "PriorYear": {
                            "val": "56.079"
                        },
                        "CurrentYear": {
                            "val": "61.056"
                        },
                        "BudgetYearOne": {
                            "val": "61.906"
                        },
                        "BudgetYearOneBase": {
                            "val": "61.906"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "63.113"
                        },
                        "BudgetYearThree": {
                            "val": "64.306"
                        },
                        "BudgetYearFour": {
                            "val": "50.407"
                        },
                        "BudgetYearFive": {
                            "val": "51.301"
                        },
                        "CostToComplete": {
                            "val": "255.832"
                        },
                        "TotalCost": {
                            "val": "766.353"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Global Positioning System (GPS) Enterprise Integrator (EI) integrates, synchronizes, tests and verifies the four ACAT I Defense Acquisition Programs that constitute the GPS Enterprise to deliver reliable Positioning, Navigation, and Timing signal capability to military operators, the civil user community, and international partners. The Government Program Office owns and approves the technical baseline and is responsible for the successful fielding of all the GPS Segments. To successfully execute its responsibilities, the Government relies upon the specific expertise of the GPS Enterprise Integrator to integrate segment products and verify that system requirements are met.\n\nThe GPS Enterprise Integrator project is responsible for the development and management of the Enterprise technical baseline. The technical baseline consists of more than 6400 specifications and 330 interface documents. The technical baseline reflects the requirements of multiple stakeholder groups such as the Department of Defense (DoD), foreign governments and allies, industry, the general public (through four Interface specifications), and ensures GPS capabilities meet the needs\nof warfighters, civil agencies, commercial entities, international treaties, and over four billion global GPS users. The Enterprise Integrator manages the process through which the JROC requirements are matured and flowed down to the segments of the system and that interfaces are clearly defined. This enables the GPS system to meet Title 10 of the U.S. Code, Section 2281, mandated GPS capabilities as well as obligations to the international community and allied nations to provide inter-operable PNT signals. The Enterprise Integrator is also responsible for all aspects of schedule and technical alignment across the segments. The Enterprise Integrator creates and manages plans that provide for early exercise of the products under development, compatibility analysis, and intersegment testing thereby reducing risk. The intersegment tests are required to prove the interoperability of OCX, GPS III, and modernized user equipment. The Enterprise Integrator's test efforts also extend to validating that GPS can be used for civil aircraft navigation.\n\nThe Enterprise Integrator activity supports the Government Program Office's GPS spectrum protection at international forums such as the International Telecommunications Union, assisting the United States when negotiating with foreign partners. In addition, the Enterprise Integrator provides technical expertise and continuity for maintaining relationships with other U.S. government agencies to include the FAA, NGA, NASA, as well as the Departments of State, Transportation, Homeland Security, and Commerce. Spectrum expertise from the Enterprise Integrator ensures GPS priority over eight essential spectrum signals such as the safety of life signal, L5, which is required for civil air navigation. Spectrum Protection prevents encroachment from commercial or foreign entities, which preserves reliable signals to warfighters and civil users, ensuring military operations and the integrity of the global economic infrastructure. The Enterprise Integrator is the GPS enterprise expert for Information Assurance (IA), Cyber Security, System Safety, and System Security, ultimately ensuring a protected GPS Signal for both the military and civil users from emerging cyber threats. The Enterprise Integrator is accountable for the development, execution, and analysis of OCX cyber security and IA test cases, which are necessary to deliver a secure, operational system, protected against adversarial cyber-attacks intended to deny, disrupt, or degrade GPS operations.\n\nThe Enterprise Integrator supports the Government development and implementation of various Systems engineering documents, defines the methods of verification,conducts the analyses or tests, and assists the government in leading Integrated System Tests. The Enterprise Integrator validates the system performance in various mission threat scenarios during its development. The Enterprise Integrator provides deep, technical, highly specific expertise. The GPS EI functions enhance government control, oversight and program accountability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GPS Enterprise Integrator"
                                    },
                                    "Description": {
                                        "val": "The integration and technical baseline control of all elements of the GPS system (space\/ground\/user equipment) with one another in support of both military and civil users. Execute four major integration exercises, multiple mini-exercises, and five rehearsals between space and ground leading up to the launch of GPS III SV-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "56.079"
                                            },
                                            "Text": {
                                                "val": "Conducted a series of mini integration exercise events, which concluded the 'exercise' portion of readiness for launch. Performed SV01 verification tests and began Launch and Checkout Capability\/System (LCC\/LCS) Enterprise Assessments. Conducted multiple systems integration risk reduction demos. Initiated Integrated System Test (IST) 3-3 testing (Phases 0-2) for MGUE verification. Completed GPS Enterprise End-to-End Validation (GENEVA) model. Started developing Selective Availability Anti-Spoofing Module (SAASM) Mission Planning System (SMPS) V5 and Architecture Evolution Plan (AEP)\/Modernized Navigation(MODNAV) in support of M-Code Available for Use milestone."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "61.056"
                                            },
                                            "Text": {
                                                "val": "Continue IST 3-3 Phase 1 MGUE verification tests. Initiate IST 3-3 Phase 2 MGUE Field Test and IST 3-3 Phase 3. Conduct launch and early orbit operation rehearsals on the delivered system between ground and space segment in support of SV01 launch. Continue LCC\/LCS Enterprise Assessments. Conduct multiple system integration demos. Support SV01 FCA\/PCA. Continue developing Selective Availability Anti-Spoofing Module (SAASM) Mission Planning System (SMPS) V5 and AEP\/MODNAV in support of M-Code Available for Use milestone."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "61.906"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "61.906"
                                            },
                                            "Text": {
                                                "val": "Complete IST 3-3 Phase 3 MGUE verification tests. Initiate GPS III end to end testing with GPS III, LCS, and MGUE lead platform. Conduct launch and early orbit operation rehearsals on the delivered system between ground and space segment in support of SV01 launch. Initiate M-Code Available Operational Test through AEP MODNAV. Complete SMPS V5c PDR and SMPS V5b install."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA04: PE 0305164F"
                                    },
                                    "Title": {
                                        "val": "NAVSTAR Global Positioning System (User Equipment) (Space)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "152.144"
                                        },
                                        "CurrentYear": {
                                            "val": "141.861"
                                        },
                                        "BudgetYearOne": {
                                            "val": "278.147"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "278.147"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "235.790"
                                        },
                                        "BudgetYearThree": {
                                            "val": "188.750"
                                        },
                                        "BudgetYearFour": {
                                            "val": "170.937"
                                        },
                                        "BudgetYearFive": {
                                            "val": "173.989"
                                        },
                                        "CostToComplete": {
                                            "val": "247.888"
                                        },
                                        "TotalCost": {
                                            "val": "1589.506"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA07: PE 0305265F"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "204.864"
                                        },
                                        "CurrentYear": {
                                            "val": "180.359"
                                        },
                                        "BudgetYearOne": {
                                            "val": "141.888"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "141.888"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "110.860"
                                        },
                                        "BudgetYearThree": {
                                            "val": "43.561"
                                        },
                                        "BudgetYearFour": {
                                            "val": "78.866"
                                        },
                                        "BudgetYearFive": {
                                            "val": "80.265"
                                        },
                                        "CostToComplete": {
                                            "val": "464.191"
                                        },
                                        "TotalCost": {
                                            "val": "1304.854"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA07: PE 0305913F"
                                    },
                                    "Title": {
                                        "val": "NUDET Detection System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.405"
                                        },
                                        "CurrentYear": {
                                            "val": "14.403"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.093"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.093"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "31.418"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.919"
                                        },
                                        "BudgetYearFour": {
                                            "val": "17.093"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.268"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MPAF: BA05: Line Item # MGPS00"
                                    },
                                    "Title": {
                                        "val": "Global Positioning System (Space)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "52.959"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "52.959"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPAF: BA01: Line Item # MGPS00"
                                    },
                                    "Title": {
                                        "val": "Global Positioning System (Space"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "64.135"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.171"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.171"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "77.306"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MPAF: BA05: Line Item # GPS III"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "312.326"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "312.326"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPAF: BA01: Line Item # GPSIII"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "199.118"
                                        },
                                        "BudgetYearOne": {
                                            "val": "34.059"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "34.059"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "761.515"
                                        },
                                        "BudgetYearThree": {
                                            "val": "899.241"
                                        },
                                        "BudgetYearFour": {
                                            "val": "761.565"
                                        },
                                        "BudgetYearFive": {
                                            "val": "554.763"
                                        },
                                        "CostToComplete": {
                                            "val": "3738.790"
                                        },
                                        "TotalCost": {
                                            "val": "6949.051"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In accordance with a \"back to basics\" acquisition approach and exercise of strong oversight of development contractors, the Air Force is required to exercise complete ownership of the architecture, system definition, and integration of the GPS space, ground, and user segments. This complex inter-segment integration is traditionally performed by a prime contractor under a systems development contract. To eliminate the need to fund a development prime contractor to perform these functions,\nthe government leverages systems engineering and integration expertise from both Federally Funded Research and Development Center (FFRDC) contractors and a Systems Engineering & Integration (SE&I) contractor. GPS Enterprise Integrator function of the SE&I contractor is currently funded within this Program Element (PE). The SE&I effort was originally procured in 2007 through a full and open competition, as was the new follow-on SE&I contract awarded in 2015. The SE&I follow-on strategy builds in year over year cost reductions as requirements stabilize."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS EI Enterprise SE&I"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "65.375"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "31.772"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "19.450"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "17.838"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "17.838"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "152.132"
                                                    },
                                                    "TotalCost": {
                                                        "val": "286.567"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Technical Mission Analysis 1"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.135"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.020"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.536"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.536"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "94.595"
                                                    },
                                                    "TotalCost": {
                                                        "val": "143.486"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Technical Mission Analysis  2"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.341"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.968"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.975"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.412"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.412"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "77.178"
                                                    },
                                                    "TotalCost": {
                                                        "val": "121.874"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI MRTA\/MSTA"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Draper  Labs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cambridge, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.025"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.345"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.345"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "14.214"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.584"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Enterprise Mission Planning"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.320"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.320"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.320"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "10.824"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.464"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Cybersecurity"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.550"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.550"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "78.310"
                                                    },
                                                    "TotalCost": {
                                                        "val": "97.010"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Additonal Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.556"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.857"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.570"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.570"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "21.074"
                                                    },
                                                    "TotalCost": {
                                                        "val": "28.057"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS EI FFRDC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.178"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.155"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.155"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.271"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.604"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.502"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.236"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.631"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.910"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.910"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "33.147"
                                                    },
                                                    "TotalCost": {
                                                        "val": "47.426"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.527"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.270"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.270"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.270"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.214"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.281"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Specifications and ICDs for GPS III Space Modernization Initiative Technical Baseline"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IST 3-3\/MGUE Verification Testing (Phase I)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IST 3-3\/MGUE Verification Testing (Phase II)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IST 3-3\/MGUE Verification Testing (Phase III)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IST 3-3\/MGUE Verification Testing (Phase IV)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GPS III SV01 Available for Launch"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GPS III SV02 Available for Launch"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Support OCX Block 1 Ready to Transition to Operations (RTO)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Support OCX Blocks 1 & 2 Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}