{
    "id": "da093ff650534423e72731a061e1b7cfe9fe2a2e",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603601F"
        },
        "ProgramElementTitle": {
            "val": "Conventional Weapons Technology"
        },
        "R1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "41.385"
            },
            "CurrentYear": {
                "val": "43.036"
            },
            "BudgetYearOne": {
                "val": "102.009"
            },
            "BudgetYearOneBase": {
                "val": "102.009"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "155.804"
            },
            "BudgetYearThree": {
                "val": "180.370"
            },
            "BudgetYearFour": {
                "val": "259.366"
            },
            "BudgetYearFive": {
                "val": "204.802"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops, integrates, and demonstrates advanced ordnance and guidance technologies for air-launched conventional weapons.  The program focuses on conventional ordnance component technologies such as warheads, fuzes, and explosives, as well as munition guidance component technologies such as navigation and control systems and seekers.  Technologies to be developed, demonstrated, and integrated into system concepts will address blast, fragmentation, penetration, low-collateral damage, variable depth\/location fuzing, precise guidance, and high performance and insensitive explosives.  This program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and integration of these subsystems and components into system concepts for field experiments and\/or tests in a simulated environment.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "42.046"
                },
                "CurrentYear": {
                    "val": "48.536"
                },
                "BudgetYearOne": {
                    "val": "45.401"
                },
                "BudgetYearOneBase": {
                    "val": "45.401"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "41.385"
                },
                "CurrentYear": {
                    "val": "43.036"
                },
                "BudgetYearOne": {
                    "val": "102.009"
                },
                "BudgetYearOneBase": {
                    "val": "102.009"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.661"
                },
                "CurrentYear": {
                    "val": "-5.500"
                },
                "BudgetYearOne": {
                    "val": "56.608"
                },
                "BudgetYearOneBase": {
                    "val": "56.608"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-5.500"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.025"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.686"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "56.608"
                                },
                                "BudgetYearOneBase": {
                                    "val": "56.608"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2016 due to Congressional Directed Reduction for improving funds management: forward financing.\n\nIncrease in FY 2017 due to increased emphasis on distributed fuzing technologies, long range strike weapon technology demonstrations, and missile technology demonstrations."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "63670A"
                    },
                    "ProjectTitle": {
                        "val": "Weapon Technology Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.385"
                        },
                        "CurrentYear": {
                            "val": "43.036"
                        },
                        "BudgetYearOne": {
                            "val": "60.509"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.509"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "74.604"
                        },
                        "BudgetYearThree": {
                            "val": "76.470"
                        },
                        "BudgetYearFour": {
                            "val": "47.366"
                        },
                        "BudgetYearFive": {
                            "val": "53.002"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, matures, assesses, and demonstrates advanced\/innovative ordnance and guidance component and subsystem technologies for air-launched conventional weapons.  The project focuses on maturation of advanced explosives, fuzes, warheads, submunitions, and weapon airframes, carriage and dispensing;  as well as innovative munition seekers, weapon aerodynamics, navigation and control, and guidance subsystem integration\/simulation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ordnance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced ordnance technologies for conventional, air-delivered munitions.  Specific technical areas of focus include fuzes, energetic materials, and warheads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.418"
                                            },
                                            "Text": {
                                                "val": "Demonstrated precision height-of-burst technologies for tailored fragmentation thereby limiting collateral damage.  Quantified lethality through near field barriers, i.e., within a flight vehicle for fragmenting weapons.  Developed embedded fuze components to withstand the shock occurring as a result of weapon impact into hardened targets.  Developed and assessed ordnance technologies that enable high-speed strike weapon concepts.  Designed innovative compartmented weapon to allow directional control of weapon fragments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.252"
                                            },
                                            "Text": {
                                                "val": "Continue to mature alternate fuzing technologies to increase the reliability of penetrating weapons.  Continue to develop and assess ordnance technologies that enable high-speed strike weapon concepts.  Develop ordnance technologies that enable general purpose warheads that are lethal across an ever increasing spectrum of targets with the aim of a simplified family of warheads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.000"
                                            },
                                            "Text": {
                                                "val": "Increase emphasis in maturing distributed fuzing concepts for close-controlled strike, area attack, and penetration applications, including assessing long term safety, survivability and functionality over time.  Continue to advance ordnance technologies to allow tailored lethality by controlling weapon fragmentation.  Increase emphasis in developing and demonstrating ordnance technologies that enable high-speed strike weapon concepts.  Develop test capabilities and analysis tools to evaluate ordnance technologies in relevant environments.  Develop ordnance technologies for survivability at high speed impacts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guidance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop guidance technologies to improve the precision, controlled lethality and flexibility of conventional, air-delivered munitions.  Specific technical areas include precision navigation and terminal seekers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.956"
                                            },
                                            "Text": {
                                                "val": "Completed the initial trade study for low cost non-gimbaled seeker for agile engagements of platform threats.  Conducted wind tunnel testing to characterize propulsion systems for next generation air-to-air weapons.  Applied new in-house developed aero- and structural-thermal tools to high speed conceptual weapon design and assessment.  Built government-industry consortium and created beta architecture for open design of weapons that will allow software defined weapons, rapid tech refresh of weapons, and increased innovation.  Developed the preliminary concept, interface definition, and performance specifications for a tri-mode scene generation capability which will support the design, development, and analysis of advanced weapon concepts in representative environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.051"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and assess technologies capable of guiding a high-speed strike weapon characterized by very high terminal speed and high end-game maneuverability.  Continue to explore alternative guidance and control concepts that enable an improved air-to-air missile.  Continue design and development of seeker subsystem prototypes for platform self-defense."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.509"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.509"
                                            },
                                            "Text": {
                                                "val": "Conduct wind-tunnel and limited flight experiments to characterize air-to-air guidance and control.  Increase emphasis on integrated hardware and software-in-the-loop demonstrations of high speed weapon technologies.  Increase emphasis in developing advanced modular and service oriented weapon architectures.  Continue design and development of seeker subsystem prototypes for platform self-defense.  Develop projector and common scene generator technologies for design, development, and analysis of advanced weapon concepts in representative environments for assets networked and operating in future battle spaces.  Develop technologies for precision navigation of weapons."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Munition Concept Technologies"
                                    },
                                    "Description": {
                                        "val": "Demonstrate advanced conventional munitions concepts.  These innovative concepts integrate ordnance, guidance, and carriage and release technologies to demonstrate warfighter capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.011"
                                            },
                                            "Text": {
                                                "val": "Conducted System Requirements Reviews for the demonstration of hypersonic airbreathing and boost-glide weapon concepts.  Updated Modeling, Simulation and Analysis tools for guidance, control, and endgame maneuver in hypersonic flight regimes.  Developed innovative warhead concepts for hypersonic airframes and initiated structural and lethality analyses.  Continued development of concepts for cooperative control of small weapons to increase the capacity and capability of fifth-generation aircraft.  Began development of a simulation test bed to validate Open System Architecture interfaces and system designs.  Created high-fidelity network simulation for an affordable, compact, and secure weapon data link.  Initiated development of testbed for experimentation with cooperative control algorithms.  Tested additively manufactured steel fragment flexible weapon warhead liners and warheads to evaluate improvements in fragmentation lethality.  Completed analysis (engagement, mission, and campaign-level, as well as lethality, survivability, and logistics) to inform technology development of small weapons concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.733"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct relevant long range strike weapon technology demonstration to reduce risk for a potential follow on acquisition program.  Continue the development of a munition concept to incorporate technologies for carriage and terminal impact at high speed.  Continue investigating concepts for cooperative control of small weapons to produce scalable effects to increase the capacity and capability of  fifth generation aircraft.  Continue to demonstrate the ability to articulate the trades and synergies of kinetic energy and directed energy weapons by incorporating higher fidelity methodologies into systems level analysis, including joint weapons effectiveness.  Demonstrate weapon integration concept for air target engagement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2017 and beyond, work accomplished under this effort will be reported in Project 63670B,  Weapon Concept Development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63670B"
                    },
                    "ProjectTitle": {
                        "val": "Weapon Concept Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "41.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.500"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "81.200"
                        },
                        "BudgetYearThree": {
                            "val": "103.900"
                        },
                        "BudgetYearFour": {
                            "val": "212.000"
                        },
                        "BudgetYearFive": {
                            "val": "151.800"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Starting in FY 2017, Project 63670B, Weapon Concept Development, was created and activities were re-aligned from Project 63670A, Conventional Weapons Development, under the effort, Advanced Munition Concept Technologies.  In order to further focus this new Project, two efforts were created under it: Air-to-Air Concept Development and Air-to-Ground Concept Development.  This project will develop, refine, and integrate ordnance and guidance technologies into demonstrations to reduce risk for potential air-launched conventional weapons acquisitions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air-to-Air Concept Development"
                                    },
                                    "Description": {
                                        "val": "Mature, integrate, and demonstrate air-to-air weapon components and systems (ordnance, guidance, and carriage and release technologies) to demonstrate warfighter capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed under Project 63670A, Weapon Technology Development, in the effort, Advanced Munition Concept Technologies.\n\nContinue to demonstrate weapon integration concept for air target engagement.  Continue planning and technology risk reduction for weapon concepts responsive to the 2030 timeframe threat environment (including, air-to-air weapons for both offensive and defensive purposes).  Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons.  Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air-to-Ground Concept Development"
                                    },
                                    "Description": {
                                        "val": "Mature, integrate, and demonstrate air-to-ground weapon components and systems (ordnance, guidance, and carriage and release technologies) to demonstrate warfighter capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.500"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed under Project 63670A, Weapon Technology Development, in the effort, Advanced Munition Concept Technologies.\n\n\nIncrease emphasis in conducting relevant long range strike weapon technology demonstrations to reduce risk for potential follow on acquisition programs.  Continue the development of munition concepts to incorporate technologies for carriage and terminal impact at high speed.  Increase emphasis in investigating concepts for cooperative control of small weapons to produce scalable effects to increase the capacity and capability of fifth generation aircraft.  Continue planning and technology risk reduction including demonstration and initial flight testing for weapons concepts responsive to the 2030 timeframe threat environment (including hypersonic and cooperative\/collaborative concepts).  Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons.  Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}