{
    "id": "da1fbb46a064bc0b508ab7f7bdde046bd4793294",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0105921F"
        },
        "ProgramElementTitle": {
            "val": "Service Support to STRATCOM - Space Activities"
        },
        "R1LineNumber": {
            "val": "130"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "3.079"
            },
            "CurrentYear": {
                "val": "8.090"
            },
            "BudgetYearOne": {
                "val": "8.674"
            },
            "BudgetYearOneBase": {
                "val": "8.674"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "9.414"
            },
            "BudgetYearThree": {
                "val": "9.463"
            },
            "BudgetYearFour": {
                "val": "10.309"
            },
            "BudgetYearFive": {
                "val": "10.484"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Critical Infrastructure Program (DCIP) is a Department of Defense (DoD) risk management program that seeks to ensure the availability of networked assets critical to DoD missions. An October 2014 memorandum of agreement between USSTRATCOM and Deputy Assistant Secretary of Defense for Defense Continuity and Mission Assurance transferred budget authority for SPACE SECTOR DCIP to USSTRATCOM to streamline the execution of funding. Critical infrastructure assets can include installations, facilities, antennas, vehicles, computing systems, and communications links. DCIP manages the identification, prioritization, assessment, and assurance of Defense Critical Infrastructure as a comprehensive program. The program includes the development of adaptive plans and procedures to mitigate risk.  \n\nNavigation Warfare (Navwar) is deliberate defensive and offensive action to assure positioning, navigation, and timing (PNT) information through coordinated employment of space, cyberspace, and electronic warfare (EW) operations.   The JNWC develops and maintains the Department’s premier collection of Navwar knowledge, and provides subject matter expertise support to warfighters, Department decision makers, the Federal Interagency (the Department of Homeland Security and other civil agencies concerned with the Critical National Infrastructure), and the Coalition.  Navwar expertise is developed in part by execution of PNT Operational Field Assessments (POFAs), modeling and simulation, analysis, and exercise and training support. JNWC-conducted POFAs are a key element in evaluating US and Coalition Navwar capabilities and vulnerabilities and adversary capabilities and vulnerabilities, both crucial to executing PNT superiority mission sets in potentially denied \/ degraded PNT environments.  JNWC helps develop defensive and offensive PNT capabilities by focusing on three Lines of Effort (LOE) to fulfill the mission tasks:\n\n1. Create NAVWAR Knowledge – Conduct PNT operational field assessments, studies and analyses, analyze and disseminate NAVWAR intelligence, and maintain a NAVWAR armory\n2. Operationalize PNT Superiority – Enable NAVWAR operations and provide planning subject matter expertise to Combatant Commands, Services, interagency partners and the coalition\n3. Institutionalize PNT Superiority– Advocate DoD-wide NAVWAR activities to fully integrate NAVWAR into military operations and the future force structure\n\n\nThe Space Analysis and Application Development program integrates space based effects into Department’s ‘Model of Record’ for joint campaign analysis. Current modeling and simulation (M&S) models are inadequate to represent the contribution that U.S space capabilities make to the air, sea, and land fight and do not accurately portray current and future space threats.  This line of effort integrates effects of space capabilities into the Synthetic Theater Operations Research Model (STORM) campaign level M&S tool.  Enhanced space M&S will enable the DoD to make informed decisions regarding the direction of U.S. Space Doctrine, Tactics, Techniques, Procedures, and Resource Decisions. The DoD requires the ability to conduct campaign-level analysis to quantify the holistic operational impacts of adversary space actions on military campaigns and U.S. global operations. \n\nUSSTRATCOM Data Integration and Fusion Center (DIFC) is an innovative organization developing and experimenting innovative concepts designed to validate both material and non-material methodologies to overcome data isolation in order to enable kill chains in the Joint Battlespace.  These data isolation challenges result from  network isolation, incomplete communications architectures, data security, incompatible information formats, security release policy, etc., inhibiting effective and efficient consolidation of decision quality strategic, operational and tactical information.  The DIFC develops machine to machine solutions capable of ingesting Title 10 data at multiple classification levels, to include Special Access Program data, and associating\/correlating with National Technical Means at multiple classification levels to both enhance and amplify the Common Operational Picture. The DIFC works closely with DoD SAPCO and elements of the Director of National Intelligence, to include NSA, NRO and CIA, to both identify and address policy barriers, architectures and training opportunities necessary to enable seamless flow of data from all available sensors to warfighters during time of conflict, primarily leveraging currently fielded tactical data links.  Though some recommended solutions validated during demonstration events may not transition to operations immediately, but nevertheless provide validated architecture solutions and approved security policies for use should conflict arise versus ad hoc attempts to solve data movement issues during conflict."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.134"
                },
                "CurrentYear": {
                    "val": "8.090"
                },
                "BudgetYearOne": {
                    "val": "8.176"
                },
                "BudgetYearOneBase": {
                    "val": "8.176"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.079"
                },
                "CurrentYear": {
                    "val": "8.090"
                },
                "BudgetYearOne": {
                    "val": "8.674"
                },
                "BudgetYearOneBase": {
                    "val": "8.674"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.055"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.498"
                },
                "BudgetYearOneBase": {
                    "val": "0.498"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.055"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.498"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.498"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "670373"
                    },
                    "ProjectTitle": {
                        "val": "DCIP"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.497"
                        },
                        "BudgetYearOne": {
                            "val": "0.491"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.491"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.491"
                        },
                        "BudgetYearThree": {
                            "val": "0.491"
                        },
                        "BudgetYearFour": {
                            "val": "0.492"
                        },
                        "BudgetYearFive": {
                            "val": "0.500"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The USSTRATCOM Space Sector Defense Critical Infrastructure Program (DCIP) is a risk management program that seeks to ensure the availability of networked assets critical to USSTRATCOM and other DoD missions.  DCIP is directed by the Office of the Assistant Secretary of Defense (Homeland Defense & Americas' Security Affairs) [OASD (HD&ASA)].  Space Sector DCIP manages the identification, prioritization, assessment, and assurance of Critical Infrastructure as a comprehensive program that includes the development of adaptive plans."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Assett Dependancy \/ Risk Characterization, Mitigation,  and Prototyping"
                                    },
                                    "Description": {
                                        "val": "Supports 1) systems engineering analysis for the decomposition of mission systems and assets, and supporting networks and infrastructure that execute USSTRATCOM mission, 2) research, studies, and operational assessment of mission system capabilities, methodologies, and tactics to identify critical assets and dependency relationships, and 3) evaluation of mission risk through research, studies, analysis and assessment of threats and hazards paired with exploitable vulnerabilities.\n\nSupports analysis for the identification and development of risk mitigation and remediation options through research, studies, analysis and assessment of current and future tactics, techniques and procedures and materiel solutions, enabling USSTRATCOM mission assurance planning, coordination, integration, synchronization supporting the reduction of risk to CDRUSSTRATCOM acceptable levels.\n\nSupports three spiral development cycles annually consisting of concept and requirement development, tool engineering, algorithm development, prototyping, and testing to support rapid mission impact assessment, risk assessment, and risk management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.497"
                                            },
                                            "Text": {
                                                "val": "- Analysis of USSTRATCOM Space Sector critical infrastructure assets and dependencies for space and missile defense missions\n\n- Research multiple vulnerability assessments reports and various threat and hazard assessment sources for critical infrastructure \n\n- Remediation analysis of identified vulnerabilities at specific critical infrastructure assets key to USSTRATCOM space and missile defense missions\n\n- Research and identify risk mitigation options to ensure mission accomplishment\n\n- Concept and requirement development, design development, tool engineering, prototyping, and test & evaluation of a graphical mission impact tool."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.491"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.491"
                                            },
                                            "Text": {
                                                "val": "- Continued analysis, studies and research of Space Sector critical infrastructure assets and dependencies supporting all USSTRATCOM assigned missions\n\n- Future critical infrastructure vulnerability assessments and researching the various sources to perform threats and hazards assessments\n\n- Remediation analysis of identified vulnerabilities at critical infrastructure assets necessary for individual USSTRATCOM missions\n\n- Research and identify risk mitigation options to ensure mission accomplishment.\n\n- Spiral improvements to the graphical mission impact tool\n\n- Concept and requirement development, design development, tool engineering, prototyping, and test & evaluation of a tool combining risk assessment methodology with threat and hazard evaluations of critical infrastructure assets"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive contracts will be used to the maximum extent possible."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Asset Dependency and Risk Characterization Research"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.497"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.491"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.491"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Asset Dependency, Risk Mitigation, Ops Research, Design\/Development, Modeling and Simulation, Test and Evaluation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "672486"
                    },
                    "ProjectTitle": {
                        "val": "JOINT NAVWAR CENTER (JNWC) SPACE ACTIVITIES"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.079"
                        },
                        "CurrentYear": {
                            "val": "2.527"
                        },
                        "BudgetYearOne": {
                            "val": "2.693"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.693"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.631"
                        },
                        "BudgetYearThree": {
                            "val": "2.680"
                        },
                        "BudgetYearFour": {
                            "val": "2.721"
                        },
                        "BudgetYearFive": {
                            "val": "2.770"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Navigation Warfare (Navwar) is deliberate defensive and offensive action to assure positioning, navigation, and timing (PNT) information through coordinated employment of space, cyberspace, and electronic warfare (EW) operations.  Funds are used to create and maintain NAVWAR knowledge. Navwar expertise is developed in part by execution of PNT Operational Field Assessments (POFAs). GYPSY assessments are linked to USSTRATCOM’s Tier 1 GLOBAL Series exercises and other CCMD exercises and provide operational realistic threat-representative, GPS-contested environments for analytical assessment of air, ground, or maritime mission capability.  FORTUNE POFAs are smaller-scale PNT capability and vulnerability assessments used as future assessment risk reduction or as stand-alone PNT capability assessments. Assessments inform service acquisition decisions, capability gaps, intelligence gaps and tactics, techniques and procedures (TTP) development and implementation to mitigate effects on warfighter operations in the anticipated theater Navwar threat environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PNT Operational Field Assessment (GYPSY)"
                                    },
                                    "Description": {
                                        "val": "The JNWC will operationally assess, and simulate potential threats and mitigation strategies for potential denial of blue force PNT capabilities as well as preventing the hostile use of Positioning, Navigation and Timing (PNT) information.\n\nThis will be accomplished primarily through the use of operational field assessments both GYPSY and Fortune, laboratories, employment of competitively selected contractors, universities, other government agencies, and Federally Funded Research and Development Centers (FFRDCs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.666"
                                            },
                                            "Text": {
                                                "val": "- Investigate, operationally assess, and simulate potential threats and mitigation strategies for potential denial of blue force PNT capabilities\n\n- Develop mitigation strategies for preventing the hostile use of Positioning, Navigation and Timing (PNT) information."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.482"
                                            },
                                            "Text": {
                                                "val": "- Investigate, operationally assess, and simulate potential threats and mitigation strategies for potential denial of blue force PNT capabilities\n\n- Develop mitigation strategies for preventing the hostile use of Positioning, Navigation and Timing (PNT) information."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.215"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.215"
                                            },
                                            "Text": {
                                                "val": "- Operational assessments\n\n- Simulate potential threats and mitigation strategies for potential denial of blue force PNT capabilities\n\n- Continuing development to prevent the hostile use of Positioning, Navigation and Timing (PNT) information."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PNT Operational Field Assessments (FORTUNE)"
                                    },
                                    "Description": {
                                        "val": "The FORTUNE Operational Field Assessments serve as a series of risk mitigation events that lead up to GYPSY PNT Operational Field Assessments (POFA). \n\nFORTUNE POFAs are planned and executed to demonstrate various PNT system capabilities and platform vulnerabilities to increase the Joint Navigation Center's understanding of test objectives to be undertaken during a GYPSY event."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.413"
                                            },
                                            "Text": {
                                                "val": "- Test range support for operational field assessments\n\n- Range time, engineering, modeling and simulation\n\n- Equipment needed to conduct operational field assessment. Modeling and Simulation tool kit, data collection and recording systems, instrumentation and transmitters, receivers, etc."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.045"
                                            },
                                            "Text": {
                                                "val": "- Test range support for FORTUNE operational field assessments\n\n- Equipment needed to conduct operational field assessment. Modeling and Simulation tool kit, data collection and recording systems, instrumentation and transmitters, receivers, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.478"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.478"
                                            },
                                            "Text": {
                                                "val": "- Conduct FORTUNE Operational Field Assessments\n\n- Serve as a series of risk mitigation events that are incorporated into GYPSY events \n\n- Create Navigation Warfare knowledge and Tactics Techniques and Procedures to mitigate Position Navigation and Timing (PNT) vulnerabilities"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "New contracts will be awarded using competitive procedures to the maximum extent possible."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PNT Operational Field Assessments (Gypsy and Fortune)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kirtland AFB, NM"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.079"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.527"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.693"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.693"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Operational Field Assessments - Fortune events"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Operational Field Assessments - GYPSY events"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67A011"
                    },
                    "ProjectTitle": {
                        "val": "Space Analysis and Application Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "5.066"
                        },
                        "BudgetYearOne": {
                            "val": "5.490"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.490"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.292"
                        },
                        "BudgetYearThree": {
                            "val": "6.292"
                        },
                        "BudgetYearFour": {
                            "val": "7.096"
                        },
                        "BudgetYearFive": {
                            "val": "7.214"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2017, Project 67A011, Space Analysis and Application Development, includes new start efforts for the Data Integration and Fusion Center"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Space Analysis and Application Development program Integrates space based effects into Department’s ‘Model of Record’ for joint campaign analysis. Current modeling and simulation (M&S) models are inadequate to represent the contribution that U.S space capabilities make to the air, sea, and land fight and do not accurately portray current and future space threats.  This line of effort integrates effects of space capabilities into the Synthetic Theater Operations Research Model (STORM) campaign level M&S tool.  Enhanced space M&S will enable the DoD to make informed decisions regarding the direction of U.S. Space Doctrine, Tactics, Techniques, Procedures, and Resource Decisions.  \n\nThe DoD requires the ability to conduct campaign-level analysis to quantify the holistic operational impacts of adversary space actions on military campaigns and U.S. global operations. \n\nUSSTRATCOM Data Integration and Fusion Center (DIFC) is an innovative organization developing and experimenting innovative concepts designed to validate both material and non-material methodologies to overcome data isolation in order to enable kill chains in the Joint Battlespace. Funds are necessary to update current government-owned software to ingest and disseminate new data sources from Title 10 and Title 50 sensors.  The DIFC efforts at COCOM sponsored experimentation events will inform service acquisition decisions, capability gaps, intelligence gaps and tactics, techniques and procedures (TTP) development and implementation to mitigate effects on warfighter operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Campaign Modeling and Simulation, Development\/Modification\/Verification\/Validation"
                                    },
                                    "Description": {
                                        "val": "Develops, modifies, verifies, and validates new models for space mission areas and modifies existing models to portray new capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.066"
                                            },
                                            "Text": {
                                                "val": "- Enhance STORM non-lethal effects modeling\n- Continue modifications to support upcoming AOAs and studies\n- Continue integration of lonospheric scintillation forecast accuracy modifications into mission models and various communication analysis tools"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "- Determine touchpoints between space capabilities and the Offensive Counter Air and Fighter Escort \/ Fighter Sweep mission tasks within STORM \n- Refine\/develop software code to represent US and adversary space interactions in engagement and mission level models\n- Develop software to input space effects from engagement and mission level models into STORM campaign-level M&S to determine effect of degraded space on U.S. military campaigns and global operations\n- Develop test cases to evaluate performance of campaign model\n- Analyze\/assess modeling results to determine impact\/effects of space activities on U.S. military campaigns and global operations"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Integration and Fusion Center"
                                    },
                                    "Description": {
                                        "val": "USSTRATCOM\/J8 Data Integration and Fusion Center (DIFC) is an innovative organization developing and experimenting innovative concepts designed to validate both material and non-material methodologies to overcome data isolation in order to enable kill chains in the Joint Battlespace. The DIFC will work to update current government-owned software to ingest and disseminate new data sources from Title 10 and Title 50 sensors.  The DIFC efforts at COCOM sponsored experimentation events will inform service acquisition decisions, capability gaps, intelligence gaps and tactics, techniques and procedures (TTP) development and implementation to mitigate effects on warfighter operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.990"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.990"
                                            },
                                            "Text": {
                                                "val": "The DIFC will investigate, experiment, and disseminate various Title 10 and Title 50 data sources from collect through dissemination to tactical platforms using machine to machine solutions to move data more efficiently and affect kill chain timelines."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Any new projects funded in this program will be awarded using competitive procedures to the maximum extent possible.\n\nBest value to the government selected contractors, universities, government facilities, federally funded research and development centers, laboratories, or other organizations"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Best value to the government selected contractors, universities, government facilities, federally funded research and development centers, laboratories, or other organizations"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Model Space effects for two mission tasks and integrate into STORM for joint campaign analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.066"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Integration and Fusion Center"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple Gov\/Civ Agencies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Schriever AFB, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.990"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.990"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Model Space effects for Offensive Counter Air\/ Attack Operations and Suppression of Enemy Air Defenses Mission Tasks"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Model Space effects for Offensive Counter Air Fighter Escort and Fighter Sweep Mission Tasks"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Model Space effects for Defensive Counter Air High Value Airborne Asset Defense and Point Defense Mission Tasks"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Model Space effects for Defensive Counter Air Area Defense and Passive Air and Missile Defense Mission Tasks"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Model Space effects for Anti-Surface Warfare and Anti-Submarine Warfare Mission Tasks"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Model Space effects for Intelligence, Surveillance, Reconnaissance and Electronic Warfare Mission Tasks"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}