{
    "id": "e3b7606024e80849cb9e366c68010c596643db47",
    "meta": {
        "filename": "dod-2017_RDTE_2017_TJS_U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604828J"
        },
        "ProgramElementTitle": {
            "val": "Joint FIRES Integration and Interoperability Team"
        },
        "R1LineNumber": {
            "val": "103"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "12.946"
            },
            "PriorYear": {
                "val": "2.447"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "15.393"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.102"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.447"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.655"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY2015 Carryover"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.655"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY2016 this program element will be consolidated with PE 0604826J - Joint C5 (Command, Control, Communications, Computers, and Cyber) Capability Development, Integration, and Interoperability Assessments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P857"
                    },
                    "ProjectTitle": {
                        "val": "Joint Deployable Analysis Team (JDAT)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "12.946"
                        },
                        "PriorYear": {
                            "val": "2.447"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.393"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The JFIIT mission is to employ scientific methods to research, investigate, test, assess, and evaluate current and emergent Joint command and control (C2) information systems and associated procedures. These activities measure capabilities and limitations, identify shortfalls and root cause, recommend and verify solutions, and validate joint capabilities. The resultant empirical outcomes influence Joint Capability development in areas such as Policy; Joint Doctrine; Tactics, Techniques and Procedures (TTP); integration and interoperability of capabilities. JDAT provides decision-quality data and cogent solutions to customers and stakeholders responsible for improving Joint C2 information systems integration and interoperability, informing acquisition decisions, and ensuring that Services and Agencies field integrated and interoperable systems.  The emphasis of JFIIT efforts is the analysis of C2 information systems and supporting procedures to provide Services and Agencies findings and recommendations based on quantifiable data to improve Joint C2 integration and interoperability. Evaluations range from small, single-focus events to large, multi-event\/venue exercises. \n\nIn FY 2016 this program element will be consolidated with PE 0604826J - Joint C5 (Command, Control, Communications, Computers, and Cyber) Capability Development, Integration, and Interoperability Assessments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Fires Integration & Interoperability Team (JFIIT)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.447"
                                            },
                                            "Text": {
                                                "val": "Analysis activities enhanced joint warfighter capabilities in support of U.S. National security requirements. Provided timely, facts-based findings and recommendations for action through the formal DoD decision-making processes used to validate operational requirements and apply funding to field effective, interoperable capabilities.  Activities and benefits to DoD and warfighters are summarized below.\n\n(1)  Conducted analysis of joint fires capabilities at BOLD QUEST event. Assessed Joint-coalition capabilities relevant to the Joint Mission Threads (JMTs) of Coalition Intelligence, Surveillance, and Reconnaissance (CISR), joint fires, IAMD and Joint Close Air Support (JCAS) in order to identify interoperability gaps and integration shortfalls. Identified twelve (12) interoperability discrepancies between US systems for joint fires (limited to digitally aided fire support, DAFS) with eleven (11) findings reported to acquisition program offices and one resolved for US Army fire support systems.  Analysis results inform US Government decisions to field interoperable and integrated US-Coalition capabilities. DoD stakeholders included Defense Information Systems Agency (DISA), Joint Staff , USA, and USAF; international defense stake holders include Canada (Canadian Forces Warfare Center), Denmark (Defence Command Denmark), Norway (Norwegian Battle Lab & Experimentation), Italy, France, United Kingdom, as well as NATO (NATO Communications and Information Agency).  \n\n(2)  Assessed a Mission Partner Environment (MPE) during the scheduled BOLD QUEST event; applied the recently approved MPE capabilities definition packages (CDPs) to frame current and future assessments of MPEs and provide recommendations for improved MPE operations.  Effective analysis of  MPE performance through collaboration between DoD, Inter-Agency (IA) and Coalition partners inform capabilities development and subsequent decisions on mitigating gaps and shortfalls in the MPE capability.  \n\n(3) Collected data and provided analysis on the integration of counter-UAS (C-UAS) operational architectures, operational concepts, and tactics, techniques, and procedures (TTPs) in support of broader air and missile defense requirements during BLACK DART event.  Evaluated existing combatant command plans for C-UAS operations; provided qualitative\/quantitative findings with recommendations that inform the Integrated Air & Missile Defense (IAMD) roadmap.  Effective analysis of C-UAS capabilities through collaboration within JS (J6 and J8) and among broader DoD, Inter-Agency (IA) and Industry partners informs Service decisions on the mitigation of adversary UAS capabilities.  Service and combatant command stakeholders included USN, USAF, USA, NORAD\/NORTHCOM, PACOM, and CENTCOM; IA stakeholders included Department of Homeland Security; and key foreign observers included UK\/JAP\/AUS\/ROK.  Also participating were select U.S. and foreign acquisition programs (both fielded and emerging technologies). \n\n\n(4)  Identified and evaluated over ten (10) specific cyber vulnerabilities during DoD Enterprise Cyberspace Range Environment (DECRE) events; provided qualitative\/quantitative findings with recommendations to  participating programs, and Director Operational Test and Evaluation (DOT&E) to enhance planning for future cyber security events.  Analysis of Joint C2 information systems and procedures, with data collected through exercise of validated DoD scenarios in an operationally relevant multi-phased event, inform DoD mitigation of cyberattacks against command and control systems.  Service and combatant command stakeholders included NORTHCOM, DOT&E and JS."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A: PE is consolidating in FY 2016 - Refer to PE0604826J"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "N\/A: PE Consolidating in FY2016 - reference PE0604826J"
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Consolidation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Transition to PE0604826J"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}