{
    "id": "e54fceb92ad40e1d17c9d1c3f14f2a7abeaf8272",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA5A_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604201A"
        },
        "ProgramElementTitle": {
            "val": "Aircraft Avionics"
        },
        "R1LineNumber": {
            "val": "74"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "39.583"
            },
            "CurrentYear": {
                "val": "18.639"
            },
            "BudgetYearOne": {
                "val": "83.248"
            },
            "BudgetYearOneBase": {
                "val": "83.248"
            },
            "BudgetYearTwo": {
                "val": "90.386"
            },
            "BudgetYearThree": {
                "val": "61.627"
            },
            "BudgetYearFour": {
                "val": "7.480"
            },
            "BudgetYearFive": {
                "val": "14.292"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Fiscal Year (FY) 2017 budget request funds the development of Aircraft Avionics systems required to horizontally and vertically integrate the battlefield and the integration of those systems into Army aircraft. Tasks in this Program Element support research, development, and test efforts in the Engineering and Manufacturing Development phases of these systems.\n\nThe Airborne Maritime Fixed-Aviation (AMF-A) is the transformational system that provides Army Aviation interoperability capability for Future Force and Joint Force operations.  The AMF-A integration effort provides for the non-recurring engineering required to integrate and qualify the AMF-A certified radios with Link 16 and\/or other advanced networking waveforms into the Apache AH-64E and Unmanned Aircraft Systems (UAS).  Specifically, the PRC-152A radio will be incorporated into the Shadow UAS Communications Relay Payload mission equipment package.\n \nThe Doppler Global Positioning System Navigation Set (DGNS) Upgrade program completes system engineering trade studies to reduce space, weight, and power with the introduction of new navigation support capabilities such as inertial sensor, MIL-STD-1553 interface card, and Instrument Flight Rules map display.  It also prepares Engineering Change Proposals (ECP) to the existing DGNS ASN-128D Line Replaceable Units (LRU) as a result of those trade studies. The effort also derives DGNS compliance matrices for current and planned Global Air Traffic Management (GATM) capabilities for the upcoming decade.  The DGNS upgrade continues with execution of Non-Recurring Engineering for Computer Display Unit (CDU) and Signal Data Converter LRU ECP packages.  The ASN-128D CDU upgrade replaces the current CDU faceplate with a touch screen display, provides a moving navigation map capability and optimizes pilot interface to augment existing Instrument Flight Rules capability promoting safer flight operations.  The CDU upgrade will support Assured-Position Navigation and Time (A-PNT) operations in conjunction with additional system LRU upgrades and supports Department of Defense (DoD) and Army's requirement to maintain A-PNT throughout operations.  This will require assessment and follow-on upgrade to the DGNS navigation system.  The CDU upgrade will perform an assessment of A-PNT assurance levels to understand system performance, associated PNT capability gaps, and evaluate candidate solutions to cover any identified gaps.\n\nThe Enhanced Aviation GATM Localizer Performance with Vertical Guidance (LPV) Embedded GPS Inertial (EGI) Navigation System (EAGLE) A-PNT integration program assesses current capabilities in identified operational PNT environment levels and tests identified upgrades to existing EGI hardware in order to accommodate A-PNT in identified operational environments and incorporates M-Code.  It supports DoD and Army's requirement to maintain A-PNT throughout operations and requires assessment and follow-on upgrade to the EGI navigation system.  The EAGLE upgrade will perform an assessment of A-PNT assurance levels to understand system performance, associated PNT capability gaps, and evaluate candidate solutions to cover any identified gaps.\n\nThe Brownout Rotorcraft Enhancement System (BORES) addresses tactical operations and training missions within Degraded Visual Environments (DVE) which restricts or severely reduces the aircrew's visibility due to atmospheric obscurants. BORES will initiate the use of DVE as a tactical advantage for Army Aviation.  In addition, BORES will improve safety, reduce risk and add flexibility to aviation units by enhancing aircrew situational awareness through real-time detection and warning of terrain, obstacles and hazards.  BORES will consist of integrated rotorcraft pilotage augmentation systems, sensor(s), software, software related fireware, and pilot to system interfaces and cueing devices.  BORES will combine obscurant penetrating sensor(s) with aircraft state data via a fusion\/synthetic vision system to provide an initial capability for ground taxi, hover, takeoff and landing modes of flight during brownout conditions.\n\nThe Aviation Data Exploitation Capability (ADEC) is an Army aviation automated information system program providing specific capabilities needed at the aviation unit level to implement and support improvements within aviation operations, safety, and training to increase operational effectiveness and situational awareness at all command echelons.  ADEC provides a common and interoperable capability required to implement the DoD mandated Military Flight Operations Quality Assurance processes. ADEC will standardize flight scheduling\/management, risk management, mission approval, and flight data analysis and visualization. ADEC provides interfaces to Centralized Aviation Flight Records System (CAFRS) to reduce data entry and the information technology footprint while enabling disconnected and split based operations.    \n\nThe Aircraft Notebook (ACN) is an Army aviation automated information system program required to streamline the completion of aviation maintenance activities and the documentation required to maintain airworthiness for all Army aircraft. ACN implements The Army Maintenance Management System - Aviation (TAMMS-A) digital logbook functionality and integrates with CAFRS to reduce manual entries and increase data accuracy. ACN reduces the information technology footprint within an aviation unit by integrating multiple software applications such as platform software applications, interactive electronic technical manuals, and condition based maintenance plus tools onto one hardware platform.\n\nThe Aviation Logistics Enterprise - Platform (ALE-P) is the single logistics information system for all of Army aviation and serves as an extension to Global Combat Support System-Army (GCSS-Army). ALE-P replaces the Unit Level Logistics System-Aviation (Enhanced) (ULLS-A[E]) and the Unmanned Aviation Systems-Initiative (UAS-I) systems. ALE-P provides necessary interfaces to GCSS-Army and other enterprise systems at Logistics Support Activity, Aviation and Missile Command, and Program Executive Office Aviation. ALE-P interfaces with the ACN and ADEC at the unit level to maintain continuous airworthiness and aircraft historical records and provides the maintenance\/readiness posture to the commander."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "41.236"
                },
                "CurrentYear": {
                    "val": "12.939"
                },
                "BudgetYearOne": {
                    "val": "2.210"
                },
                "BudgetYearOneBase": {
                    "val": "2.210"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "39.583"
                },
                "CurrentYear": {
                    "val": "18.639"
                },
                "BudgetYearOne": {
                    "val": "83.248"
                },
                "BudgetYearOneBase": {
                    "val": "83.248"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.653"
                },
                "CurrentYear": {
                    "val": "5.700"
                },
                "BudgetYearOne": {
                    "val": "81.038"
                },
                "BudgetYearOneBase": {
                    "val": "81.038"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-9.300"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "15.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.653"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "81.038"
                                },
                                "BudgetYearOneBase": {
                                    "val": "81.038"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY16: $15,000K Congressional increase for DVE\n      -$9,300K Army requested transfer of ALE-P funding to Global Combat Support System\nFY17: $81,038K Increase for BORES\/DVE development"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "C97"
                    },
                    "ProjectTitle": {
                        "val": "ACFT Avionics"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.372"
                        },
                        "CurrentYear": {
                            "val": "1.858"
                        },
                        "BudgetYearOne": {
                            "val": "0.798"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.798"
                        },
                        "BudgetYearTwo": {
                            "val": "5.849"
                        },
                        "BudgetYearThree": {
                            "val": "5.864"
                        },
                        "BudgetYearFour": {
                            "val": "5.942"
                        },
                        "BudgetYearFive": {
                            "val": "5.645"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Fiscal Year (FY) 2017 budget request funds the development of Aircraft Avionics systems required to horizontally and vertically integrate the battlefield and the integration of those systems into Army aircraft. Tasks in this Project support research, development, and test efforts in the Engineering and Manufacturing Development phases of these systems.\n\nThe Airborne Maritime Fixed-Aviation (AMF-A) is the transformational system that provides Army Aviation interoperability capability for Future Force and Joint Force operations.  The AMF-A integration effort provides for the non-recurring engineering required to integrate and qualify the AMF-A certified radios with Link 16 and\/or other advanced networking waveforms into the Apache AH-64E and Unmanned Aircraft Systems (UAS).  Specifically, the PRC-152A radio will be incorporated into the Shadow UAS Communications Relay Payload mission equipment package.\n\nThe Doppler Global Positioning System Navigation Set (DGNS) Upgrade program completes system engineering trade studies to reduce space, weight, and power with the introduction of new navigation support capabilities such as inertial sensor, MIL-STD-1553 interface card, and Instrument Flight Rules map display.  It also prepares Engineering Change Proposals (ECP) to the existing DGNS ASN-128D Line Replaceable Units (LRU) as a result of those trade studies. The effort also derives DGNS compliance matrices for current and planned Global Air Traffic Management (GATM) capabilities for the upcoming decade.  The DGNS upgrade continues with execution of Non-Recurring Engineering for Computer Display Unit (CDU) and Signal Data Converter LRU ECP packages.  The ASN-128D CDU upgrade replaces the current CDU faceplate with a touch screen display, provides a moving navigation map capability and optimizes pilot interface to augment existing Instrument Flight Rules capability promoting safer flight operations.  The CDU upgrade will support Assured-Position Navigation and Time (A-PNT) operations in conjunction with additional system LRU upgrades and supports Department of Defense (DoD) and Army's requirement to maintain A-PNT throughout operations.  This will require assessment and follow-on upgrade to the DGNS navigation system.  The CDU upgrade will perform an assessment of A-PNT assurance levels to understand system performance, associated PNT capability gaps, and evaluate candidate solutions to cover any identified gaps.\n\nThe Enhanced Aviation GATM Localizer Performance with Vertical Guidance (LPV) Embedded Global Positioning System (GPS) Inertial (EGI) Navigation System (EAGLE) A-PNT integration program assesses current capabilities in identified operational PNT environment levels and tests identified upgrades to existing EGI hardware to accommodate A-PNT in identified operational environments and incorporates M-Code.  It supports DoD and Army's requirement to maintain A-PNT throughout operations and requires assessment and follow-on upgrade to the EGI navigation system.  The EAGLE upgrade will perform an assessment of A-PNT assurance levels to understand system performance, associated PNT capability gaps, and evaluate candidate solutions to cover any identified gaps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airborne Maritime Fixed (AMF-A) integration and qualification for Apache AH-64E and PRC-152A Radio for UAS platforms."
                                    },
                                    "Description": {
                                        "val": "The AMF-A integration effort provides for the non-recurring engineering required to integrate and qualify the PRC-152A compliant radios and\/or other advanced networking waveforms into the Apache AH-64E and UAS platforms for both production cut-in and retrofit activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.994"
                                            },
                                            "Text": {
                                                "val": "Developed a catalogue of qualified airborne AMF-A antennas for use on multiple platforms. Supported multiple SALT and SANR working groups."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.858"
                                            },
                                            "Text": {
                                                "val": "Continue development of AMF-A antennas and associated Co-Site Analysis tasks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "Complete catalogue development of AMF-A antennas and associated Co-Site Analysis tasks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Doppler Global Positioning System Navigation Set (DGNS) Upgrade\/Assured-Position Navigation and Time (A-PNT) Assessment"
                                    },
                                    "Description": {
                                        "val": "The DGNS Upgrade program completes system engineering trade studies to reduce space, weight, and power with the introduction of new navigation support capabilities such as inertial sensor, MIL-STD-1553 interface card, and Instrument Flight Rules (IFR) map display.  It also prepares ECPs to the existing DGNS ASN-128D LRU as a result of those trade studies.  The effort also derives DGNS compliance matrices for current and planned GATM capabilities for the upcoming decade.  The DGNS upgrade continues with execution of Non-Recurring Engineering for CDU and Signal Data Converter LRU ECP packages.  The ASN-128D CDU Upgrade replaces the current CDU faceplate with a touch screen display, provides a moving navigation map capability and optimized pilot interface to augment existing IFR capability and promote safer flight operations.  It also enables CDU support for A-PNT operations in conjunction with additional system LRU upgrades."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.378"
                                            },
                                            "Text": {
                                                "val": "Continued CDU Upgrade non-recurring engineering effort with software implementation, hardware fabrication, DGNS system integration, and full airworthiness component level qualification testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Complete assessments and feasibility studies performed on the CDU Upgrade equipment to identify hardware and software changes required to meet A-PNT requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Aviation GATM Localizer Performance with Vertical Guidance (LPV) Embedded GPS Inertial (EGI) Navigation System (EAGLE)"
                                    },
                                    "Description": {
                                        "val": "The EAGLE Navigation System A-PNT integration program assesses current capabilities in identified operational PNT environment levels and tests identified upgrades to existing EGI hardware to accommodate A-PNT in identified operational environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.548"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.548"
                                            },
                                            "Text": {
                                                "val": "Initiate assessments and feasibility studies on the current EGI and EAGLE equipment to identify hardware and software changes required to meet A-PNT requirements and to incorporate M-Code."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "AA0723"
                                    },
                                    "Title": {
                                        "val": "COMMS, NAV Surveillance"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "115.795"
                                        },
                                        "CurrentYear": {
                                            "val": "82.904"
                                        },
                                        "BudgetYearOne": {
                                            "val": "69.960"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "69.960"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "94.516"
                                        },
                                        "BudgetYearThree": {
                                            "val": "85.628"
                                        },
                                        "BudgetYearFour": {
                                            "val": "77.985"
                                        },
                                        "BudgetYearFive": {
                                            "val": "72.766"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "AA0704"
                                    },
                                    "Title": {
                                        "val": "GATM Rotary Wing"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "41.821"
                                        },
                                        "CurrentYear": {
                                            "val": "33.890"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.302"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.302"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "60.647"
                                        },
                                        "BudgetYearThree": {
                                            "val": "29.808"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.131"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.920"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This project is comprised of multiple systems supporting aircraft avionics. While the detailed acquisition strategy varies from program to program, the general strategy is for each individual program to complete the development and testing efforts in coordination with the aircraft platforms on integration issues, use the various contracts of the aircraft platforms original equipment manufacturers on integration efforts, and utilize the Aviation & Missile Research, Development, and Engineering Center for software development. This requires the use of various contract methods and types to accomplish the aircraft avionics development efforts. All required acquisition program documentation is prepared."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PM Services (EAGLE)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM AME"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PM Services (DGNS Upgrade\/ DGNS A-PNT)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM AME"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.063"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.063"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PM Services (AMF-A)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM AME"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.222"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.641"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.676"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.539"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AMF-A Common Radio Control Software Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMRDEC Software Engineering Directorate"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.265"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.265"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.265"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AMF-A Antenna Development and Co-Site Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMRDEC, Prototype Integration Facility\/CERDEC Flight Activity"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL\/Lakehurst, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.084"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.182"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.366"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PRC-152A Radio Shadow Communication Relay Package"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.245"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.245"
                                                    },
                                                    "TargetValue": {
                                                        "val": "9.958"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DGNS Upgrade"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wayne, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "30.640"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.315"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "33.955"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DGNS A-PNT Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wayne, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.200"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AMF-A Link-16 and Wide Band Networking Waveform Integration and Qualification onto AH-64E"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Mesa, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "29.989"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "29.989"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EAGLE A-PNT Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Honeywell"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Clearwater, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.348"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.348"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PEO AVN Support (AMF-A)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO AVN"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.303"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.303"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98178-0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "AMF-A AH-64E Link 16 and WNW Integration Qualification AH-64"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DGNS AN\/ASN-128D Upgrade"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DGNS AN\/ASN-128D A-PNT Assessment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EAGLE A-PNT Assessment \/ M-Code Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMF-A Antenna Development and Co-Site Analysis"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMF-A Common Radio Control Software Development and Qualification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PRC-152A Radio Shadow Communications Relay Package"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VU3"
                    },
                    "ProjectTitle": {
                        "val": "Networking And Mission Planning"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.211"
                        },
                        "CurrentYear": {
                            "val": "16.781"
                        },
                        "BudgetYearOne": {
                            "val": "82.450"
                        },
                        "BudgetYearOneBase": {
                            "val": "82.450"
                        },
                        "BudgetYearTwo": {
                            "val": "84.537"
                        },
                        "BudgetYearThree": {
                            "val": "55.763"
                        },
                        "BudgetYearFour": {
                            "val": "1.538"
                        },
                        "BudgetYearFive": {
                            "val": "8.647"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Aviation Logistics Enterprise-Platform (ALE-P) requirement has been transferred to Program Manager Army Enterprise Systems Integration Program (PM AESIP) Global Combat Support System (GCSS) Army effective Fiscal Year (FY) 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Fiscal Year (FY) 2017 budget request funds the development of Networking and Mission Planning systems required to horizontally and vertically integrate the battlefield and the integration of those systems into Army aircraft. Tasks in this Project support research, development, and test efforts in the Engineering and Manufacturing Development (EMD) phases of these systems.\n\nThe Brownout Rotorcraft Enhancement System (BORES) addresses tactical operations and training missions within Degraded Visual Environment (DVE) which restricts or severely reduces the aircrew's visibility due to atmospheric obscurants. BORES will initiate the use of DVE as a tactical advantage for Army Aviation. In addition, BORES will improve safety, reduce risk and add flexibility to aviation units by enhancing aircrew situational awareness through real-time detection and warning of terrain, obstacles and hazards. BORES will consist of integrated rotorcraft pilotage augmentation systems, sensor(s), software, software related firmware, and pilot to system interfaces and cueing devices. BORES will combine obscurant penetrating sensor(s) with aircraft state data via a fusion\/synthetic vision system to provide an initial capability for ground taxi, hover, takeoff and landing modes of flight during brownout conditions.\n\nThe Aviation Data Exploitation Capability (ADEC) is an Army aviation automated information system program providing specific capabilities needed at the aviation unit level to implement and support improvements within aviation operations, safety, and training to increase operational effectiveness and situational awareness at all command echelons. ADEC provides a common and interoperable capability required to implement the DoD mandated Military Flight Operations Quality Assurance processes. ADEC will standardize flight scheduling\/management, risk management, mission approval, and flight data analysis and visualization. ADEC provides interfaces to Centralized Aviation Flight Records System (CAFRS) to reduce data entry and the information technology footprint while enabling disconnected and split based operations.\n\nThe Aircraft Notebook (ACN) is an Army aviation automated information system program required to streamline the completion of aviation maintenance activities and the documentation required to maintain airworthiness for all Army aircraft. ACN implements The Army Maintenance Management System - Aviation (TAMMS-A) digital logbook functionality and integrates with CAFRS to reduce manual entries and increase data accuracy. ACN reduces the information technology footprint within an aviation unit by integrating multiple software applications such as platform software applications, interactive electronic technical manuals, and condition based maintenance plus tools onto one hardware platform.\n\nThe Aviation Logistics Enterprise-Platform (ALE-P) is the single logistics information system for all of Army aviation and serves as an extension to GCSS Army. ALE-P replaces the Unit Level Logistics System-Aviation (Enhanced) (ULLS-A[E]) and the Unmanned Aviation Systems-Initiative (UAS-I) systems. ALE-P provides necessary interfaces to GCSS-Army and other enterprise systems at Logistics Support Activity (LOGSA), Aviation and Missile Command (AMCOM), and Program Executive Office (PEO) Aviation. ALE-P interfaces with the ACN and ADEC at the unit level to maintain continuous airworthiness and aircraft historical records and provides the maintenance\/readiness posture to the commander."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Brownout Rotorcraft System (BORES)\/Degraded Visual Environment (DVE)"
                                    },
                                    "Description": {
                                        "val": "The BORES addresses tactical operations and training missions within DVE which restricts or severely reduces the aircrew's visibility due to atmospheric obscurants. BORES will initiate the use of DVE as a tactical advantage for Army Aviation. In addition, BORES will improve safety, reduce risk and add flexibility to aviation units by enhancing aircrew situational awareness through real-time detection and warning of terrain, obstacles and hazards. BORES will consist of integrated rotorcraft pilotage augmentation systems, sensor(s), software, software related firmware, and pilot to system interfaces and cueing devices. BORES will combine obscurant penetrating sensor(s) with aircraft state data via a fusion\/synthetic vision system to provide an initial capability for ground taxi, hover, takeoff and landing modes of flight during brownout conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "Conducted technical design and development of DVE."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "Continue design and develop the initial technical system and sub-system specifications for the DVE\/BORES.  The DVE\/BORES program will focus on the development of an Airworthiness Qualification Package, initiate identified aircraft trade studies with original equipment manufacturers, initiate program documentation, identify and begin modeling and simulation activities.  Additionally, a Limited User Assessment will be conducted to inform the DVE\/BORES program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "80.541"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "80.541"
                                            },
                                            "Text": {
                                                "val": "Continue the design and develop the technical system and sub-system specifications for the DVE\/BORES.  The DVE\/BORES program will identify airworthiness requirements for hardware and software, complete identified aircraft trade studies with original equipment manufacturers, continue the development of program documentation, and initiate modeling and simulation as risk reduction activities.  Program efforts include the issuance of a contract request for proposal with subsequent source selection evaluation of proposals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation Data Exploitation Capability (ADEC)"
                                    },
                                    "Description": {
                                        "val": "The ADEC is an Army aviation automated information system program providing specific capabilities needed at the aviation unit level to implement and support improvements within aviation operations, safety, and training to increase operational effectiveness and situational awareness at all command echelons.   ADEC provides a common and interoperable capability required to implement the DoD mandated Military Flight Operations Quality Assurance processes. ADEC will standardize flight scheduling\/management, risk management, mission approval, and flight data analysis and visualization. ADEC provides interfaces to CAFRS to reduce data entry and the information technology footprint while enabling disconnected and split based operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.950"
                                            },
                                            "Text": {
                                                "val": "Initiated ADEC design, development, integration, and developmental and operational testing of the hardware and software version 1.0.  Conducted ADEC design, development, and integration of software version 2.0."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.781"
                                            },
                                            "Text": {
                                                "val": "Continue ADEC design, development, integration, and developmental testing of software version 2.0."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.909"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.909"
                                            },
                                            "Text": {
                                                "val": "Complete ADEC development, integration, and developmental and operational testing of software version 2.0."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Notebook (ACN)"
                                    },
                                    "Description": {
                                        "val": "The ACN is an Army aviation automated information system program required to streamline the completion of aviation maintenance activities and the documentation required to maintain airworthiness for all Army aircraft. ACN implements TAMMS-A digital logbook functionality and integrates with CAFRS to reduce manual entries and increase data accuracy. ACN reduces the information technology footprint within an aviation unit by integrating multiple software applications such as platform software applications, interactive electronic technical manuals, and condition based maintenance plus tools onto one hardware platform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.261"
                                            },
                                            "Text": {
                                                "val": "Performed development and integration of ACN hardware and software and Operational Test and Evaluation activities. Completed formal qualification software development testing and software user test."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "AA0712"
                                    },
                                    "Title": {
                                        "val": "Network and Mission Plan"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "102.930"
                                        },
                                        "CurrentYear": {
                                            "val": "108.807"
                                        },
                                        "BudgetYearOne": {
                                            "val": "74.752"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "74.752"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "139.458"
                                        },
                                        "BudgetYearThree": {
                                            "val": "144.555"
                                        },
                                        "BudgetYearFour": {
                                            "val": "120.898"
                                        },
                                        "BudgetYearFive": {
                                            "val": "135.305"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "AA0723"
                                    },
                                    "Title": {
                                        "val": "Degraded Visual Environment"
                                    },
                                    "Funding": {
                                        "BudgetYearFour": {
                                            "val": "56.082"
                                        },
                                        "BudgetYearFive": {
                                            "val": "59.171"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This project is comprised of multiple systems supporting aircraft avionics.  While the detailed acquisition strategy varies from program to program, the general strategy is for each individual program to complete the development and testing efforts in coordination with the aircraft platforms on integration issues, use the various contracts of the aircraft platforms original equipment manufacturers on integration efforts, and utilize the Aviation & Missile Research, Development, and Engineering Center for software development.  This requires the use of various contract methods and types to accomplish the aircraft avionics development efforts.  All required acquisition program documentation is prepared."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PM Support (ADEC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Program Manager Aviation Networks Mission Planning"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.334"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.712"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.046"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PM Support (ACN)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Program Manager Aviation Mission Networks Planning"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.022"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.926"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.948"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PM Support (BORES\/DVE)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMCOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.196"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.506"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.649"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.649"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Qualify ADEC software and hardware"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aviation Missile Research Development Engineering Center (AMRDEC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.746"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.603"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.781"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.028"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.028"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.158"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Qualify ACN software and hardware"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aviation Missile Research Engineering Center (AMRDEC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.935"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.003"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.938"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Develop and qualify the software and hardware for BORES\/DVE"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "61.182"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "61.182"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Engineering, Logistics, and Technical Support (ADEC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test & Evaluation (ATEC), Aberdeen, MD; AMRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.635"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.558"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.480"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.480"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.673"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Engineering, Logistics, and Technical Support (ACN)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test & Evaluation (ATEC), Aberdeen, MD; AMRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.335"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.831"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.166"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Engineering, Logistics, and Technical Support (BORES\/DVE)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.857"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.911"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.098"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.098"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ADEC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test & Evaluation Command (ATEC), Aberdeen MD; AMRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.880"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.077"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.401"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.401"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.358"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ACN"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test & Evaluation Command (ATEC), Aberdeen MD; AMRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.423"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.501"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.924"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "BORES\/DVE"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Aviation & Missile Research Development & Engineering Center(AMRDEC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "20.800"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "16.343"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.583"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "14.612"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "14.612"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98178-1.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Brownout Rotorcraft Enhancement System (BORES)\/Degraded Visual Environment (DVE)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop hardware and software (ADEC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone B\/C (ADEC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop hardware and software (ACN)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}