{
    "id": "e7460603ea4d8f318d096deef75b9d9fb6a377ed",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA3_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603001A"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Advanced Technology"
        },
        "R1LineNumber": {
            "val": "29"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "75.833"
            },
            "CurrentYear": {
                "val": "55.973"
            },
            "BudgetYearOne": {
                "val": "38.831"
            },
            "BudgetYearOneBase": {
                "val": "38.831"
            },
            "BudgetYearTwo": {
                "val": "40.937"
            },
            "BudgetYearThree": {
                "val": "43.523"
            },
            "BudgetYearFour": {
                "val": "44.355"
            },
            "BudgetYearFive": {
                "val": "45.242"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides Soldiers and Small Combat Units with the most effective personal clothing, equipment, combat rations, shelters, and logistical support items with the least weight and sustainment burden. This PE supports the maturation and demonstration of technologies associated with aerial delivery of personnel and cargo (Project 242), rapid ammunition\/munitions deployability and resupply (Project 543), combat rations and combat feeding equipment (Project C07), combat clothing and personal equipment (including protective equipment such as personal armor, helmets, and eyewear) (Project J50), and expeditionary base camps (Project VT5). The projects in this PE adhere to Tri-Service Agreements on clothing, textiles, and food with coordination provided through the Cross-Service Warfighter Equipment Board, the Soldier as a System Integrated Concepts Development Team, and the Department of Defense (DoD) Combat Feeding Research and Engineering Board.\n\nEfforts in this PEsupport the Army Science and Technology Soldier\/Squad, Lethality, and Ground Maneuver Portfolios.\n\nWork in this PE is related to, and fully coordinated with, PE 0602786A (Warfighter Technology), PE 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602787A (Medical Technology), PE 0602716A (Human Factors Engineering Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0603015A (Next Generation Training and Simulation Systems), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology), PE 0603710A (Night Vision Advanced Technology), PE 0602784A (Military Engineering Technology), and PE 0603734A (Military Engineering Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n \nWork is led, performed, and\/or managed by the Army Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA and the Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny, NJ."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "78.109"
                },
                "CurrentYear": {
                    "val": "46.973"
                },
                "BudgetYearOne": {
                    "val": "38.831"
                },
                "BudgetYearOneBase": {
                    "val": "38.831"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "75.833"
                },
                "CurrentYear": {
                    "val": "55.973"
                },
                "BudgetYearOne": {
                    "val": "38.831"
                },
                "BudgetYearOneBase": {
                    "val": "38.831"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.276"
                },
                "CurrentYear": {
                    "val": "9.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "9.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.276"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "242"
                    },
                    "ProjectTitle": {
                        "val": "Airdrop Equipment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.113"
                        },
                        "CurrentYear": {
                            "val": "2.696"
                        },
                        "BudgetYearOne": {
                            "val": "3.618"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.618"
                        },
                        "BudgetYearTwo": {
                            "val": "3.704"
                        },
                        "BudgetYearThree": {
                            "val": "3.760"
                        },
                        "BudgetYearFour": {
                            "val": "3.802"
                        },
                        "BudgetYearFive": {
                            "val": "3.845"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates equipment and innovative techniques for precision aerial delivery of cargo and personnel. Aerial delivery is a key capability for rapid force projection and global precision delivery. These efforts are designed to advance state of the art precision delivery technologies such as parachutes, guidance, navigation, and control (GNC) components and subsystems, tracking sensors, software algorithms, and safety rigging which integrate with currently equipped aircraft, unmanned aerial systems (UAS), and advanced rotary wing aircraft. These efforts provide the Warfighter with highly accurate, timely cargo\/payload delivery and resupply in all terrain and weather conditions. Precision delivery\/resupply reduces vulnerability of ground Soldiers, aircraft, and aircrew. Precision aerial delivery supports remote warfare with activities such as placement of battlefield sensors, reduction of Soldier load, and initial delivery of key expeditionary base camp assets. Demonstrated technologies transition to Product Manager (PM)-Force Sustainment Systems (PM FSS), PM-Soldier Clothing and Individual Equipment (PM SCIE) as well as other Army PMs.\n\nEfforts in this Project support the Army Science and Technology Soldier\/Squad Portfolio.\n\nWork in this project is fully coordinated with program Element (PE) 0602786A (Warfighter Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Army Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airdrop\/Aerial Delivery"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates parachute materials and designs, precision guidance and navigation software and hardware, and tracking sensors and safety devices to increase the accuracy of delivering cargo to remote locations and\/or complex terrains. This effort also provides technologies that increase safety during personnel insertions into theaters of operations. This work further evolves breakthroughs from PE 0602786A\/Project 283 and is coordinated with PE 0602786A\/Project VT4. This effort supports capability demonstrations for the Army Top Challenge of easing overburdened Soldiers in small units through the use of tactical aerial resupply technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.113"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated in-flight Joint Precision Aerial Delivery System (JPADS) collision avoidance capability to reduce collision\/catastrophic damage and loss of vital supplies; matured precision delivery and landing accuracy for lifecycle cost reduction efficiencies and lower retrograde; began demonstration of next generation high altitude Parachutist Oxygen Breathing System technology to provide parachutists with sufficient oxygen at higher altitudes and with slower descent rates; optimized large scale helicopter auto hookup prototypes for multiple airdrops to increase ground operator safety; demonstrated both half- and full-scale technologies for passively stabilizing the flight characteristics with helicopter sling load payloads; demonstrated low-cost, low-weight skidboard to reduce materials and decrease manufacturing and transportation costs; matured and demonstrated a tactical aerial resupply capability to resupply\/unburden the small unit\/squad."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.696"
                                            },
                                            "Text": {
                                                "val": "Demonstrate precision airdrop functionality and reliability while intentionally interjecting faults into the system in order to gather statistical data in an operationally relevant environment; focus on accuracy and survivability improvements: guidance, navigation, and control improvements in heavy\/variable winds, cost reductions and minimization of retrograde weight\/volume; demonstrate and transition the high altitude low opening parachute capability for 100-500 lb. payloads utilizing main parachutes currently in the Army inventory; demonstrate auto hook up and improvement in payload stability for helicopter sling loads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.618"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.618"
                                            },
                                            "Text": {
                                                "val": "Will conduct multiple airdrop demonstrations of prototype adaptive flight software and hardware component technologies for precision aerial delivery systems that overcome rigging errors and broken control lines. These demonstrations will also validate parachute actuator placement, optimized parachute designs, parachute sensor capabilities, and airdrop system stealth capabilities in order to reduce the cost, weight, and logistics burden of utilizing aerial delivery systems; mature and demonstrate passive helicopter sling load stability concepts with operational payloads; demonstrate initial static line reserve parachute automatic activation device prototype on T-11R parachute with mannequins to validate utility."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "543"
                    },
                    "ProjectTitle": {
                        "val": "Ammunition Logistics"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.721"
                        },
                        "CurrentYear": {
                            "val": "2.738"
                        },
                        "BudgetYearOne": {
                            "val": "2.284"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.284"
                        },
                        "BudgetYearTwo": {
                            "val": "2.325"
                        },
                        "BudgetYearThree": {
                            "val": "2.341"
                        },
                        "BudgetYearFour": {
                            "val": "2.387"
                        },
                        "BudgetYearFive": {
                            "val": "2.435"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates technologies for rapidly deploying and resupplying munitions while also improving the return of unused ammunition from deployment. This effort contributes to force readiness and reduction in the logistics footprint through improvements in Materials Handling Equipment (MHE), ammunition, and lethality packaging\/palletization, explosives safety, weapons re-arm, and asset throughput\/management.\n\nEfforts in this project support the Army Science and Technology Lethality and Ground Maneuver Portfolios. Work in this project is related to, and fully coordinated with Program Element (PE) 0603005A and PE 0602601A. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy. \n\nWork in this project is performed and managed by the Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ in collaboration with the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automated Material Handling Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates smart sensors and robotic load handling equipment as add-on kits for side loading forklifts used in ammunition storage igloos and tactical forklifts to provide quick, safe, and cost effective transfer of munitions pallets between storage areas and transportation assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.335"
                                            },
                                            "Text": {
                                                "val": "Completed tactical navigation development and adapted robotic add-on kits to rough terrain environment for 5,000 lb forklift;  demonstrated the integrated system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.583"
                                            },
                                            "Text": {
                                                "val": "Complete development of the robotic add-on kit for rough terrain 5,000 lb forklift and conduct the final demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Safety for Automated Base Camp Planning"
                                    },
                                    "Description": {
                                        "val": "This effort integrates explosives safety site planning software with the automated base camp planning tool to reduce the time to plan base camps and improve Soldier safety."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.386"
                                            },
                                            "Text": {
                                                "val": "Completed database and ammunition planning\/management software module integration; validated the module compatibility with base camp planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Complete validation testing of ammunition planning\/management software module with ammunition management system; conduct integrated demonstration with the Virtual Forward Operating Base (VFOB) planning tool."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Total Ammunition Logistics Knowledge (TALK)"
                                    },
                                    "Description": {
                                        "val": "This effort will develop state of the art embedded micro sensors and Automated Identification Technologies that provide the capability for ammunition to communicate key characteristics, or information about itself to various interrogators throughout the logistics life-cycle from the ammunition load plant to the weapon in the field to improve ammunition management, reliability, and performance."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.755"
                                            },
                                            "Text": {
                                                "val": "Conduct preliminary design of environmental monitoring and data delivery mechanisms for artillery ammunition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automated Supply Point-Scaleable"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates globally responsive supply point operations capable of meeting predictive demand through automated cargo identification, handling, and movement technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.284"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.284"
                                            },
                                            "Text": {
                                                "val": "Will develop software architecture for the command, control, and integration of Automated Supply Point – Scalable operational functions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C07"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Combat Feeding Tech Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.979"
                        },
                        "CurrentYear": {
                            "val": "2.155"
                        },
                        "BudgetYearOne": {
                            "val": "2.134"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.134"
                        },
                        "BudgetYearTwo": {
                            "val": "2.165"
                        },
                        "BudgetYearThree": {
                            "val": "2.203"
                        },
                        "BudgetYearFour": {
                            "val": "2.278"
                        },
                        "BudgetYearFive": {
                            "val": "2.357"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates technologies for military combat feeding systems and combat rations. Areas of emphasis include: enhanced nutrient composition to maximize cognitive and physical performance on the battlefield; cutting edge food stabilization and preservation techniques that increase the variety and quality of rations used by the Joint Services; novel ration packaging solutions to minimize degradation of combat rations during storage; field portable biosensors for food-borne pathogen detection and identification as well as predictive modeling tools to protect the Warfighter from food-borne illnesses. This project demonstrates combat feeding equipment with reduced logistics (in component parts, weight, volume, fuel, and water) and labor requirements, while improving the quality of food service. The project, a Department of Defense (DoD) program for which the Army has Executive Agent responsibility, provides technology development for Joint Service Combat Feeding. The DoD Combat Feeding Research and Engineering Board provides oversight for this project. Demonstrated field feeding equipment is transitioned to Product Manager (PM)-Force Sustainment Systems (PM FSS).\n\nEfforts in this Project support the Army Science and Technology Soldier\/Squad Portfolio.\n\nWork in this project complements and is fully coordinated with Program Element (PE) 0602787A (Medical Technology) and PE 0602786A (Warfighter Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Army Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Combat Feeding Equipment and Food Protection Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates technologies in support of the DoD Veterinary Service Activity (VSA) to improve field detection and identification capabilities of chemical and biological threats in foods. This effort provides new threat detection tools and sensors for food inspectors. This effort also demonstrates equipment and energy technologies to expand the capability and reduce the logistics footprint of field feeding systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.729"
                                            },
                                            "Text": {
                                                "val": "Demonstrated novel field sensor technologies to detect and identify toxic chemicals in food; evaluated and demonstrated commercial off the shelf technologies in support of DoD VSA mission; continued demonstration of novel technologies to improve fuel efficiency, increase operation in harsh environments and improve mean time between failure for field feeding equipment; demonstrated reduced reliance on field generators in field kitchens, thus decreasing fuel costs, resupply demands, and risk to logistics\/resupply personnel."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ration Stabilization and Nutrient Delivery Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates novel nutritional biochemistry, food processing, and packaging technologies to enhance nutrition, improve food stabilization, and optimize ration packaging to support Warfighter physical and cognitive performance on the battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "Demonstrated increased bio-availability and stability of phytonutrients within ration components to improve Warfighter performance and recovery time; validated safety, acceptability, cost, and shelf-life of rations processed in novel stabilization technologies for application to operational rations and extended shelf-life; demonstrated increased availability of nutrition components for Soldier post-mission physical recovery."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Service Combat Feeding Technical Demonstration"
                                    },
                                    "Description": {
                                        "val": "Beginning in Fiscal Year (FY) 2016, Joint Combat Feeding Equipment and Food Protection Technology Demonstration and Ration Stabilization and Nutrient Delivery Technology Demonstration will be combined and renamed to Joint Service Combat Feeding Technical Demonstration. This effort matures and demonstrates novel nutritional biochemistry, food processing, and packaging technologies to enhance nutrition, improve food stabilization, and optimize ration packaging to support Warfighter physical and cognitive performance on the battlefield. This effort will demonstrate technologies in support of DoD VSA to improve field detection and identification capabilities of chemical and biological threats in foods. This effort provides new threat detection tools and sensors for food inspectors. This effort also demonstrates equipment and energy technologies to expand the capability and reduce the logistics footprint of field feeding systems. This work further evolves breakthroughs from PE 0602786A\/Project H99 and is coordinated with PE 0602787A\/Project 869."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.155"
                                            },
                                            "Text": {
                                                "val": "Exploit and demonstrate novel field feeding technologies to promote Joint field feeding operations and reduce field feeding costs\/logistical footprint through increased commonality across Services, in support of DoD operational energy goals; demonstrate novel food pathogen extraction methods and commercial-of-the-shelf (COTS) diagnostic technologies; develop and demonstrate technologies to stabilize amino acids to improve protein quality and functionality; demonstrate novel ration processing techniques for significant cost reductions while expanding nutrient retention within shelf stable components; demonstrate technology for next generation of ration components with increased nutrient density to decrease sustainment burden, improve performance and reduce Soldier load; demonstrate novel ration packaging material technologies (e.g., bio-based hybrid materials) to  reduce ration packaging waste."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.134"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.134"
                                            },
                                            "Text": {
                                                "val": "Will fabricate and demonstrate modular and tailorable field feeding prototypes that reduce water demand, reduce waste generation, and are self-powered or externally powered with alternative fuel\/energy to improve sustainment maneuverability and reduce the logistical footprint and cost; validate diagnostic tools and sanitizing methodologies to detect and eliminate pathogens within ration systems; mature and demonstrate nutrient based strategies to enhance Soldier cognitive and physical performance; demonstrate alternative packaging and processing technologies to preserve nutrient retention and reduce costs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J50"
                    },
                    "ProjectTitle": {
                        "val": "Future Warrior Technology Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "46.611"
                        },
                        "CurrentYear": {
                            "val": "32.621"
                        },
                        "BudgetYearOne": {
                            "val": "26.550"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.550"
                        },
                        "BudgetYearTwo": {
                            "val": "29.310"
                        },
                        "BudgetYearThree": {
                            "val": "31.764"
                        },
                        "BudgetYearFour": {
                            "val": "32.364"
                        },
                        "BudgetYearFive": {
                            "val": "33.011"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, demonstrates, and integrates lightweight and multifunctional materials and components to provide the Soldier and small units with the most effective personal protection, electronics connectivity, and mission specific equipment while evaluating the potential to reduce physical weight, cognitive burden, and sustainment needs within the required protection and functional capabilities for the small unit. This project develops, matures, and maintains a Soldier Systems Engineering Architecture (SSEA) framework that corresponds with other major Army platforms. Efforts in this project focus on maturing, integrating, and demonstrating personal protection (such as armor, headgear, eyewear, and hearing protection), durable clothing for all weather conditions, and power management solutions. In addition, special focus is on understanding and demonstrating the impacts of physical and cognitive load on Soldier mission performance and quality of life by implementing strategies to reduce load and\/or optimize loads to reduce injuries. These efforts integrate geographically dispersed laboratory environments to conduct comprehensive assessments and report the technical viability of Soldier system solutions and conducts field demonstrations to obtain relevant feedback for user acceptance and performance validation.\n\nEfforts in this Project support the Army Science and Technology Soldier\/Squad Portfolio.\n\nWork in this project complements and is fully coordinated with Program Element (PE) 0602786A (Warfighter Technology), PE 0602618A (Ballistics Technology), PE 0602105A (Materials Technology), PE 0602787A (Medical Technology), PE 0602716A (Human Factors Engineering Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0603015A (Next Generation Training and Simulation Systems), PE 0602705A (Electronics and Electronic Devices), PE 0603710A (Night Vision Advanced Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), and PE 0603008A (Electronic Warfare Advanced Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Army Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier\/Small Unit Ballistic and Blast Protection"
                                    },
                                    "Description": {
                                        "val": "This effort utilizes a cross-disciplinary, human-focused approach to mature and demonstrate technologies that optimize tradeoffs in ballistic and blast protective component design. This effort focuses on maturing and demonstrating proven components that have potential to significantly increase protection for individual Soldiers and\/or reduce physical load at equal or better capability. This work is fully coordinated with PE 0602786A\/Project H98, PE 0602716A\/Project H70, and PE 0602705A\/Project H94. Demonstrated technologies will transition to various Program Executive Office (PEO)-Soldier Product Managers. This effort supports Force Protection capability demonstrations for Soldiers and Small Units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.900"
                                            },
                                            "Text": {
                                                "val": "Demonstrated combat eye protection technologies that provide 15% improved ballistic performance without degradation in optical quality and scratch resistance; provided weight versus threat-standoff trade space analysis to inform reduced weight small arms protective insert development; demonstrated relevant technologies and validated methods to enable assessment and verification of service life requirements for body armor components; developed knowledge products from successfully demonstrated protection technologies to allow for transition of test methodologies and human centric design parameters to inform current and future requirements, programs, and framework of Soldier Systems Engineering Architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.275"
                                            },
                                            "Text": {
                                                "val": "Optimize non-destructive inspection technologies for evaluation of effects of environmental aging and mechanical damage on helmet and armor system performance; integrate ballistic and blast protection capabilities into extremity protection equipment; exploit organ allometry data set to improve biofidelity of casualty reduction models and account for individual Soldier variability in design of optimized vital torso coverage area; verify and validate improved casualty reduction model with the ability to fully pose digitally scanned Soldier and equipment models in operationally relevant scenarios; demonstrate prototype of self-powering single lens protective eyewear system with sun, ballistic, and laser protective capabilities; demonstrate integration of active auditory protection with ballistic protection eyewear."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.202"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.202"
                                            },
                                            "Text": {
                                                "val": "Will complete demonstration of the improved single lens multi-threat protective eyewear system prototype; mature and optimize improved low velocity impact protection components for helmets; mature test device and methodology to validate anti-fogging properties of combat eyewear; optimize radiation detection methodologies for evaluating emerging active hearing protection products."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier\/Small Unit Multi-Threat Protection"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturing and demonstrating multifunctional protective component materials, sub-systems, and protection technologies that have potential to significantly increase protection of individual Soldiers. This work is fully coordinated with PE 0602786A\/Project H98, PE 0602716A\/Project H70, and PE 0602705A\/Project H94. Demonstrated technologies transition to various PEO-Soldier Product Managers. This effort supports Force Protection capability demonstrations for Soldiers and Small Units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.781"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated improved multifunctional protective textile technologies with enhanced durability, signature management performance, insect resistance, and flame resistance; matured and integrated hearing protection technology that mitigates noise exposure while maintaining auditory situational awareness; demonstrated the viability of using environmental\/biological hazard and injury analyses, along with materials performance data and uniform design features, as a means of designing uniforms that provide capability sets tailored to specific geographical regions; developed knowledge products from successfully demonstrated technologies to allow for transition of test methodologies and human centric design parameters to inform current and future requirements, programs, and framework of Soldier Systems Engineering Architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.560"
                                            },
                                            "Text": {
                                                "val": "Exploit the multi-threat protective technologies for clothing and individual equipment for various environmental conditions (e.g. tropical, arctic\/cold weather) to identify technology gaps and inform future requirements; demonstrate prototype uniforms with thermal signature management technologies in a wide range of environmental conditions; complete trade analysis of relative effects of pattern size and color on visual signature management; demonstrate improved flame resistant fabric with enhanced durability and reduced cost."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.836"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.836"
                                            },
                                            "Text": {
                                                "val": "Will mature multi-threat protective technologies for clothing and individual equipment in environmental extremes such as tropical and arctic; complete demonstration and validate performance of prototype uniforms with thermal signature management capabilities; fabricate and demonstrate improved multifunctional flame resistant fabrics with signature management capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier and Small Unit Systems Integration and Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates a breadth of Soldier and small unit capabilities across multiple mission sets and a wide range of environmental conditions. It integrates and influences test venue architectures and analytic designs to improve demonstration and experimentation capabilities relevant for Soldier\/Small Units. It also integrates and demonstrates relevant mature technologies from the Army Soldier Science and Technology community. This efforts supports risk reduction demonstrations and produces validated analytical results for decision makers. This effort is fully coordinated with PE 0602786A\/Project H98, PE 0603710A\/Project K70, PE 0602624A\/Project H18, PE 0603005A\/Project 497, PE 0603008A\/TR1, and PE 0603004A\/Project 232. In FY15, this effort supports capability demonstrations for the Army Top Challenge of easing overburdened Soldiers in small units and force protection for Soldiers and small units. In FY16, demonstration efforts for force protection for Soldiers and small units will be captured within Soldier\/Small Unit Multi-Threat Protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.846"
                                            },
                                            "Text": {
                                                "val": "Conducted integrated, operationally-relevant systems-level demonstrations with the potential to increase protective equipment performance against a wide range of threats while decreasing weight; conducted system assessment and documented system performance parameters for a dismounted route planning tool, which interfaces with three existing military mission planning platforms; matured and demonstrated tactically relevant performance of handheld unmanned sensor platform in simulated operational environments; demonstrated capabilities to offload Soldier's carried weight such as providing Soldier the ability to digitally request and track aerial resupply missions in real-time and combining various offloading technologies for Small Unit operations; participated in significant Army demonstrations, exercises, and war games to demonstrate Soldier and Small Unit capabilities in below battalion level operations in order to inform future S&T efforts, close capability gaps, and inform S&T prioritization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Systems Engineering Architecture (SSEA)"
                                    },
                                    "Description": {
                                        "val": "This effort pursues a mature and maintainable architecture for a biological (human) platform that utilizes a common Soldier, Equipment, Task (SET) framework at the system level. The architecture will provide a unifying performance construct that considers human dimension and equipment capability resulting in a desired tactical outcome by applying systems engineering processes, analytical tools, and models to assess the complex Soldier as a System and conduct system level trade-offs. This capability is used to assess new and emerging Soldier clothing and equipment components as well as configurations against established baselines using Human-in-the-Loop principles. This effort also matures and integrates associated foundational efforts including human performance assessment measures and evaluation devices required at various testing locations. This effort develops standardized methodologies required for demonstrations to provide operationally relevant assessments. This effort is coordinated with PE 0602716A\/Project H70, PE 0602786A\/Project H98, 0603015A\/Project S28, PE 0603710A\/Project K70, PE 0602308A\/Project C90, PE 0602787A\/Project 869, and PE 0603004A\/Project 232."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.854"
                                            },
                                            "Text": {
                                                "val": "Led the Army development and maturation of the SSEA using the SET framework developed during FY14 for conducting assessments and decomposing identified needs into measures of performance and system requirements; identified required improvements to modeling and simulation capabilities to perform and support quantitative analyses and evaluations; developed the Soldier biological (human) platform architecture, and Soldier and squad level metrics gaps; enhanced capabilities for virtual simulation for Soldier and small units; advanced data collection tools to support the integration and measurement of the effects of Soldier-worn equipment in the SSEA; exercised the architecture as it is developed to test and refine its capabilities; provided knowledge products such as verified component and system performance data, TRL assessments, trade-off analyses, and standardized performance metrics for capability demonstrations and acquisition decisions and future requirements development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.261"
                                            },
                                            "Text": {
                                                "val": "Continue to build the systems engineering framework by collecting, analyzing, and cataloging equipment technical data, current training and human performance measures and metrics, dismounted modeling capabilities, test methods and measures, and the technical attributes of current human systems and subsystems interfaces to determine compatibility gaps among all capability areas for integration into the SET framework; mature the framework to create design criteria to experiment, demonstrate, verify, and validate technical maturity and military utility of future technologies; integrate logical structure and shared repository for the Soldier community; demonstrate SSEA capabilities with pilot case studies by conducting analysis of human physical, cognitive, and social characteristics to predict Soldier performance outcomes for human optimization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.795"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.795"
                                            },
                                            "Text": {
                                                "val": "Will optimize, refine, and streamline the system engineering tools and processes which were developed to support the Soldier as a System capability; continue integration of tools and processes against specific pilot projects to demonstrate the benefits of SSEA against cognitive, physical, and social aspects of Soldier performance; exploit performance assessment methodologies to identify personal sensing suite; mature the population-level analysis design tool for creating a human model of a Soldier's size and shape based on statistical methods; mature the repeatable standard method for obtaining accurate 3 Dimensional (3D) models of equipped Warfighters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier and Small Unit Mission Command\/Situational Awareness (SA) and Power and Energy Integration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates mission command and power and energy technologies for the dismounted Soldier and small unit. The goal is to fully support the situational awareness mission information tools and power needs of a dismounted mission in an electronically equipped battlefield. This effort is fully coordinated with PE 0602705A\/Project H11, PE0602705A\/Project H94, and PE 0603710A\/Project K70."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.819"
                                            },
                                            "Text": {
                                                "val": "Begin to integrate situational awareness and power capabilities to include information portrayal software, display technology, data collection and analyzing devices, and augmented reality display overlays that provide terrain and structures information in addition to entities appearing from local and remote reference sources, route planning altitude, and heat into mobility planning tools; assess cognitive load associated with all mission information systems; improve the capability of Soldier integration lab live simulation by integrating cognitive measures into operational scenarios (e.g., cordon and search); integrate and demonstrate mission performance impacts using handheld information portrayal technologies for applications such as aerial resupply and factors related to Soldier readiness; mature and demonstrate kinetic power generating capabilities integrated into existing clothing and individual equipment from Soldiers' movement (e.g., knee movement) to reduce power requirements and resupply needs for Soldiers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.359"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.359"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate proof of principle concepts of near term technologies such as wireless power transfer and distribution, wireless personal area network, energy harvesting, portable power management, and integrated power and data situational awareness; validate power and energy investments through analyses that consider component technologies as well as viability of integration onto the Soldier system and within the operational framework; mature and demonstrate the integration mission information technologies for situational awareness such as augmented reality and information portrayal on head-borne devices; mature and demonstrate the complex human systems integration challenges of situational understanding from tactical handheld devices used by dismounted Soldiers; demonstrate efficiency and safe levels of power transfer for small unit power."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier and Small Unit Human Systems Performance"
                                    },
                                    "Description": {
                                        "val": "This effort matures and validates human performance metrics (e.g., physiological, psychophysical, biomechanical, etc.) which have the potential to reduce or mitigate negative impacts of Soldier physical carried load and improve operationally relevant human performance. This work is fully coordinated with PE 0602786A\/Project H98, PE 0602716A\/Project H70, and PE 0602705A\/Project H94. Technologies, metrics, and tools developed in this effort will transition to PEO Product Managers and TRADOC and be integrated into the SSEA and Systems Integration Laboratory environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.230"
                                            },
                                            "Text": {
                                                "val": "Validated individual Soldier mission relevant human performance metrics sensitive to equipment load and fatigue; optimized operationally relevant physical and cognitive measures to quantify the effect associated with physically and mentally demanding workloads; provided data and modeling approaches whose outputs make explicit trade-space between human functional capability and equipment configuration that supports informed technology development; field-validated laboratory data on changes in biomechanical and cognitive performance as a function of mission-contextual factors to determine the impact of Soldier borne load on mission performance; matured personal augmentation design for opportunities such as simple mechanical augmentation; transitioned mature knowledge products for human performance (e.g., thermal burden models, load-related metabolic energy cost, etc.); validated operationally relevant human performance metrics under current clothing and individual equipment (CIE) configurations that can be used in future testing to demonstrate the impacts of the configuration on the individual's performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.706"
                                            },
                                            "Text": {
                                                "val": "Optimize biomechanics tools and metrics to quantify performance effects of Soldier and small unit load and protective clothing on Soldier effectiveness; correlate operational field relevance with laboratory research to mimic impacts of physical fatigue, load redistribution, personal augmentation, agility, and weight sensitivity on performance and injury; demonstrate algorithms on biomechanical and cognitive performance changes as a function of time, terrain, and load, which can be input to mission planning tools and other modeling efforts; establish the impact of load carriage over variable grades to inform future requirements for load carriage; identify markers of fatigue that may predict declines in cognitive performance; optimize understanding of the effects of exoskeleton designs on gait and energy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.358"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.358"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate a dynamic visualization tool that utilizes existing measures of physical, cognitive, and social performance across a spectrum of operational missions; expand ability to predict human performance outcomes through the application of metrics transitioned from applied research; compare and demonstrate human systems integration tools and simulations against operational tasks and missions to correlate lab to field data to strengthen prediction of Soldier and squad performance; demonstrate ability to measure impacts of technologies such as information portrayal to optimize Soldier and squad performance (e.g. increased resilience and readiness) for increased overmatch."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J52"
                    },
                    "ProjectTitle": {
                        "val": "WARFIGHTER ADVANCED TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.000"
                        },
                        "CurrentYear": {
                            "val": "9.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Warfighter Advanced Technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1.000"
                                        },
                                        "Text": {
                                            "val": "Program increase for warfighter advanced technology"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "9.000"
                                        },
                                        "Text": {
                                            "val": "Program increase for warfighter advanced technology"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Control Systems"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "12.000"
                                        },
                                        "Text": {
                                            "val": "Congressional increase for Environmental Control Systems"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VT5"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Mobile Base Camp Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.409"
                        },
                        "CurrentYear": {
                            "val": "6.763"
                        },
                        "BudgetYearOne": {
                            "val": "4.245"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.245"
                        },
                        "BudgetYearTwo": {
                            "val": "3.433"
                        },
                        "BudgetYearThree": {
                            "val": "3.455"
                        },
                        "BudgetYearFour": {
                            "val": "3.524"
                        },
                        "BudgetYearFive": {
                            "val": "3.594"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates mission-specific plug and play components, subsystems, and modules designed to optimize manpower requirements, improve situational awareness, increase Soldier readiness and survivability, improve habitation, reduce logistics footprint, enhance supportability, and reduce cost. Expeditionary Base Camp (EBC) systems (or remote command outposts) provide an operational capability for Small Combat Units (battalion and below) and Soldiers, which are rapidly deployable\/re-locatable, require no Military Construction, and need limited materiel handing support. The need for this technologically enabled capability has arisen as a result of new tactics, techniques, and procedures used in austere, remote, and challenging environments in which stability operations, counterinsurgency operations, and peace keeping missions are conducted. The Army envisions continuing to conduct this full range of operations worldwide, particularly in the Asia Pacific and Middle East regions. This project integrates mature technologies to create mission specific lab demonstrators and assesses the performance capabilities using metrics and methodologies developed under PE 0602786A\/Project VT4. Demonstrated EBC equipment is transitioned to Product Manager (PM)-Force Sustainment Systems (PM FSS).\n\nEfforts in this project support the Army Science and Technology Soldier\/Squad Portfolio.\n\nWork in this project complements and is fully coordinated with Program Element (PE) 0602786A (Warfighter Technology), PE 0602105A (Materials Technology), PE 0602784A (Military Engineering Technology), PE 0603734A (Military Engineering Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this project is led, performed, and\/or managed by the Army Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Base Camp (EBC) Technology Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies required to plan, establish, operate, protect, sustain, and redeploy a holistic small unit base camp system and manage its power, waste, and water resources. This effort supports Basing Sustainment and Logistics capability demonstrations. This work further evolves breakthroughs from PE 0602786A\/Project VT4, PE 0602786A\/Project H99 and is coordinated with PE0603001A\/Project C07, PE0602105A\/Project H84, PE 0602784A\/Project T40, PE 0603734A\/Project T08, PE 0603004A\/Project L97, PE 0603005A\/Project 497, PE 0603125A\/Project DF5, and PE 0603772A\/Project 101."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.409"
                                            },
                                            "Text": {
                                                "val": "Began demonstrations of integrated\/matured technology and non-material solutions for reducing small contingency base operation sustainment requirements thru more efficient management of energy and water consumption and solid\/liquid waste production; demonstrated self-sustaining living module(s); integrated technology concept(s) and systems engineering models for handling and treatment of black waste and demonstrated technical feasibility; matured, analyzed, and demonstrated water demand reduction technologies for developing a method to trade off net water savings with potential energy consumption increases; further improved photovoltaic power generating solar shade system technology for demonstration; optimized concepts, models, components, and systems for sustainability\/logistics demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.763"
                                            },
                                            "Text": {
                                                "val": "Validate base camp technology component performance data using a model-based systems engineering approach with approved sustainability and logistics baseline; optimize technology integration to improve small contingency base camp operations and conduct integrated demonstrations; mature and demonstrate water demand reduction technologies to reduce logistical tail to base operations; demonstrate integrated components of the black waste treatment technologies; optimize a highly mobile shelter design to enable a leaner force and a highly expeditionary force; demonstrate cooling technologies for small basing applications that will decrease logistic demands and improve Soldier readiness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.245"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.245"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate improved flame resistance shelter systems to ensure safe living environments for Soldiers; provide a fully integrated base camp system demonstration that reduces fuel and water demands, resupplies, and waste backhaul; demonstrate rapidly deployable compact and lightweight shelter technologies that reduce shelter set-up time and manpower requirements, increase transportability, and improve shelter protection from ballistic threats; optimize manufacturing processes for novel shelter materials to improve material performance for cost savings."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}