{
    "id": "e8a9cc024c65459e209896eb0db80efc8157bf7c",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602204F"
        },
        "ProgramElementTitle": {
            "val": "Aerospace Sensors"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "118.654"
            },
            "CurrentYear": {
                "val": "152.175"
            },
            "BudgetYearOne": {
                "val": "155.174"
            },
            "BudgetYearOneBase": {
                "val": "155.174"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "162.992"
            },
            "BudgetYearThree": {
                "val": "164.291"
            },
            "BudgetYearFour": {
                "val": "167.682"
            },
            "BudgetYearFive": {
                "val": "169.931"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops the technology base for Air Force aerospace sensors and electronic combat.  Advances in aerospace sensors are required to increase combat effectiveness by providing anytime, anywhere surveillance, reconnaissance, precision targeting, and electronic warfare capabilities.  To achieve this progress, this program pursues simultaneous advances in:  1) generating, controlling, receiving, and processing electronic and photonic signals for radio frequency (RF) sensor aerospace applications; 2) electro-optical (EO) aerospace sensor technologies for a variety of offensive and defensive uses; 3) RF antennas and associated electronics for airborne and space surveillance, together with active and passive EO sensors; 4) technologies to manage and fuse on-board sensor information for timely, comprehensive situational awareness; and 5) technology for reliable, all-weather surveillance, reconnaissance, and precision strike RF sensors and electronic combat systems.  This program has been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  \n\nStarting in FY 2017 to improve reporting to Congress, Project 622005, Cyber Technology was created to capture all cyber activity that was previously performed in this program.\n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "118.321"
                },
                "CurrentYear": {
                    "val": "147.291"
                },
                "BudgetYearOne": {
                    "val": "173.838"
                },
                "BudgetYearOneBase": {
                    "val": "173.838"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "118.654"
                },
                "CurrentYear": {
                    "val": "152.175"
                },
                "BudgetYearOne": {
                    "val": "155.174"
                },
                "BudgetYearOneBase": {
                    "val": "155.174"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.333"
                },
                "CurrentYear": {
                    "val": "4.884"
                },
                "BudgetYearOne": {
                    "val": "-18.664"
                },
                "BudgetYearOneBase": {
                    "val": "-18.664"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.116"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "5.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.524"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.191"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-18.664"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-18.664"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2015 reflects reprogramming to support Research and Development Projects, 10 U.S.C. Section 2358\n\nDecrease in FY 2017 due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "622002"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Component Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.194"
                        },
                        "CurrentYear": {
                            "val": "38.234"
                        },
                        "BudgetYearOne": {
                            "val": "41.326"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.326"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "41.991"
                        },
                        "BudgetYearThree": {
                            "val": "42.115"
                        },
                        "BudgetYearFour": {
                            "val": "42.927"
                        },
                        "BudgetYearFive": {
                            "val": "43.495"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project focuses on generating, controlling, receiving, and processing electronic signals for RF sensor aerospace applications.  The enabling technologies developed under this project will be used for intelligence, surveillance, reconnaissance (ISR), electronic warfare, battlespace access, and precision engagement capabilities.  The technologies developed include exploratory device concepts; solid state power devices and amplifiers; low noise and signal control components; photonic components; high-temperature electronics; signal control and distribution; signal processing; multi-function monolithic integrated circuits; high-speed analog-to-digital and digital-to-analog mixed mode integrated circuits; reconfigurable electronics; power distribution; multi-chip modules; and high density packaging and interconnect technologies.  This project also designs, develops, fabricates, and evaluates techniques for integrating combinations of these electronic component technologies.  The project aims to demonstrate significantly improved military sensors of smaller size, lower weight, lower cost, lower power dissipation, higher reliability, and improved performance.  The device and component technology developments under this project are military unique; they are based on Air Force and other Department of Defense weapon systems requirements in the areas of radar, communications, electronic warfare, navigation, and smart weapons."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multifunction Sensor Subsystems"
                                    },
                                    "Description": {
                                        "val": "Develop, analyze, demonstrate, and perform engineering trade studies for technologies for compact, affordable, multi-function subsystems for aerospace sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.120"
                                            },
                                            "Text": {
                                                "val": "Developed, refined and demonstrated advanced trade space and prediction tools for emerging devices. Completed engineering trade analysis for baseline sensing system technologies. Continued development of trade space models for advanced system of systems sensing and electronic warfare simulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.222"
                                            },
                                            "Text": {
                                                "val": "Complete baseline trade space models for use in advanced system of systems simulations. Complete advanced trade space tools for emerging technologies. Continue development of advanced prediction tools. Initiate next level of fidelity models for advanced future multifunction subsystem concepts. Initiate prototype multi-function demonstrations of concepts determined through analysis and design tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.961"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.961"
                                            },
                                            "Text": {
                                                "val": "Complete development of next generation advanced prediction tools. Refine fidelity of models for multifunction subsystem concepts. Continue to develop and optimize multi-function prototypes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Microelectronic\/Optoelectronic Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and assess new microelectronic\/optoelectronic material, device and fabrication technologies for next generation imaging, precision strike, and battlespace access across all Air Force domains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.061"
                                            },
                                            "Text": {
                                                "val": "Completed device concept baseline for multi-use (sense environments and counter threat) applications. Continued the identification and evaluation of concepts for compact, high performance devices and components. Demonstrated projected gains through characterization of test articles in relevant environments. Continued development of tools and methods to design and analyze game-changing components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.145"
                                            },
                                            "Text": {
                                                "val": "Complete identification and evaluation of innovative concepts for generation after next compact, high performance devices and components. Demonstrate prototype of a highly integrated microsystem. Continue to refine tools and methods to design, build and analyze game changing component technologies. Initiate evaluation of emerging component technologies against device concept baseline for multi-use applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.987"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.987"
                                            },
                                            "Text": {
                                                "val": "Continue to refine tools and methods to design, build, and analyze game changing component technologies. Continue evaluation of emerging component technologies against device concept baseline for multi-use applications. Initiate exploration and identification of next generation device concepts exploiting breakthrough materials discovery."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Antennas"
                                    },
                                    "Description": {
                                        "val": "Design and develop antenna subsystems and components for airborne and space-based surveillance. Develop novel and advanced antennas for lightweight, conformal arrays."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.763"
                                            },
                                            "Text": {
                                                "val": "Continued fabrication and characterization of innovative devices to extend bandwidth, reconfigurability, tunability, and trustworthiness. Continued demonstrations of multi-wavelength, agile and affordable advanced detectors and arrays with emphasis on integrated filtering. Continued the design and fabrication of high-brightness and agile waveform sources to integrate into microsystems and subsystems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.417"
                                            },
                                            "Text": {
                                                "val": "Continue to explore and evaluate innovative devices for increase bandwidth and tunability. Continue demonstrations of multi-wavelength, agile and affordable advanced detectors and arrays. Complete characterization and evaluation of novel high-brightness and agile waveform source."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.851"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.851"
                                            },
                                            "Text": {
                                                "val": "Continue to explore and evaluate innovative materials and devices for reduced cost, size, weight and power consumption. Initiate identification of novel device concepts exploiting new material discoveries. Complete demonstration of current advanced multi-wavelength, agile and affordable advanced detector and array."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Systems for ISR and Avionics Systems"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop designs of trusted electronic and optoelectronic systems when integrating commercially available solutions (commercial-off-the-shelf (COTS)) with emerging government-off-the-shelf (GOTS) advanced technologies. Areas of development include: multi-function RF and EO subsystems, advanced electronic and optoelectronic materials, on-board sensor processing, high-frequency power modules, Electro-Optical\/Infrared (EO\/IR) sources, EO\/IR detectors, beam control and waveguides, and trusted and reliable electronics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.250"
                                            },
                                            "Text": {
                                                "val": "Continued the identification of COTS and GOTS technologies nearly ready or ready for integration into microsystem and subsystem demonstration. Developed, matured and demonstrated solutions utilizing COTS\/GOTS technology that enable cyber-hardness, rad-hardness and resistance to tampering."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.190"
                                            },
                                            "Text": {
                                                "val": "Demonstrate trusted sensing and electronic warfare subsystem technologies utilizing the integration of low-cost commercially available electronics with exquisite emerging military electronics. Initiate vulnerability model and simulation capability to assess cost and liability of trust in electronics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.686"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.686"
                                            },
                                            "Text": {
                                                "val": "Demonstrate latest ability to determine trust in design and trust in fabrication of highly integrated microsystems. Continue modeling and simulation architecture development to inform and predict mission assurance for highly integrated microsystems, devices and materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Components for Electronic Warfare"
                                    },
                                    "Description": {
                                        "val": "Develop, mature, and demonstrate critical electronic technologies to enable revolutionary electronic warfare subsytems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.260"
                                            },
                                            "Text": {
                                                "val": "For FY 2015, the work for this effort originally was performed in Project 622003, EO Sensors & Countermeasures Tech, under the effort EO\/IR Sensors and Threat Countermeasures Technologies. \n\nDevelop, mature and demonstrate critical electronics technologies to enable highly agile, closed loop sense, learn and adapt revolutionary electronic warfare subsystems. Demonstrate advancements in real time hardware configurability and the integration at the microsystem level of electrons and photons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.841"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.841"
                                            },
                                            "Text": {
                                                "val": "Continue to develop, mature and demonstrate technologies critical to advanced cognitive and networked electronic warfare subsystems and components. Identify and exploit advanced devices and microsystems to enable highly miniature and affordable Electronic Warfare (EW) systems. Continue to demonstrate advancements of real time hardware configurability through integration of electrons and photons at the microsystem level."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622003"
                    },
                    "ProjectTitle": {
                        "val": "EO Sensors & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.387"
                        },
                        "CurrentYear": {
                            "val": "26.805"
                        },
                        "BudgetYearOne": {
                            "val": "21.535"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.535"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "26.813"
                        },
                        "BudgetYearThree": {
                            "val": "26.979"
                        },
                        "BudgetYearFour": {
                            "val": "27.556"
                        },
                        "BudgetYearFive": {
                            "val": "27.974"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project determines the technical feasibility of advanced electro-optical aerospace sensor technologies for a variety of offensive and defensive uses.  The sensor technologies under development range from the ultraviolet through the infrared portion of the spectrum.  Related efforts include improvements in avionics integration, digital processing, analysis tools, and sensor architectures.  One of the project's main goals is to improve electro-optical and related technologies for the detection, tracking, and identification of non-cooperative and difficult targets, such as those obscured by camouflage.  This project also develops the passive and active imaging sensors and algorithms needed to enable precision targeting in severe weather. These technologies are critical to future aerospace surveillance and targeting.  Other project goals include advanced electro-optical threat warning and countermeasures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Non-cooperative Detection and Identification Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop innovative optical sensing technology for non-cooperative detection and identification of airborne and ground-based targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.864"
                                            },
                                            "Text": {
                                                "val": "Evaluated, via modeling and simulation, innovative sensor concepts to increase long range image quality for passive electro-optical and infrared reconnaissance sensors for high altitude platforms. Advanced longwave infrared hyperspectral imaging and determined operationally useful radiometric sensitivity and area coverage rate for a sensor system that is practical and affordable."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016 and beyond, work accomplished under this effort will be reported under the effort Passive EO\/IR Sensing in Contested Environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EO\/IR Sensors and  Threat Countermeasure Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop optical and infrared sensors for airborne and space situational awareness and threat warning. Develop countermeasure technologies for use against infrared and electro-optical guided missile threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.791"
                                            },
                                            "Text": {
                                                "val": "Initiated synthetic aperture ladar (SAL) techniques based on modeling and simulation previously conducted to enhance spatial resolution beyond the diffraction limit of conventional optics through the coherent collection and processing of laser illuminated scene radiance.  Advanced research to improve system capabilities and provide high confidence target identification at standoff ranges for both reconnaissance and targeting platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016 and beyond, work accomplished under this effort will be reported under the effort Laser Radar Sensing in Contested Environments and in project 622002, Electronic Component Technology, under the effort Advanced Components for Electronic Warfare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop optical spectrum transmitter, detector and agile aperture technologies capable of sensing multiple target characteristics for robust non-cooperative target identification and future infrared countermeasure systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.732"
                                            },
                                            "Text": {
                                                "val": "Initiated research in the use of vibrometry and range-Doppler sensing technology to aid in target identification and decoy discrimination at ranges at which the imaging performance is insufficient. Supported phenomenology understanding, signature collection, sensor product visualization, and automatic target recognition in collaboration with other Air Force Research Laboratory directorates. Continued prototyping of a flexible, next generation long wave infrared hyperspectral imaging spectrometer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016 and beyond, work accomplished under this effort will be reported under the effort Passive EO\/IR Sensing in Contested Environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Passive EO\/IR Sensing in Contested Environments"
                                    },
                                    "Description": {
                                        "val": "Develop innovative passive optical sensing technology to support surveillance and reconnaissance in contested environments.  Develop high performance focal planes, aperture technologies and imaging techniques capable of long range target detection and characterization for ISR."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.917"
                                            },
                                            "Text": {
                                                "val": "For FY 2015, the work for this effort originally was performed under the effort Optical Technologies.\n\nEvaluate, via modeling and simulation, innovative sensor concepts to increase long range image quality for high altitude passive electro-optical and infrared reconnaissance sensors at twice the current operational range.  Conduct initial demonstrations of the effectiveness of computational image restoration and noise reduction.  Refine and demonstrate candidate component technologies for jitter mitigation and restoration in the presence of deep turbulence.  Investigate system-level impacts of image restoration technology using a commercial reconnaissance sensor and platform.  Determine the utility of non-traditional sensor architectures in improving image quality and the operational range of passive imagers.  Mature longwave infrared hyperspectral imaging to achieve operationally useful radiometric sensitivity, detection performance, and area coverage rates at far off nadir viewing geometries.  Continue prototyping of a flexible, next generation long wave infrared hyperspectral imaging spectrometer.  Complete evaluations of prototype Silicon-Gallium (SiGa) long wave infrared detectors at high operating temperatures. Continue investigation of high performance long wave infrared detectors for hyperspectral imaging.  Initiate technology developments for next generation infrared search and track (IRST) components and systems focused on performance in clutter using staring focal planes and reduced complexity implementations. Adapt passive sensing models to support IRST technology trade analyses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.178"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.178"
                                            },
                                            "Text": {
                                                "val": "Evaluate, via modeling and simulation, innovative sensor concepts to increase long range image quality for high altitude passive electro-optical and infrared reconnaissance sensors at twice the current operational range.  Test prototype systems and subsystems as appropriate to assess progress towards goals.  Continue and advance demonstrations of the effectiveness of computational image restoration and noise reduction.  Refine and demonstrate candidate component (hardware and software) technologies for jitter mitigation and restoration in the presence of deep turbulence.  Demonstrate and test system-level impacts of image restoration technology using a relevant reconnaissance sensor and commercial platform. Continue the examination of non-traditional sensor architectures in improving image quality and the operational range of passive imagers. Demonstrate technologies and components supporting longwave infrared hyperspectral imaging at operationally useful radiometric sensitivity, detection performance, and area coverage rates at far off nadir viewing geometries. Continue prototyping of a flexible, next generation long wave infrared hyperspectral imaging spectrometer. Continue investigation of high performance long wave infrared detectors for hyperspectral imaging. Continue technology and architecture developments for next generation IRST components and systems focused on performance in clutter using novel optical concepts, staring focal planes, and reduced complexity implementations. Adapt passive sensing models to support IRST technology trade analyses.  Explore concepts for merging IRST sensing with other sensing modalities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser Radar Sensing in Contested Environments"
                                    },
                                    "Description": {
                                        "val": "Develop innovative laser sensing technology for non-cooperative detection and identification of airborne and ground-based targets in contested environments.  Develop optical spectrum transmitters, detectors and agile aperture technologies capable of sensing multiple target characteristics for robust non-cooperative target identification and future infrared countermeasure systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.888"
                                            },
                                            "Text": {
                                                "val": "For FY 2015, the work for this effort originally was performed under the effort EO\/IR Sensors and Threat Countermeasure Technologies.\n\nDevelop synthetic aperture ladar (SAL) techniques based on modeling and simulation previously conducted to enhance spatial resolution beyond the diffraction limit of conventional optics.  Research the problem of improving system capabilities to provide high confidence target identification at standoff ranges for both reconnaissance and targeting platforms.  Continue fabrication and characterization of critical components for a long range SAL demonstration system. Design and fabricate next generation long range holographic aperture ladar imaging testbed focused on progression to platform compatible configurations. Continue research in the use of remote laser vibrometry and range-Doppler sensing technology to aid in target identification and decoy discrimination at ranges at which the imaging performance is insufficient.  Research will also support phenomenology understanding, signature collection, sensor product visualization, and automatic target recognition in collaboration with other Air Force Research Laboratory Technology Directorates.  Conduct laboratory testing of initial foundry runs of focal planes optimized for three dimensional and holographic imaging. Increase emphasis on applications for long range air-to-air ladar updating modeling and simulation, phenomenology measurement capabilities and to support utility analysis and system design and evaluations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.357"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.357"
                                            },
                                            "Text": {
                                                "val": "Advance developing SAL techniques to enhance spatial resolution beyond the diffraction limit of conventional optics. Continue research on technologies, architectures and components needed for improving system capabilities to provide high confidence target identification at standoff ranges for both reconnaissance and targeting platforms. Complete fabrication and characterization of critical components for a long range SAL demonstration system. Design, fabricate, test, and explore limitations of next generation long range holographic aperture ladar imaging testbed focused on progression to platform compatible configurations. Continue research in the use of remote laser vibrometry and range-Doppler sensing technology to aid in target identification and decoy discrimination at ranges at which the imaging performance is insufficient. Research will also support Phenomenology understanding, signature collection, sensor product visualization, and automatic target recognition in collaboration with other AFRL Directorates. Complete laboratory testing of initial foundry runs of focal planes optimized for three dimensional and holographic imaging. Increase emphasis on applications for long range air-to-air ladar updating modeling and simulation, phenomenology measurement capabilities and to support utility analysis and system design and evaluations.  Explore concepts for merging air-to-air sensing with other sensing modalities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622005"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "10.200"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.200"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.520"
                        },
                        "BudgetYearThree": {
                            "val": "6.649"
                        },
                        "BudgetYearFour": {
                            "val": "6.788"
                        },
                        "BudgetYearFive": {
                            "val": "6.855"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Project 622005, Cyber Technology is new for FY 2017. Work from this effort was previously performed under Project 627622, RF Sensors and Countermeasures Tech, in this program.\n\nThe goal of this activity is to develop adaptable and resilient hardware for real-time avionics cyber-attack pattern recognition and develop a protection system with the capability for autonomous learning, adaptation, and self-protection."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Malware Detection"
                                    },
                                    "Description": {
                                        "val": "Develop tools and capabilities to detect and classify malware in avionics software and firmware to preclude their introduction into avionics systems and, in the event of a system breech, develop capabilities to operate in the presence of the threat.  Activities in this area are focused on developing a feature set indicative of deceptive or malicious behavior that will be used in conjunction with machine learning algorithms to detect zero-day attacks on avionics systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.453"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.453"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort was performed in Project 627622, RF Sensors and Countermeasures Tech, under the effort RF Sensor Technologies.\n\nDevelop deception\/malware detection tools for x86-based hardware malware, and expand capability by using file size and instruction frequency to include additional feature sets. The selected feature set will be used in conjunction with existing machine learning algorithms to determine the detection rate and classification accuracy of these algorithms using known malware samples."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Cyber Protections"
                                    },
                                    "Description": {
                                        "val": "Develop adaptable and resilient hardware for real-time avionics cyber-attack pattern recognition and mitigation.  This activity will take a two-pronged approach to developing adaptable hardware required to support rapid avionics cyber-attack pattern recognition and build self-protecting avionics systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.747"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.747"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort was performed in Project 627622, RF Sensors and Countermeasures Tech, under the effort RF Sensor Technologies.\n\nThis will investigate the use of evolvable hardware to perform pattern recognition.  Demonstrate whether evolvable hardware in conjunction with evolvable mathematical algorithms can achieve advantage over existing pattern recognition algorithms and are applicable to avionics cyber protections."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "626095"
                    },
                    "ProjectTitle": {
                        "val": "Sensor Fusion Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.037"
                        },
                        "CurrentYear": {
                            "val": "27.359"
                        },
                        "BudgetYearOne": {
                            "val": "35.322"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.322"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "35.655"
                        },
                        "BudgetYearThree": {
                            "val": "36.262"
                        },
                        "BudgetYearFour": {
                            "val": "37.044"
                        },
                        "BudgetYearFive": {
                            "val": "37.544"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the technologies required to perform management and fusion of sensor information for timely, comprehensive situational awareness, automatic target recognition, integrated fire control, and bomb damage assessment.  This project determines the feasibility of technologies and concepts for fire control that help to precisely locate, identify, and target airborne and surface targets.  The project emphasizes finding reduced signature targets and targets of opportunity.  It will enable new covert tactics for successful air-to-air and air-to-surface strikes.  This project also develops the technologies required to create trusted autonomic, distributed, collaborative, and self-organizing sensor systems that provide anticipatory and ISR, situational awareness, and decision support for multi-layered sensing.  This program provides the technologies for:  1) trusted sensors and trusted sensor systems that will deter reverse engineering and exploitation of our critical hardware and software technology and impede unwanted technology transfer, alteration of system capability, and prevent the development of countermeasures to U.S. systems; 2) collaborative tasking of our own distributed heterogeneous sensor networks across a region and co-opted tasking of both traditional and non-traditional adversary sensors; 3) secure sensor web backbone technologies, sensor web physical topologies, and related protocols to assure reliable trusted sensor interactions; and 4) defining architectures for distributed trusted collaborative heterogeneous sensor systems and semantic sensor networks, developing new methodologies for system of systems sensor engineering and analysis, and new techniques for sensor network situation awareness and predictive analytics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automatic Target Recognition Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop automatic target recognition (ATR), sensor management, and sensor fusion technologies for target detection, tracking, and identification in ISR, and combat identification applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.051"
                                            },
                                            "Text": {
                                                "val": "Developed advanced object recognition methods which correlate data from multiple sensors from air, space and cyber domains.  Continued to assess and enhance physics-based techniques to meet the autonomous target detection and identification, sensor management, and sensor fusion requirements for intelligence, surveillance, and reconnaissance applications, combat identification applications, and Planning and Direction, Collection, Processing and Exploitation, Analysis and Production, and Dissemination - Experimentation (PCPAD-X) applications in contested and uncontested environments. Continued to assess and develop capabilities to represent and utilize sensor parameters and errors to improved fused geo-location accuracy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016 and beyond, work accomplished under this effort will be reported under the effort Distributed Sensing for ATR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Signature Modeling"
                                    },
                                    "Description": {
                                        "val": "Develop, evaluate, and demonstrate target signature models to support  sensor exploitation algorithm development and testing for reconnaissance and strike mission applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.080"
                                            },
                                            "Text": {
                                                "val": "Continued development of all-source target models for emerging threat systems in contested environments. Created and assessed methods for validating all-source signature models. Continued to mature target signature models for signature exploitation of multi-spectral systems and signals intelligence sensors.  Matured promising approaches to develop a single target model for application to all parts of the spectrum."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.814"
                                            },
                                            "Text": {
                                                "val": "Continue development of all-source target models for emerging threat systems in contested environments. Demonstrate maturing methods for validating all-source signature models. Continue maturing promising approaches to develop a single target model for application to all parts of the spectrum. Develop ground clutter modeling and reduced feature-set target signature prediction techniques for radio frequency sensors.  Initiate controlled data collections and high resolution feature database for emerging sensors.  Initiate implementation of advanced theoretical approaches to salient feature extraction from limited sensor data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.919"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.919"
                                            },
                                            "Text": {
                                                "val": "Continue development of all-source target models for emerging threat systems in contested environments. Demonstrate maturing methods for validating all-source signature models. Improve efficient target modeling representation to enable more rapid model development and reduce database storage requirements. Demonstrate ground clutter modeling and reduced feature-set target signature prediction techniques for radio frequency sensors. Continue controlled data collections and high resolution feature database for emerging sensors. Continue advanced theoretical approaches to salient feature extraction from limited sensor data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Exploitation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technical methods required for algorithm performance models, performance driven sensing, layered sensing and other sensing and exploitation technologies impacted by automated exploitation capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "Developed novel techniques for analysis of large sensor data sets to discover, characterize, and identify threatening activities in contested environments.  Continued development of sensor resource optimization enablers for autonomous sensor employment.  Continued development and validation of performance models for sensor exploitation technologies.  Demonstrate application of sensor and algorithm performance models in the PCPAD-X integrative and virtual environments.  Continued to enhance development of an integrated, unified ATR methodology through industry and university outreach."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.817"
                                            },
                                            "Text": {
                                                "val": "Initiate analysis of sensor data where the transmitter and receiver are from distinct platforms or sensing devices.  Develop and assess techniques for near real time extraction, representation, and analysis of multi-dimensional information from image sequences.  Continue development of novel techniques for analysis of large sensor data sets to discover, characterize, and identify threatening activities in contested environments.  Continue to demonstrate application of sensor and algorithm performance models in PCPAD-X.  Continue to enhance development of an integrated, unified ATR methodology through industry and university outreach."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.504"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.504"
                                            },
                                            "Text": {
                                                "val": "Continue analysis of sensor data where the transmitter and receiver are from distinct platforms or sensing devices. Develop and assess techniques for near real time extraction, representation, and analysis of multi-dimensional information from image sequences. Continue development of novel techniques for analysis of large sensor data sets to discover, characterize, and identify threatening activities in contested environments. Develop target classification techniques through deep learning methods and state of the art neural network methods."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, evaluate, and demonstrate methodologies, techniques, and strategies to instill trust in distributed, heterogeneous sensing systems within air, space, and cyber domains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.406"
                                            },
                                            "Text": {
                                                "val": "Initiated research in trusted exploitation algorithms and tools for PC-PAD, defining and quantifying metrics.  Built upon previous work in PCPAD-X to research application of trust metrics in the evaluation of COTS, GOTS, and contractor owned exploitation algorithms and tools to assure the mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016 and beyond, work accomplished under this effort will be reported under the effort Sensor Management for ATR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Management for ATR"
                                    },
                                    "Description": {
                                        "val": "Develop multi-platform and multi-sensor control strategies to create advantages for survival, autonomous sensing, and autonomous exploitation in contested environments.  Incorporate sensing platform kinematics and external operating conditions into analyses of effective multi-sensor control and multiple intelligence (multi-INT) data fusion capabilities.  Assess advantages of multi-sensor closed loop control techniques for platform survival, command and control, ISR, and strike missions.  Enhance existing ATR sensor management, and sensor fusion technologies by application of multi-sensor data and distributed data processing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.861"
                                            },
                                            "Text": {
                                                "val": "For FY15, the work for this effort was performed under the effort Trusted Sensing Technologies.\n\nDevelop exploration of multi-sensor inference and control approaches for autonomous operations. Develop metrics for assessing multi-sensor control techniques with regard to assured threat avoidance and optimal sensor positioning. Initiate size-weight-power-constrained processing assessment approaches for future platform on-board processing of multi-sensor data.   Define and develop multi-sensor performance assessment approaches for inclusion in PCPAD-X."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.910"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.910"
                                            },
                                            "Text": {
                                                "val": "Develop exploration of multisensory inference and control approaches for autonomous operations. Develop metrics for assessing multi-sensor control techniques with regard to assured threat avoidance and optimal sensor positioning. Initiate size-weight-power constrained processing assessment approaches for future platform on-board processing of multi-sensor data. Develop joint inference and control methods for challenging autonomous sensor operations management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Sensing for ATR"
                                    },
                                    "Description": {
                                        "val": "Develop techniques and metrics for adaptive, penetrating, distributed RF exploitation in contested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.867"
                                            },
                                            "Text": {
                                                "val": "For FY15, the work for this effort was performed under the effort Automatic Target Recognition Technologies.\n\nDevelop bi-static phenomenology models. Design new waveforms to exploit bi-static RF phenomenology.  Develop a systems theory for incorporating identification (ID) uncertainty in ATR algorithms. Develop distributed exploitation algorithms. Design a closed loop sensor mode controller for adaptive transmit and receive."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.989"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.989"
                                            },
                                            "Text": {
                                                "val": "Develop bi-static phenomenology models. Design new waveforms to exploit bi-static RF phenomenology. Develop a systems theory for incorporating ID uncertainty in ATR algorithms. Develop distributed exploitation algorithms. Design a closed -loop sensor mode controller for adaptive transmit and receive."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627622"
                    },
                    "ProjectTitle": {
                        "val": "RF Sensors and Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.036"
                        },
                        "CurrentYear": {
                            "val": "59.777"
                        },
                        "BudgetYearOne": {
                            "val": "46.791"
                        },
                        "BudgetYearOneBase": {
                            "val": "46.791"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "52.013"
                        },
                        "BudgetYearThree": {
                            "val": "52.286"
                        },
                        "BudgetYearFour": {
                            "val": "53.367"
                        },
                        "BudgetYearFive": {
                            "val": "54.063"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and assesses affordable, reliable all weather RF sensing and countermeasure concepts for aerospace applications covering the range of RF sensors including communications, navigation, ISR, and radar, both active and passive, across the air, land, sea, space and cyber domains.  This project also develops and evaluates technology for ISR sensors, fire control radars, electronic warfare, integrated radar and electronic warfare systems, and offensive information operations systems.  It emphasizes the detection and tracking of surface and airborne targets with RF signatures that are difficult to detect due to reduced radar cross sections, concealment and camouflage measures, severe clutter, or heavy jamming.  Techniques exploited include the use of multiple RF phenomenologies, multi-dimensional adaptive processing, advanced waveforms and knowledge-aided processing techniques.  This project also develops the RF warning and countermeasure technology for advanced electronic warfare and information operations applications. Specifically, it develops techniques and technologies to detect and counter the communications links and sensors of threat air defense systems and hostile command and control networks.  The project also exploits emerging technologies and components to provide increased capability for offensive and defensive RF sensors, including radar warning, RF electronic warfare, and electronic intelligence applications."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally directed effort"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop hybrid sensor solutions to be responsive to needs and detect difficult targets. Develop jam-resistant time, position, and velocity sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.939"
                                            },
                                            "Text": {
                                                "val": "Matured GPS augmentation technologies that take advantage of distributed platforms relaying Global Navigation Satellite Systems (GNSS) signals and georeferenced real-time imaging to improve GPS accuracy in GPS sparse or denied environments. Developed technologies that expand the ability to incorporate GNSS signals into the Global Positioning System (GPS) user equipment as a means to improve navigation signal reliability and availability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.082"
                                            },
                                            "Text": {
                                                "val": "Develop technologies to ensure robust and accurate navigation in GPS contested and denied environments.  Mature navigation augmentation and GPS resilience technologies, such as taking advantage of signals of opportunity, as well as environmental sensing, such as vision or magnetic sensors, to improve inertial measurement unit aided navigation accuracy in GPS sparse or denied environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.329"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.329"
                                            },
                                            "Text": {
                                                "val": "Provide a robust simulation environment to validate GPS receiver operation in sparse and denied environments to ascertain areas which require additional research to maintain accurate geolocation reporting.  Continue to work with allied nations (Australia, Canada, and the United Kingdom) to augment GPS capability through the use of GNSS for precise positioning, navigation, and timing information."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RF Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research and development for the advancement of passive and active RF sensors; including phenomenology, modeling and simulation, algorithm development, and experimentation.  Plan, execute, and maintain state-of-the-art RF sensor research and development facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.942"
                                            },
                                            "Text": {
                                                "val": "Continued research and development of agile waveforms, adaptive spectrum utilization techniques, and electromagnetic forensics sensing of the signal environment for robust adaptive RF sensing in contested spectrums and persistent stand-in RF sensing in denied environments.  Continued research and development of RF sensor technology, including: signals intelligence (SIGINT) hardware, algorithms, and techniques, passive radar techniques, and advanced receive array antenna technology with wideband and high dynamic range, for passive multimode radars and efficient combat identification capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.016"
                                            },
                                            "Text": {
                                                "val": "Initiate research on fully polarimetric bistatic RF ground target and clutter phenomenology and relevant ground vehicle dynamics for RF sensing. Continue research and development of RF sensor technologies, including antennas, electromagnetic structures, propagation in plasma medium, electromagnetic modeling & simulation, and prototype experimentation for efficient combat identification capabilities. Develop agile, spectrally efficient, radar waveforms and robust distributed sensing techniques for dominance in non-traditional RF environments.  Initiate development of electromagnetics forensics techniques for passive RF sensing and EW applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.655"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.655"
                                            },
                                            "Text": {
                                                "val": "For FY17 and beyond, advanced cyber technology development research under this effort will be reported in Project 622005, Cyber Technology, under efforts Malware Detection and Adaptive Cyber Protections.\n \nContinue research and development of fully polarimetric persistent representation of critical mobile targets and bistatic phenomenology with realistic low grazing angle. Develop electromagnetics based modelling, simulation, and measurement tools for propagation, scattering, and radiation application to improve RF sensors capabilities.  Continue development of agile, spectrally efficient, radar waveforms and robust distributed sensing techniques for dominance in non-traditional RF environments.  Continue development of advanced electromagnetic forensics techniques for passive RF and EW applications.  \n\nContinue to explore novel and advanced sensing technologies for use in demanding environments for future platform capability.  Develop methods to electronically attack passive sensing systems used by red forces to degrade this capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optimize RF Sensing Technology"
                                    },
                                    "Description": {
                                        "val": "Develop technology to reduce size, weight, and power of RF sensors. Develop technology to enable affordable upgrades and optimally control RF and multi-intelligence sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.195"
                                            },
                                            "Text": {
                                                "val": "Conducted Electro-Magnetic\/Electronic Warfare Battle Management (EM\/EWBM) research to optimize use of EW assets against current and future integrated air defense systems and RF threats.  Identified, developed and integrated improved electronics that reduce cost, size, weight and power of current EW systems to facilitate development of distributed EW jammers\/sensor systems.  Developed new approaches to protection of aircraft avionics systems and on-board data networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016 and beyond, work accomplished under this effort will be reported under the effort Sensor Resource Management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Band\/Multi-Beam Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop multi-band and multi-beam forming technologies.  Address technologies for antenna array operations in dynamic sensor networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.616"
                                            },
                                            "Text": {
                                                "val": "Identified advanced RF\/EO subsystem concepts to refine and update trade space capability. Completed the Multiple-Input Multiple-Output (MIMO) and waveform-diverse models for system and system of systems analysis. Initiated concept exploration for highly integrated, mostly digital microsystems for reconfigurable and tunable capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.928"
                                            },
                                            "Text": {
                                                "val": "Continue research in advanced RF\/EO subsystem concepts to support expendable RF systems configurations. Develop and demonstrate concepts to support expendable RF ISR sensors (Radar, SIGINT, Electronic Support, and Combat ID). Develop conformal RF antenna concepts from C Band to Ka-Band. Develop advanced geo-location algorithms for single and multiple platform operations. Continue research in highly integrated digital microsystems for reconfigurable and tunable capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.342"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.342"
                                            },
                                            "Text": {
                                                "val": "Develop test-bed vehicle for static and dynamic testing of RF\/EO sensors and algorithms.  Continue research and development of conformal RF antenna concepts from C-Band to Ka-Band.  Expand concepts to support expendable RF ISR sensors (Radar, SIGINT, Electronic Support, and Combat ID), demonstrate these capabilities for next-generation attritable platforms, and continue development of advanced geo-location algorithms for single and multiple platform operations. Continue research in highly integrated digital microsystems for reconfigurable and tunable capabilities.\n\nIn conjunction with development of multi-band, multi-beam technology for sensing capability, develop methods to detect use of this technique and countermeasures to mitigate its use for sensing blue force platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter RF Threat Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop aerospace platform jamming technologies and techniques to counter advanced radio-frequency (RF) threats associated with current and future aerospace weapons systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.344"
                                            },
                                            "Text": {
                                                "val": "Developed multi-faceted approaches to countering RF threats. Efforts included development of machine learning, autonomous systems to identify frequency agile and changing waveforms. Developed counter-countermeasures to digital radio frequency memory (DRFM) based jammers. Developed EM\/EWBM tools,and distributed EW techniques to counter state-of-the-art integrated air defense systems. Developed novel disruptive technologies that leverage cyber, directed energy, and machine learning to counter RF, EO\/IR threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2016 and beyond, work accomplished under this effort will be reported under the effort Sensor Resource Management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Resource Management"
                                    },
                                    "Description": {
                                        "val": "Develop technology to enable optimization of sensor resources in contested environments on own-ship and multi-ship in manned, unmanned and manned\/unmanned teaming concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.751"
                                            },
                                            "Text": {
                                                "val": "For FY 2015, the work for this effort originally was performed under the efforts, Optimize RF Sensing Technology and Counter RF Threat Technologies.\n\nDevelop distributed sensor management techniques utilizing an Open Mission Systems (OMS) context and Service Oriented Architecture (SOA) common set of messages and data models.  Use Electronic Warfare and Communications as first functional disciplines to initiate SOA constructs.  Initiate layered effects analyses on next generation RF based threats, counters and perform vulnerability assessments.  Initiate operational architecture and mission services through common mission control center constructs. Continue research of advanced Electronic Support (ES) concepts and exploration of adaptable Electronic Attack (EA) EA\/ES capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.465"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.465"
                                            },
                                            "Text": {
                                                "val": "Initiate development of additional functional disciplines (radar, EO\/IR, High Energy Laser) in the SOA and sensor resource optimization.  Initiate bandwidth efficient communication protocol research to support collaborative state estimation techniques to enable common model referencing for positioning navigation and timing (PNT) in GPS denied environments. Conduct electro-magnetic\/electronic warfare (EW) battle management optimization service research on electronic attack (EA) and electronic support (ES) and asses against current and future integrated air defense systems and RF threats. Develop robust modeling and simulation capability to study the efficiency versus effectiveness of distributed electronic warfare assets.  Continue research into effective management of electronic warfare assets in operational environments focusing on a multi-ship strike package employment.  Refine and augment open mission standards (OMS) to facilitate electronic warfare capability.  Solidify protocol messaging to enable introduction of new technologies into avionics systems without encroaching on platform flight certification."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}