{
    "id": "eaf7018da556ebd44c699ea7f44f08eb35c5e5e1",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA6_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605301A"
        },
        "ProgramElementTitle": {
            "val": "Army Kwajalein Atoll"
        },
        "R1LineNumber": {
            "val": "141"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "169.699"
            },
            "CurrentYear": {
                "val": "203.905"
            },
            "BudgetYearOne": {
                "val": "236.648"
            },
            "BudgetYearOneBase": {
                "val": "236.648"
            },
            "BudgetYearTwo": {
                "val": "248.708"
            },
            "BudgetYearThree": {
                "val": "216.050"
            },
            "BudgetYearFour": {
                "val": "224.984"
            },
            "BudgetYearFive": {
                "val": "225.216"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The U.S. Army Kwajalein Atoll\/Ronald Reagan Ballistic Missile Defense Test Site (USAKA\/RTS), located in the Republic of the Marshall Islands, is a remote, secure activity of the Major Range and Test Facility Base (MRTFB).  Its function is to support test and evaluation of major Army and DoD acquisition programs and to provide space operations (surveillance and object identification) in support of U.S. Strategic Command (USSTRATCOM) and National Aeronautics and Space Administration (NASA) scientific and space programs.  Programs supported include Army missile defense, Air Force and Navy Intercontinental Ballistic Missile (ICBM) developmental and operational tests; Army, Air Force, Navy and Defense Advanced Research Projects Agency (DARPA) hypersonic developmental tests; Missile Defense Agency (MDA) operational\/demonstration\/validation tests; , USSTRATCOM space situational awareness requirements (inc contributions to the U.S. Space Surveillance Network); and space experiments.  USAKA\/RTS is a government-managed\/contractor-operated (GMCO) site and is dependent upon its associated support contractors for operations and maintenance (O&M).  Program funds contractors to accomplish O&M for both the RTS instrumentation suite and installation\/base operations and provides mission essential bandwidth via a fiber optics cable system.  Funding is required to maintain O&M support, while accepting moderate risk of continued degradation of USAKA\/RTS infrastructure (housing, offices, and facilities), higher future repair costs, and reduced logistical support capability.  The instrumentation suite consists of a number of sophisticated, one-of-a-kind, radar, optical, telemetry, command\/control\/communications, safety, and data reduction systems.  These systems include the four unique radars of the Kiernan Reentry Measurement Site (KREMS); Super Recording Automatic Digital Optical Tracker (SRADOT) long range video-metric tracking systems; high density data recorders for high data-rate telemetry collected by ten antennas; an underwater acoustic impact location system; and data analysis\/reduction hardware\/software and CONUS based mission control center.  The Advanced Research Project Agency (ARPA) Long-Range Tracking and Instrumentation Radar (ALTAIR), and the Target Resolution Discrimination Experiment (TRADEX) radars located at RTS, are the only radars in this area of operation that have deep-space tracking capability.  The Millimeter Wave Radar (MMW) is one of the highest resolution imaging radars in the world providing critical intelligence data.  Funding enables weapon system assessment of operational effectiveness and suitability for the Army, Air Force, Navy and MDA, which all have programs planned that have significant test and data gathering requirements at RTS.  This test data cannot be obtained except through the use of technical facilities available on and in the vicinity of RTS.  Program supports Army's PATRIOT air defense system; Air Force's Minuteman III ICBM and the Space and Missile Center's associated programs; MDA's Ballistic Missile Defense System, ICBM Targets, and Layered Ballistic Missile Defense operational tests (including: PATRIOT, Terminal High-Altitude Area Defense (THAAD), and AEGIS weapon systems), and NASA's space experiments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "175.956"
                },
                "CurrentYear": {
                    "val": "205.145"
                },
                "BudgetYearOne": {
                    "val": "189.452"
                },
                "BudgetYearOneBase": {
                    "val": "189.452"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "169.699"
                },
                "CurrentYear": {
                    "val": "203.905"
                },
                "BudgetYearOne": {
                    "val": "236.648"
                },
                "BudgetYearOneBase": {
                    "val": "236.648"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.257"
                },
                "CurrentYear": {
                    "val": "-1.240"
                },
                "BudgetYearOne": {
                    "val": "47.196"
                },
                "BudgetYearOneBase": {
                    "val": "47.196"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.257"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-1.240"
                                },
                                "BudgetYearOne": {
                                    "val": "47.196"
                                },
                                "BudgetYearOneBase": {
                                    "val": "47.196"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2017 increase is to fund Base Operations\/Infrastructure requirements in support of the Kwajalein Atoll mission. Increased funding supports transportation\/installation operations, equipment maintenance and sustainment activities.  Increased funds also provides the required fuel to support transportation and electrical generators.  Approximately 90% of fuel consumed on the Atoll is used to provide power generation supporting electrical services, heating\/cooling services, water services and waste water services.  Due to the remote location of the Atoll, cost of delivering Base and Logistical support services require $3 spent to receive $1 worth of material or service."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DW7"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Atoll Facilities Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.300"
                        },
                        "CurrentYear": {
                            "val": "41.625"
                        },
                        "BudgetYearOne": {
                            "val": "35.043"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.043"
                        },
                        "BudgetYearTwo": {
                            "val": "39.596"
                        },
                        "BudgetYearThree": {
                            "val": "41.879"
                        },
                        "BudgetYearFour": {
                            "val": "42.730"
                        },
                        "BudgetYearFive": {
                            "val": "43.218"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Provides resources for preventive maintenance and repair necessary to sustain Kwajalein facilities preventing further deterioration and allows keeping good facilities in working order and in accordance with industry standards. The proposed FY17 funding of $35.043 million is 70% of the DoD Facility Sustainment Model 16.2 requirement. Kwajalein facilities currently exhibit significant deterioration due to harsh environmental climate and historical resource shortfalls."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Facility Sustainment"
                                    },
                                    "Description": {
                                        "val": "Facilities Sustainment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.300"
                                            },
                                            "Text": {
                                                "val": "Sustained some deteriorated facility infrastructure on US Army Garrison Kwajalein Atoll (USAGKA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.625"
                                            },
                                            "Text": {
                                                "val": "Sustains more of the deterioreated facilites and allows improvement to some facility infrastructure on US Army Garrison Kwajalein Atoll (USAGKA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.043"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.043"
                                            },
                                            "Text": {
                                                "val": "Sustains current condition of facility infrastructure on US Army Garrison Kwajalein Atoll (USAGKA)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW8"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Atoll Installation Services"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "91.152"
                        },
                        "CurrentYear": {
                            "val": "83.297"
                        },
                        "BudgetYearOne": {
                            "val": "120.086"
                        },
                        "BudgetYearOneBase": {
                            "val": "120.086"
                        },
                        "BudgetYearTwo": {
                            "val": "128.019"
                        },
                        "BudgetYearThree": {
                            "val": "93.423"
                        },
                        "BudgetYearFour": {
                            "val": "101.086"
                        },
                        "BudgetYearFive": {
                            "val": "98.719"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program resources Base Operations\/Installation Services Support for U.S. Army Kwajalein (USAKA) located in the Republic of the Marshall Islands, a remote, secure activity designated as a Major Range and Test Facility Base.   Kwajalein is a government-managed\/contractor-operated site and is primarily dependent upon its associated support contracts for the daily operations and maintenance of Base Ops\/Installation Services Support. Installation Services Support consists of Medical\/Dental Services; Education (K-12) Services; Food\/Grocery Services; Contracted Security Guards; Aviation\/Marine support; and logistical (fuel\/transportation) operations support requirements. Base Operations\/Installation Services Support resourcing is a critical enabler to ensure continuity of operations supporting Test and Evaluation and Space Operations of the Reagan Test Site in its role as a Major Range and Test Facility Base Activity."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Base Operations Support"
                                    },
                                    "Description": {
                                        "val": "Provides for Base Operations to ensure the health, safety and welfare of garrison, tenant personnel, and families. Functions supported: Installation Management, Administrative and Civil Law, Criminal Law and Discipline, Client Services, Claims, Religious Support, Public Affairs, Equal Employment Opportunity (EEO), Internal Review, Installation Safety and Occupational Health, Administrative Services, Resource\/Financial Management, Unaccompanied Personnel Housing and Basic Officers Quarters Management, Family Housing Management, Army Substance Abuse Program, Army Community Services, Child and Youth Sports, Recreation, and Libraries, Business Operations, Schools, Fire and Emergency Response Services, Custodial Services, Refuse Removal, Grounds Maintenance, Electrical Services, Heating\/Cooling Services, Water Services, Waste Water Services, Other Utility Services, Compliance and Conservation Programs, Pollution Prevention Programs, Indoor and Outdoor Pest Management, Physical Security, Law Enforcement Services, Anti-Terrorism Services, Installation Security Program Management Support, Army Emergency Management Services, Military Personnel Services, Civilian Personnel Services, Continuing Education, Emergency Disaster Prep, Host Nation Services, and Protocol Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.418"
                                            },
                                            "Text": {
                                                "val": "Provided Base Operations to ensure the health, safety and welfare of garrison, tenant personnel, and families. Functions supported: Installation Management, Administrative and Civil Law, Criminal Law and Discipline, Client Services, Claims, Religious Support, Public Affairs, Equal Employment Opportunity (EEO), Internal Review, Installation Safety and Occupational Health, Administrative Services, Resource\/Financial Management, Unaccompanied Personnel Housing and Basic Officers Quarters Management, Family Housing Management, Army Substance Abuse Program, Army Community Services, Child and Youth Sports, Recreation, and Libraries, Business Operations, Schools, Fire and Emergency Response Services, Custodial Services, Refuse Removal, Grounds Maintenance, Electrical Services, Heating\/Cooling Services, Water Services, Waste Water Services, Other Utility Services, Compliance and Conservation Programs, Pollution Prevention Programs, Indoor and Outdoor Pest Management, Physical Security, Law Enforcement Services, Anti-Terrorism Services, Installation Security Program Management Support, Army Emergency Management Services, Military Personnel Services, Civilian Personnel Services, Continuing Education, Emergency Disaster Prep, Host Nation Services, and Protocol Services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.460"
                                            },
                                            "Text": {
                                                "val": "Provides for Base Operations to ensure the health, safety and welfare of garrison, tenant personnel, and families. Functions supported: Installation Management, Administrative and Civil Law, Criminal Law and Discipline, Client Services, Claims, Religious Support, Public Affairs, Equal Employment Opportunity (EEO), Internal Review, Installation Safety and Occupational Health, Administrative Services, Resource\/Financial Management, Unaccompanied Personnel Housing and Basic Officers Quarters Management, Family Housing Management, Army Substance Abuse Program, Army Community Services, Child and Youth Sports, Recreation, and Libraries, Business Operations, Schools, Fire and Emergency Response Services, Custodial Services, Refuse Removal, Grounds Maintenance, Electrical Services, Heating\/Cooling Services, Water Services, Waste Water Services, Other Utility Services, Compliance and Conservation Programs, Pollution Prevention Programs, Indoor and Outdoor Pest Management, Physical Security, Law Enforcement Services, Anti-Terrorism Services, Installation Security Program Management Support, Army Emergency Management Services, Military Personnel Services, Civilian Personnel Services, Continuing Education, Emergency Disaster Prep, Host Nation Services, and Protocol Services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "61.567"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "61.567"
                                            },
                                            "Text": {
                                                "val": "Provides for Base Operations to ensure the health, safety and welfare of garrison, tenant personnel, and families. Functions supported: Installation Management, Administrative and Civil Law, Criminal Law and Discipline, Client Services, Claims, Religious Support, Public Affairs, Equal Employment Opportunity (EEO), Internal Review, Installation Safety and Occupational Health, Administrative Services, Resource\/Financial Management, Unaccompanied Personnel Housing and Basic Officers Quarters Management, Family Housing Management, Army Substance Abuse Program, Army Community Services, Child and Youth Sports, Recreation, and Libraries, Business Operations, Schools, Fire and Emergency Response Services, Custodial Services, Refuse Removal, Grounds Maintenance, Electrical Services, Heating\/Cooling Services, Water Services, Waste Water Services, Other Utility Services, Compliance and Conservation Programs, Pollution Prevention Programs, Indoor and Outdoor Pest Management, Physical Security, Law Enforcement Services, Anti-Terrorism Services, Installation Security Program Management Support, Army Emergency Management Services, Military Personnel Services, Civilian Personnel Services, Continuing Education, Emergency Disaster Prep, Host Nation Services, and Protocol Services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Logistical Support"
                                    },
                                    "Description": {
                                        "val": "Provides all logistic functions to include marine and air field operations along with transportation, supply, laundry, food service and maintenance. Transportation includes the operation of transportation motor pools, installation transportation offices, intra-installation rail equipment, and cost of leased vehicles; also includes storage and movement of privately-owned household goods of military personnel (and civilian personnel in overseas areas). Excludes OSA and Watercraft. Supply provides for installation supply operations which include: Ammunition Supply Point services, operation of a central receiving point for goods delivered to the installation, management of Organizational Clothing and Individual Equipment (OCIE), management of non-deployable installation property, and receipt, storage, issue, reutilization and tracking of hazardous materials, secondary items and bulk petroleum for garrison and non-brigade tenant units. Procures petroleum, oils and lubricants (POL) of which approximately 90% of POL is for power generation and the remainder for intra atoll marine and aviation transportation, and for intra-island land transportation and heavy equipment. Laundry account funds Government Owned Contractor Operated (GOCO) and Contractor Owned Contractor Operated (COCO) facilities that provide laundry and dry cleaning service for OCIE items to units IAW AR 210-130. Food account funds the operation of Active, Guard, and Reserve dining facilities and Troop Issue Subsistence Activities (TISA), including pay of government and contract employees, food service supplies, and replacement equipment. Maintenance includes DS\/GS support maintenance (Non-Tactical Support)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.434"
                                            },
                                            "Text": {
                                                "val": "Provided logistic functions to include marine and air field operations along with transportation, supply, laundry, food service and maintenance. Transportation included the operation of transportation motor pools, installation transportation offices, intra-installation rail equipment, and cost of leased vehicles; also included storage and movement of privately-owned household goods of military personnel (and civilian personnel in overseas areas). Excludes OSA and Watercraft. Supply provided for installation supply operations which included: Ammunition Supply Point services, operation of a central receiving point for goods delivered to the installation, management of Organizational Clothing and Individual Equipment (OCIE), management of non-deployable installation property, and receipt, storage, issue, reutilization and tracking of hazardous materials, secondary items and bulk petroleum for garrison and non-brigade tenant units. Procured petroleum, oils and lubricants (POL) of which approximately 90% of POL was for power generation and the remainder for intra atoll marine and aviation transportation, and for intra-island land transportation and heavy equipment. Laundry account funded Government Owned Contractor Operated (GOCO) and Contractor Owned Contractor Operated (COCO) facilities that provided laundry and dry cleaning service for OCIE items to units IAW AR 210-130. Food account funded the operation of Active, Guard, and Reserve dining facilities and Troop Issue Subsistence Activities (TISA), including pay of government and contract employees, food service supplies, and replacement equipment. Maintenance included DS\/GS support maintenance (Non-Tactical Support)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "35.341"
                                            },
                                            "Text": {
                                                "val": "Provides all logistic functions to include marine and air field operations along with transportation, supply, laundry, food service and maintenance. Transportation includes the operation of transportation motor pools, installation transportation offices, intra-installation rail equipment, and cost of leased vehicles; also includes storage and movement of privately-owned household goods of military personnel (and civilian personnel in overseas areas). Excludes OSA and Watercraft. Supply provides for installation supply operations which include: Ammunition Supply Point services, operation of a central receiving point for goods delivered to the installation, management of Organizational Clothing and Individual Equipment (OCIE), management of non-deployable installation property, and receipt, storage, issue, reutilization and tracking of hazardous materials, secondary items and bulk petroleum for garrison and non-brigade tenant units. Procures petroleum, oils and lubricants (POL) of which approximately 90% of POL is for power generation and the remainder for intra atoll marine and aviation transportation, and for intra-island land transportation and heavy equipment. Laundry account funds Government Owned Contractor Operated (GOCO) and Contractor Owned Contractor Operated (COCO) facilities that provide laundry and dry cleaning service for OCIE items to units IAW AR 210-130. Food account funds the operation of Active, Guard, and Reserve dining facilities and Troop Issue Subsistence Activities (TISA), including pay of government and contract employees, food service supplies, and replacement equipment. Maintenance includes DS\/GS support maintenance (Non-Tactical Support)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "51.828"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "51.828"
                                            },
                                            "Text": {
                                                "val": "Provides all logistic functions to include marine and air field operations along with transportation, supply, laundry, food service and maintenance. Transportation includes the operation of transportation motor pools, installation transportation offices, intra-installation rail equipment, and cost of leased vehicles; also includes storage and movement of privately-owned household goods of military personnel (and civilian personnel in overseas areas). Excludes OSA and Watercraft. Supply provides for installation supply operations which include: Ammunition Supply Point services, operation of a central receiving point for goods delivered to the installation, management of Organizational Clothing and Individual Equipment (OCIE), management of non-deployable installation property, and receipt, storage, issue, reutilization and tracking of hazardous materials, secondary items and bulk petroleum for garrison and non-brigade tenant units. Procures petroleum, oils and lubricants (POL) of which approximately 90% of POL is for power generation and the remainder for intra atoll marine and aviation transportation, and for intra-island land transportation and heavy equipment. Laundry account funds Government Owned Contractor Operated (GOCO) and Contractor Owned Contractor Operated (COCO) facilities that provide laundry and dry cleaning service for OCIE items to units IAW AR 210-130. Food account funds the operation of Active, Guard, and Reserve dining facilities and Troop Issue Subsistence Activities (TISA), including pay of government and contract employees, food service supplies, and replacement equipment. Maintenance includes DS\/GS support maintenance (Non-Tactical Support)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical\/Dental Support"
                                    },
                                    "Description": {
                                        "val": "Supports a fully operational community hospital, a secondary medical clinic, veterinarian services, physical therapy clinic and a dental clinic. Support includes but is not limited to medical lab and imaging services, pharmacy services, medical services management, and all medical functions to include inspections of medical facilities and calibration of equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.300"
                                            },
                                            "Text": {
                                                "val": "Supported a fully operational community hospital, a secondary medical clinic, veterinarian services, physical therapy clinic and a dental clinic. Support includes but is not limited to medical lab and imaging services, pharmacy services, medical services management, and all medical functions to include inspections of medical facilities and calibration of equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.496"
                                            },
                                            "Text": {
                                                "val": "Support a fully operational community hospital, a secondary medical clinic, veterinarian services, physical therapy clinic and a dental clinic. Support includes but is not limited to medical lab and imaging services, pharmacy services, medical services management, and all medical functions to include inspections of medical facilities and calibration of equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.691"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.691"
                                            },
                                            "Text": {
                                                "val": "Support a fully operational community hospital, a secondary medical clinic, veterinarian services, physical therapy clinic and a dental clinic. Support includes but is not limited to medical lab and imaging services, pharmacy services, medical services management, and all medical functions to include inspections of medical facilities and calibration of equipment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW9"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Atoll Restoration And Modernization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.660"
                        },
                        "CurrentYear": {
                            "val": "12.820"
                        },
                        "BudgetYearOne": {
                            "val": "14.810"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.810"
                        },
                        "BudgetYearTwo": {
                            "val": "14.809"
                        },
                        "BudgetYearThree": {
                            "val": "14.820"
                        },
                        "BudgetYearFour": {
                            "val": "14.828"
                        },
                        "BudgetYearFive": {
                            "val": "14.825"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funds the restoration and modernization of U.S. Army Kwajalein Atoll degraded infrastructure (real property\/facilities) to working condition and upgrades facilities to meet current standards. Restoration consists of repair and replacement work to fix facilities degraded due to the effects of aging and  inadequate sustainment funding for a number of years. Modernization supports upgrade of facilities to meet current codes, accommodate new functions, and\/or replace building components that exceed the overall service life of the facilities. The proposed funding levels support a small fraction of critical infrastructure restoration and modernization work necessary to current and enduring deficiencies based analysis of infrastructure identified."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Facility Restoration \/ Modernization"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for updates to and\/or replacement of critical infrastructure supporting the  mission operations and quality of life of the island tenants.   Restores at risk to health and safety facilities due to inadequate sustainment in past years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.660"
                                            },
                                            "Text": {
                                                "val": "Provided minor updates to infrastructure critical to the mission and well being of the island tenants. Restored facilities currently at risk of causing potential health and safety issues for the civilians, military, and families stationed on the island due to inadequate sustainment over the past several years."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.820"
                                            },
                                            "Text": {
                                                "val": "Provides for updates and\/or replacement of infrastructure critical to the mission and well being of the island tenants. Will restore facilities currently at risk to the health and safety of the civilians,\nmilitary, and families stationed on the island due to inadequate sustainment in past years."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.810"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.810"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide for additional updates and\/or replacement of infrastructure critical to the mission and well being of the island tenants. Will continue to restore facilities currently at risk to the health and safety of the civilians, military, and families stationed on the island due to inadequate sustainment in past years."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DX2"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Test Ranges and Mission Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "63.587"
                        },
                        "CurrentYear": {
                            "val": "66.163"
                        },
                        "BudgetYearOne": {
                            "val": "66.709"
                        },
                        "BudgetYearOneBase": {
                            "val": "66.709"
                        },
                        "BudgetYearTwo": {
                            "val": "66.284"
                        },
                        "BudgetYearThree": {
                            "val": "65.928"
                        },
                        "BudgetYearFour": {
                            "val": "66.340"
                        },
                        "BudgetYearFive": {
                            "val": "68.454"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project DX2 was created in 2013 as allocation for 665301.DX2, realigned from 665301.614. New Start 2017 - Army Contracting Command (ACC) Support."
                        },
                        "ProjectMissionDescription": {
                            "val": "A. Space and Missile Defense Command-Army Forces Strategic Command (USASMDC-ARSTRAT) funding is for management and contracting personnel support (salaries and travel) to enable the management of the test and evaluation of major Army and DoD missile systems for the Ronald Reagan Ballistic Missile Defense Test Site (RTS). RTS began its funding under Project Element 665301.DX2 in FY14. RTS is a tenant on the US Army Garrison - Kwajalein Atoll (USAG-KA), located within the Kwajalein Atoll in the Republic of the Marshall Islands, which is a remote, secure activity of the Major Range and Test Facility Base (MRTFB).  Its function is to support test and evaluation of major Army and DoD acquisition programs and to provide space operations (Space Situational Awareness; object tracking & identification) in support of U.S. Strategic Command (USSTRATCOM) and National Aeronautics and Space Administration (NASA) scientific and unique space programs.  Programs supported include Army Missile Defense, Air Force, and Navy Intercontinental Ballistic Missile (ICBM) developmental and operational tests; Army, Air Force, Navy, and Defense Advanced Research Projects Agency (DARPA) hypersonic Boost-Glide developmental tests; Missile Defense Agency (MDA) operational\/demonstration\/validation tests; USSTRATCOM space situational awareness requirements (including contributions to the U.S. Space Surveillance Network); and NASA, ionospheric studies, space debris tracking, and data collection in support of space experiments.  RTS is a government-managed\/contractor-operated (GMCO) site and is dependent upon its associated support contractors for operations and maintenance (O&M).  Program funds contracting support for end item procurement, life cycle acquisition planning, and solicitation, negotiation, award, execution and management for weapon systems contracts.  Program funds contractors to accomplish O&M for RTS instrumentation suites and provides mission essential bandwidth via a fiber optics cable system.  The instrumentation suite consists of a number of sophisticated, one-of-a-kind, radar, optical, telemetry, command\/control\/communications, safety, and data reduction systems.  These systems include the four unique radars of the Kiernan Reentry Measurement Site (KREMS); Super Recording Automatic Digital Optical Tracker (SRADOT) long range video-metric tracking systems; high density data recorders for high data-rate telemetry collected by ten antennas; an underwater acoustic impact location system; and data analysis\/reduction hardware\/software and CONUS based mission control center.  The Advanced Research Project Agency (ARPA) Long-Range Tracking and Instrumentation Radar (ALTAIR), and the Target Resolution Discrimination Experiment (TRADEX) radars located at RTS, are the only radars in this area of operation that have deep-space tracking capability.  The Millimeter Wave Radar (MMW) is one of the highest resolution imaging radars in the world providing critical intelligence data.  Funding enables weapon system assessment of operational effectiveness and suitability for the Army, Air Force, Navy and MDA, which all have programs planned that have significant test and data gathering requirements at RTS.  This test data cannot be obtained except through the use of technical facilities available on and in the vicinity of RTS.  Program supports Army's PATRIOT air defense system; Air Force's Minuteman III ICBM and the Space and Missile Center's associated programs; MDA's Ballistic Missile Defense System, ICBM Targets, and Layered Ballistic Missile Defense operational tests (including: PATRIOT, Terminal High-Altitude Area Defense (THAAD), and AEGIS weapon systems), and NASA's space experiments.\n\nNETCOM - The Network Enterprise Technology Command (NETCOM) funds Department of Army civilian pay, manpower service contracts, supporting IT equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management.  Provides Command, Control, Communications, Computers, and Information Management (C4IM) services in accordance with the DA PAM 25-1-1 and the Army C4IM Services List.  Provides Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700).  Includes the delivery of services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services.  Provides infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems.  Provides Collaboration and Messaging Services including services and tools for workforce to communicate and share information.  Provides Application and Web-hosting including operation and management services required to support web and application hosting.  Provides Desktop Management Support including management and support for end-user hardware and software services and tools.  Includes Service Desk Support, Continuity of Operations, and Disaster Recovery support.\nJustification: Each of the baseline services provided with this funding are priority zero, must fund, IT utility requirements.  Not funding or reducing the programmed funding will directly impact communications and mission command at all levels on Kwajalein Atoll.\nMemorandum of Agreement (MOA) between USASMDC\/ARSTRAT and NETCOM: The 16 August 2013 signed MOA between USASMDC\/ARSTRAT and NETCOM formally transfers baseline C4IM functional Areas of Responsibility (Base Communications Support, Information Assurance, and Automation) to NETCOM.  This MOA defines the roles and responsibilities between USASMDC\/NETCOM as well as transfers all USAKA Network Enterprise Center missions, functions, support functions, and programmed resources to support execution of the baseline C4IM Services.  Above baseline services will remain an SMDC responsibility to program and support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Pay (RTS)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.786"
                                            },
                                            "Text": {
                                                "val": "Continued to provide government personnel support (salaries, training, and travel, GPC) to enable the management of the test and evaluation of major Army and DoD missile systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.843"
                                            },
                                            "Text": {
                                                "val": "Continues to provide government personnel support (salaries, training, and travel, and Government Purchase Card (GPC) requirements) to enable the management of the test and evaluation of major Army and DoD missile systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.488"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.488"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide government personnel support (salaries, training, and travel, and Government Purchase Card (GPC) requirements) to enable the management of the test and evaluation of major Army and DoD missile systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TDY\/Training\/Supplies - Military and Civilian"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.277"
                                            },
                                            "Text": {
                                                "val": "Continued to provide government personnel support (training, and travel, GPC) to enable the management of the test and evaluation of major Army and DoD missile systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.620"
                                            },
                                            "Text": {
                                                "val": "Continues to provide government personnel support (training, and travel, GPC) to enable the management of the test and evaluation of major Army and DoD missile systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.630"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.630"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide government personnel support (training, and travel, GPC) to enable the management of the test and evaluation of major Army and DoD missile systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Outside Obligations\/Other Government Agencies"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.319"
                                            },
                                            "Text": {
                                                "val": "Continued to provide support to test and evaluation of major Army and DoD missile systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.160"
                                            },
                                            "Text": {
                                                "val": "Continues to provide support to test and evaluation of major Army and DoD missile systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.237"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.237"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide support to test and evaluation of major Army and DoD missile systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fiber Optic Cable (Kwajalein Cable System)\/Inner Ring Submarine"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.513"
                                            },
                                            "Text": {
                                                "val": "Continued to provide funding for lease of the Kwajalein Cable System (KCS) fiber optic cable between Kwajalein Island and Guam, and for backup satellite."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.566"
                                            },
                                            "Text": {
                                                "val": "Continues to provide funding for lease of the KCS fiber optic cable between Kwajalein Island and Guam, and for backup satellite."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.374"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.374"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide funding for lease of the KCS fiber optic cable between Kwajalein Island and Guam, and for backup satellite."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RTS Contractor Prime Pay (KRS)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.611"
                                            },
                                            "Text": {
                                                "val": "Continued to provide technical Operations and Maintenance (O&M) support (test planning, instrumentation operations and maintenance, systems engineering, flight safety, launch ordnance, Kwajalein Mobile range Safety System (WORTHY, etc) to assure the capability of the Range to support test and space missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.258"
                                            },
                                            "Text": {
                                                "val": "Continues to provide technical O&M support (test planning, instrumentation operations and maintenance, systems engineering, flight safety, launch ordnance, Kwajalein Mobile range Safety System (WORTHY, etc) to assure the capability of the Range to support test and space missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.562"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.562"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide technical O&M support (test planning, instrumentation operations and maintenance, systems engineering, flight safety, and launch ordnance) to assure the capability of the Range to support test and space missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Contractor Material"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.401"
                                            },
                                            "Text": {
                                                "val": "Continued to provide critical non-labor materials to maintain critical range capabilities and prevent obsolescence in support of test operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.169"
                                            },
                                            "Text": {
                                                "val": "Continues to provide critical non-labor materials to maintain critical range capabilities and prevent obsolescence in support of test operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.840"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.840"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide critical non-labor materials to maintain critical range capabilities and prevent obsolescence in support of test operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FFRDC Contractor Pay (MIT\/LL)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.602"
                                            },
                                            "Text": {
                                                "val": "Continued to provide technical advice to RTS leadership in support of Range operations, strategic planning, and technical execution of critical technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.602"
                                            },
                                            "Text": {
                                                "val": "Continues to provide technical advice to RTS leadership in support of Range operations, strategic planning, and technical execution of critical technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.671"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.671"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide technical advice to RTS leadership in support of Range operations, strategic planning, and technical execution of critical technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Contractor Pay Meteorological"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.786"
                                            },
                                            "Text": {
                                                "val": "Continued to provide support for sustained weather sensing capabilities, including weather reporting via radar data.  This capability provides critical data to test planning and execution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.897"
                                            },
                                            "Text": {
                                                "val": "Continues to provide support for sustained weather sensing capabilities, including weather reporting via radar data.  This capability provides critical data to test planning and execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.925"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.925"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide support for sustained weather sensing capabilities, including weather reporting via radar data.  This capability provides critical data to test planning and execution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Transportation"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.446"
                                            },
                                            "Text": {
                                                "val": "Continued to provide mission specific material and passenger transportation via air (Air Mobility Command) and sea (SDDC) between Kwajalein Atoll and CONUS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.446"
                                            },
                                            "Text": {
                                                "val": "Continues to provide mission specific material and passenger transportation via air (Air Mobility Command) and sea (SDDC) between Kwajalein Atoll and CONUS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.468"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.468"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide mission specific material and passenger transportation via air (Air Mobility Command) and sea (SDDC) between Kwajalein Atoll and CONUS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Specific Environmental"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.310"
                                            },
                                            "Text": {
                                                "val": "Continued to provide the capability to assess and maintain the Range readiness and compliance with environmental requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.526"
                                            },
                                            "Text": {
                                                "val": "Continues to provide the capability to assess and maintain the Range readiness and compliance with environmental requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.534"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide the capability to assess and maintain the Range readiness and compliance with environmental requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "USNS Worthy - Shipyard"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Addresses obsolescence and maintenance requirements in support of upcoming test missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Enterprise Technology Command (NETCOM) C4IM"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.536"
                                            },
                                            "Text": {
                                                "val": "NETCOM - The Network Enterprise Technology Command (NETCOM) funds Department of Army civilian pay, manpower service contracts, supporting IT equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management.  Provided Command, Control, Communications, Computers, and Information Management (C4IM) services in accordance with the DA PAM 25-1-1 and the Army C4IM Services List.  Provided Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700).  Includes the delivery of services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services.  Provided infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems.  Provided Collaboration and Messaging Services including services and tools for workforce to communicate and share information.  Provided Application and Web-hosting including operation and management services required to support web and application hosting.  Provided Desktop Management Support including management and support for end-user hardware and software services and tools.  Included Service Desk Support, Continuity of Operations, and Disaster Recovery support.\nJustification:  Each of the baseline services provided with this funding are priority zero, must fund, IT utility requirements.  Not funding or reducing the programmed funding will directly impact communications and mission command at all levels on Kwajalein Atoll."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.680"
                                            },
                                            "Text": {
                                                "val": "NETCOM - The Network Enterprise Technology Command (NETCOM) funds Department of Army civilian pay, manpower service contracts, supporting IT equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management.  Provides Command, Control, Communications, Computers, and Information Management (C4IM) services in accordance with the DA PAM 25-1-1 and the Army C4IM Services List.  Provides Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700).  Include delivery of services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services.  Provides infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems. Provides Collaboration and Messaging Services including services and tools for workforce to communicate and share information.  Provide Application and Web-hosting including operation and management services required to support web and application hosting.  Provides Desktop Management Support including management and support for end-user hardware and software services and tools.  Include Service Desk Support, Continuity of Operations, and Disaster Recovery support. Justification:  Each of the baseline services to be provided with this funding are priority zero, must fund, IT utility requirements.  Not funding or reducing the programmed funding will directly impact communications and mission command at all levels on Kwajalein Atoll."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.584"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.584"
                                            },
                                            "Text": {
                                                "val": "NETCOM - The Network Enterprise Technology Command (NETCOM) will fund Department of Army civilian pay, manpower service contracts, supporting IT equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management.  Will provide Command, Control, Communications, Computers, and Information Management (C4IM) services in accordance with the DA PAM 25-1-1 and the Army C4IM Services List.  Will provide Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700).  Will include delivery of services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services.  Will provide infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems. Will  provide Collaboration and Messaging Services including services and tools for workforce to communicate and share information.  Will provide Application and Web-hosting including operation and management services required to support web and application hosting.  Will provide Desktop Management Support including management and support for end-user hardware and software services and tools.  To include Service Desk Support, Continuity of Operations, and Disaster Recovery support. Justification:  Each of the baseline services to be provided with this funding are priority zero, must fund, IT utility requirements.  Not funding or reducing the programmed funding will directly impact communications and mission command at all levels on Kwajalein Atoll."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Contracting Command (ACC) Support"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.396"
                                            },
                                            "Text": {
                                                "val": "Provides contracting support (salaries, training, travel, etc) to test and evaluation of major Army and DoD Missile System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.396"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.396"
                                            },
                                            "Text": {
                                                "val": "Will provide contracting support (salaries, training, travel, etc) to test and evaluation of major Army and DoD Missile System."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}