{
    "id": "ee23f4128d84f4259c0f1573481b12855800ea2e",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0305221F"
        },
        "ProgramElementTitle": {
            "val": "Network-Centric Collaborative Targeting"
        },
        "R1LineNumber": {
            "val": "209"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "11.096"
            },
            "CurrentYear": {
                "val": "19.587"
            },
            "BudgetYearOne": {
                "val": "22.610"
            },
            "BudgetYearOneBase": {
                "val": "22.610"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "17.788"
            },
            "BudgetYearThree": {
                "val": "15.958"
            },
            "BudgetYearFour": {
                "val": "16.454"
            },
            "BudgetYearFive": {
                "val": "16.815"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2016, PE 0305221, Network-Centric Collaborative Targeting, Project 675197 efforts for SUTER were transferred to PE 0305221, Network-Centric Collaborative Targeting, Project 675275, SUTER in order to ensure dedicated RDT&E funding to develop SUTER capabilities."
        },
        "ProgramElementMissionDescription": {
            "val": "Network Centric Collaborative Targeting (NCCT) is the Air Force program of record responsible for developing core technologies and sub-nodal analysis tools to horizontally and\/or vertically integrated network collaborative Intelligence, Surveillance and Reconnaissance (ISR) sensor systems within and across intelligence disciplines.  Operational uses of core technologies can include, but are not limited to, Signals Intelligence to Signals Intelligence (SIGINT-SIGINT) correlation and Ground Moving Target Indicator to Signals Intelligence (GMTI-SIGINT) correlation.  Operational uses of sub-nodal analysis tools can include, but are not limited to, determining which nodes of the adversary's Command, Control, Communications, Computers, Intelligence (C4I) network to engage or protect to achieve desired effects, and modeling execution plans to determine the need to disrupt or monitor the required network aim-points in order to redirect activities based on changing battlefield conditions.  NCCT software applications employ Machine-to-Machine (M2M) interfaces and Internet Protocol (IP) connectivity to coordinate sensor cross-cues and collection activities.  NCCT correlation and fusion services ingest collection data to produce a single, composite track (geo-location and identification) for high-value targets.  NCCT research and development funding supports evolutionary development of the NCCT message set and network management systems (for example Operations Interfaces, Network Controllers, Fusion Engines, Data Guards, Interface to Command & Control, and Interface to Overhead Intelligence Operations (OIO)), the migration of the NCCT technologies to emerging network centric technologies such as Service Oriented Architectures (SOA), global web-enabled services, and satisfying DoD standards and Information Assurance requirements.   \n\nNCCT Core Technology develops the hardware and software to horizontally integrate dissimilar Joint and Coalition Battle Management, Command & Control (BMC2), and ISR assets and systems into integrated target tracks shared across networked platforms.  NCCT Core Technology includes, but is not limited to, network management software, operator interfaces, standard network messages and formats, correlation software and data rules of interaction, NCCT multi-level security hardware and software items, and platform specific Platform Interface Modules (PIMs).  Current NCCT-enabled systems include, but are not limited to, the RC-135V\/W\/S\/U RIVET JOINT, COBRA BALL, COMBAT SENT, EC-130H COMPASS CALL, Distributive Common Ground System (DCGS) SIGINT components, Falconer Aerospace Operations Centers (AOC), Forward Processing\/Exploitation\/Dissemination (FPED), Gorgon Stare (GS), OIO, and multiple airborne coalition partner platforms.  Prospective Coalition, Joint or Service systems are required to fund their respective integration, unique core technology improvements\/upgrades to support system integration. The FY 2017 RDT&E funding in response to Air Combat Command's validated requirement to allow not only NCCT to sustain the capability to operate in a tactical environment but in addition provide development in the Core Technology to provide enhanced capabilities for an Anti-Access Area Denial (A2AD) strategy in the future.  \n\nSUTER develops concepts, Tactics\/Techniques\/Procedures (TTPs) and technologies for synchronizing the capabilities of ISR and non-kinetic capabilities in a coordinated fashion with traditional kinetic weapons to prosecute targets connected together or dependent upon some form of communications network.  Suter's planning, execution and assessment capability is implemented in a virtual architecture available to all AOCs, taking advantage of the military value added from the synergies of Joint composite ISR, non-kinetic, and\/or kinetic strike packages operating against networked target sets.  This virtualized Service Oriented Architecture (SOA) utilizes software applications which employ M2M interfaces and IP communications to impact these target sets by \"attacking\" or influencing\/shaping links, nodes or end points in the network to include: RF and terrestrial links, switches, routers, hubs, servers, IP addresses, cell phones, antennas, radars, microwave relays, SATCOM receivers, transceivers, etc. The three main pieces of the Suter CONOPS include: first, the use of Suter's sub-nodal analysis software to determine which nodes of the adversary's C4I network to engage or protect to achieve desired effects; second, the Suter's distributed operations architecture to tie together relevant planning cells (e.g. AOCs, JIOWC, etc.) so they can collaborate in developing and modeling the execution plan(s) needed to disrupt or monitor the required network aim-points; and third, via Suter's combined network Graphical User Interface (GUI), all involved \"players\" monitor the plan's execution, provide Near-Real Time (NRT) updates to the status of on-going activities, provide continuous assessment\/updates of the execution of the plan, and, within authorities (Rules of Engagement\/ROEs), re-direct activities based on changing battlefield conditions.  Suter is the technology that assists Combatant Commanders and Components to exercise synchronized dynamic Command and Control (C2) of ISR, kinetic and non-kinetic Joint operations against conventional and terrorist threat networks. Suter provides decision makers and operators supporting airborne, ship-borne, cyber and land-based C2ISR platforms and at supporting locations continuous Predictive Battle-space Awareness (PBA) of the information superiority fight. It also incorporates the M2M capabilities that rapidly synchronize the employment of kinetic weapons, non-kinetic weapons and ISR assets to target challenging threat systems responsively.  Suter depicts a dynamic, multi-security-level picture of current and predicted threat network status, capitalizing on data inputs from sources such as Modernized Intelligence Database (MIDB), Net-Centric Collaborative Targeting (NCCT), Joint Targeting Database (JTDB), Computer Network Operations Database (CNODB), NASIC Links and Nodes, and Integrated Broadcast Service (IBS).  Suter provides a GUI that can be tailored to support the integration of ISR, kinetic, and non-kinetic composite target packages supporting COCOM and Component specified information superiority effects and objectives.\n\nFY 2017 funding is dedicated to upgrading the virtualized SOA for the operational Suter system delivered in FY 2015, consisting of improvements in core technology security\/Information Assurance, and addition of additional systems and data types.\n\n\nThe NCCT program is categorized as Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.096"
                },
                "CurrentYear": {
                    "val": "21.587"
                },
                "BudgetYearOne": {
                    "val": "21.235"
                },
                "BudgetYearOneBase": {
                    "val": "21.235"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.096"
                },
                "CurrentYear": {
                    "val": "19.587"
                },
                "BudgetYearOne": {
                    "val": "22.610"
                },
                "BudgetYearOneBase": {
                    "val": "22.610"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-2.000"
                },
                "BudgetYearOne": {
                    "val": "1.375"
                },
                "BudgetYearOneBase": {
                    "val": "1.375"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-2.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.375"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.375"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Larger funding requirements in FY 2016 and FY 2017 were the result of (1) an Air Combat Command validated requirement to add capability to NCCT for the transition to an Anti-Access Area Denial (A2AD) strategy and (2) planned upgrades to the operational SUTER system delivered in FY 2015.\n\nFY 2016 $2M Congressional Reduction due to NCCT Version 5.0.4 early to need.\n\nFY 2017 $1.375M was added to develop Air Domain Awareness, an Air Moving Target Indicator (AMTI) correlation capability."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675197"
                    },
                    "ProjectTitle": {
                        "val": "NCCT Core Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.096"
                        },
                        "CurrentYear": {
                            "val": "17.271"
                        },
                        "BudgetYearOne": {
                            "val": "20.115"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.115"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "15.248"
                        },
                        "BudgetYearThree": {
                            "val": "13.372"
                        },
                        "BudgetYearFour": {
                            "val": "13.821"
                        },
                        "BudgetYearFive": {
                            "val": "14.135"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2016, PE 0305221, Network-Centric Collaborative Targeting, Project 675197 efforts for SUTER were transferred to PE 0305221, Network-Centric Collaborative Targeting, Project 675275, SUTER in order to ensure dedicated RDT&E funding to develop SUTER capabilities."
                        },
                        "ProjectMissionDescription": {
                            "val": "Network Centric Collaborative Targeting (NCCT) is the Air Force program of record responsible for developing core technologies and sub-nodal analysis tools to horizontally and\/or vertically integrate network collaborative Intelligence, Surveillance and Reconnaissance (ISR) sensor systems within and across intelligence disciplines.  Operational uses of core technologies would include, but are not be limited to, Signals Intelligence to Signals Intelligence (SIGINT-SIGINT) correlation and Ground Moving Target Indicator to Signals Intelligence (GMTI-SIGINT) correlation.  NCCT software applications employ Machine-to-Machine (M2M) interfaces and Internet Protocol (IP) connectivity to coordinate sensor cross-cues and collection activities.  NCCT correlation and fusion services ingest collection data to produce a single, composite track (geo-location and identification) for high-value targets.  NCCT research and development funding supports evolutionary development of the NCCT message set and network management systems (for example Operations Interfaces, Network Controllers, Fusion Engines, Data Guards, Interface to Command & Control, and Interface to Overhead Intelligence Operations (OIO)), the migration of the NCCT technologies to emerging network centric technologies such as Service Oriented Architectures (SOA), global web-enabled services, and satisfying DoD standards and Information Assurance requirements.   \n\nNCCT Core Technology develops the hardware and software to horizontally integrate dissimilar Joint and Coalition Battle Management, Command & Control (BMC2), and ISR assets and systems into integrated target tracks shared across networked platforms.  NCCT Core Technology includes, but is not limited to, network management software, operator interfaces, standard network messages and formats, correlation software and data rules of interaction, NCCT multi-level security hardware and software items, and platform specific Platform Interface Modules (PIMs).  Current NCCT-enabled systems include, but are not limited to, the RC-135V\/W\/S\/U RIVET JOINT, COBRA BALL, COMBAT SENT, EC-130H COMPASS CALL, Distributive Common Ground System (DCGS) SIGINT components, Falconer Aerospace Operations Centers (AOC), Forward Processing\/Exploitation\/Dissemination (FPED), Gorgon Stare (GS), OIO, and multiple airborne coalition partner platforms.  Prospective Coalition, Joint or Service systems are required to fund their respective integration, unique core technology improvements\/upgrades to support system integration.  The FY 2017 RDT&E funding will address Air Combat Command's validated requirement to allow not only NCCT to sustain the capability to operate in a tactical environment but in addition provide development in the Core Technology to provide enhanced capabilities for an Anti-Access Area Denial (A2AD) strategy in the future.\n\nThe NCCT program is categorized as Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Core Technology"
                                    },
                                    "Description": {
                                        "val": "Accomplishments and planned efforts include development and update of NCCT Core Technology; technical support to users, and management activities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.096"
                                            },
                                            "Text": {
                                                "val": "- Delivered NCCT version 5.0.2 which included required improvements in core technology security\/information to sustain legacy and SOA systems, security software to attain CNSS-1253 accreditation (required for NSANET operations), and a more technically mature GMTI-SIGINT correlation capability for operational systems\n- Evaluated collaboration of additional capabilities, systems, and data feeds for future NCCT increments"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.271"
                                            },
                                            "Text": {
                                                "val": "- NCCT will begin initial integration of Link 16 Ingest, Air Moving Target Indicator (AMTI) correlation capbility, and develop Distributed Mission Operations and Training (DMO\/DMT) Capability  \n- NCCT will continue evaluating collaboration of additional systems and data types, such as OPIR Fusion and demonstration of National-to-Tactical Fusion for the technology enhancements required for NCCT to operate in an Anti-Access Area Denial (A2AD) environment"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.115"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.115"
                                            },
                                            "Text": {
                                                "val": "- NCCT will continue to mature the integration of Link 16 Ingest, Air Moving Target Indicator (AMTI) correlation capability, and develop Distributed Mission Operations and Training (DMO\/DMT) Capability\n- NCCT will also continue evaluating and begin to develop capabilities for collaboration of additional systems and data types, such as OPIR Fusion and demonstration of National-to-Tactical Fusion for the technology enhancements required for NCCT to operate in an Anti-Access Area Denial (A2AD) environment"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: Line Item # 832070"
                                    },
                                    "Title": {
                                        "val": "Intelligence Comm Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.974"
                                        },
                                        "CurrentYear": {
                                            "val": "2.418"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.583"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.583"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.281"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.087"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.141"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.198"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The NCCT Core Technology capabilities are developed, maintained and sustained with baseline\/incremental upgrades plus any Quick Reaction Capability (QRC) developments acquired through the 645th Aeronautical System Group (AESG, a.k.a. BIG SAFARI System Program Office or SPO) in accordance with the BIG SAFARI Program Management Directive (PMD) and the BIG SAFARI Class Justification and Authorization (J&A) documents for acquisition of supplies and services.  The procured supplies and services are supported by the BIG SAFARI Life Cycle Management Plan (LCMP) across the full spectrum of system life cycle management -- developmental engineering to system retirement (\"cradle to grave\" support concept).  Due to the rapidly changing threat environment encountered during our prolonged commitment to Overseas Contingency Operations (OCO), the acquisition program manager has the authority to redirect funding as necessary to meet current stated and emerging\/evolving Combatant Commander requirements.\n\n645th AESG, Wright Patterson AFB OH, manages the Cost Plus Fixed Fee (CPFF) contracts used to develop the NCCT Core Technology.  645th AESG will develop NCCT Core Technology software on common hardware for systems and platforms designated to field this ISR capability.  Individual program management offices may contract directly with their prime contractors or through the 645th AESG for integration of these ISR capabilities on their respective systems and platforms."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Prior to FY 2016, SUTER was funded with NCCT Core Technology BPAC (675197).  In FY 2016, the SUTER BPAC (675275) was established and funding for SUTER development will be reflected accordingly in those documents."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Core Technology"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L-3 ComCept"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rockwall, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.900"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "16.549"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "19.353"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "19.353"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Core Tech"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L-3 ComCept"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rockwall, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.811"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SUTER"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Analyst Warehouse"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Baltimore, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.565"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Security Certification\/Technical Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Riverside Research Institute"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.320"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.274"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "645 AESG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.448"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.762"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.762"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Core Tech Version 5.0.2 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Core Tech Version 5.0.3 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Core Tech Version 5.0.4 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Core Tech Version 5.0.5 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Core Tech Version 5.0.6 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675275"
                    },
                    "ProjectTitle": {
                        "val": "SUTER"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.316"
                        },
                        "BudgetYearOne": {
                            "val": "2.495"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.495"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.540"
                        },
                        "BudgetYearThree": {
                            "val": "2.586"
                        },
                        "BudgetYearFour": {
                            "val": "2.633"
                        },
                        "BudgetYearFive": {
                            "val": "2.680"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2016, PE 0305221, Network-Centric Collaborative Targeting, Project 675197 efforts for SUTER were transferred to PE 0305221, Network-Centric Collaborative Targeting, Project 675275, SUTER in order to ensure dedicated RDT&E funding to develop SUTER capabilities."
                        },
                        "ProjectMissionDescription": {
                            "val": "SUTER is a project responsible for developing sub-nodal analysis tools to horizontally and\/or vertically integrate network collaborative Intelligence, Surveillance, and Reconnaissance (ISR) sensor systems within and across intelligence disciplines.  Operational uses of sub-nodal analysis tools would include, but are not limited to, determing which nodes of the adversary's Command, Control, Communications, Computers, Intelligence (C4I) network are engaged or protected to achieve desired effects, and modeling execution plans to determine the need to disrupt or monitor the required network aim-points in order to redirect activities based on changing battlefield conditions.\n\nSUTER develops concepts, Tactics\/Techniques\/Procedures (TTPs) and technologies for synchronizing the capabilities of ISR and non-kinetic capabilities in a coordinated fashion with traditional kinetic weapons to prosecute targets connected together or dependent upon some form of network.  SUTER's planning, execution and assessment capability is implemented in a virtual architecture available to all AOCs, taking advantage of the military value added from the synergies of Joint composite ISR, non-kinetic, and\/or kinetic strike packages operating against networked target sets.  This virtualized Service Oriented Architecture (SOA) utilizes software applications which employ machine-to-machine interfaces and Internet Protocol (IP) communications to impact these target sets by \"attacking\" or influencing\/shaping links, nodes or end points in the network to include: RF and terrestrial links, switches, routers, hubs, servers, IP addresses, cell phones, antennas, radars, microwave relays, SATCOM receivers, transceivers, etc.  The three main pieces of the SUTER CONOPS include: first, the use of SUTER's sub-nodal analysis software to determine which nodes of the adversary's C4I network to engage or protect to achieve desired effects; second, the use of SUTER's distributed operations architecture to tie together relevant planning cells (e.g. AOCs, JIOWC, etc.) so they can collaborate in developing and modeling the execution plan(s) needed to disrupt or monitor the required network aim-points; and third, via SUTER's combined network Graphical User Interface (GUI), all involved \"players\" monitor the plan's execution, provide Near-Real Time (NRT) updates to the status of on-going activities, provide continuous assessment\/updates of the execution of the plan, and, within authorities (Rules of Engagement or ROEs), re-direct activities based on changing battlefield conditions.  SUTER is the technology that assists COCOMs and Components to exercise synchronized dynamic Command and Control (C2) of ISR, kinetic and non-kinetic Joint operations against conventional and terrorist threat networks.  SUTER provides decision makers and operators supporting airborne, ship-borne, cyber and land-based C2ISR platforms and at supporting locations continuous Predictive Battle-space Awareness (PBA) of the information superiority fight.  It also incorporates the M2M capabilities that rapidly synchronize the employment of kinetic weapons, non-kinetic weapons and ISR assets to target challenging threat systems responsively.  SUTER depicts a dynamic, multi-security-level picture of current and predicted threat network status, capitalizing on data inputs from sources such as Modernized Intelligence Database (MIDB), Net-Centric Collaborative Targeting (NCCT), Joint Targeting Database (JTDB), Computer Network Operations Database (CNODB), NASIC Links and Nodes, and Integrated Broadcast Service (IBS).  SUTER provides a GUI that can be tailored to support the integration of ISR, kinetic, and non-kinetic composite target packages supporting Combatant Commands and Component specified information superiority effects and objectives across the full spectrum of conflict from tactical operations to an Anti-Access Area Denial (A2AD) strategy.\n\nFY 2017 funding is dedicated to upgrading the virtualized SOA for the SUTER program system delivered in FY 2015, improvements in core technology security\/Information Assurance, and addition of additional systems and data types."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SUTER Software Development"
                                    },
                                    "Description": {
                                        "val": "Planned efforts include development and release of SUTER software upgrade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- Completed development of first increment of SUTER software upgrade \n  effort  \n- Continued the SUTER software development and testing which focused on machine-to-machine (M2M) interface capability and the SOA upgrades \n- Worked on security software to attain network accreditation which reduced time to pull information from other database sources, improve security management, and allow more flexibility for operational decision makers\n- Funding to continue these efforts was provided by Core Technology project within the NCCT PE"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.316"
                                            },
                                            "Text": {
                                                "val": "- Delivering the first increment of SUTER to two AOCs providing world-wide access to all AOC users\n- Continuing development of further software upgrade increments improving security management, and allowing more flexibility for operational decision makers with a focus on incorporating additional data sources to inject into SUTER via M2M interface (data sources include Combatant Commanders targets, extensive telephone networks, and hierarchical adversary unit relationships)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.495"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.495"
                                            },
                                            "Text": {
                                                "val": "- Will continue further delivery of SUTER to all three AOC nodes\n- Will also continue further development of software upgrade increments improving security management and introducing flexibility upgrades for operational decision makers that will enable auto generation of target recommendations and data gap analysis focusing on tactical\nintelligence gathering and further expansion of data sources to inject into SUTER via M2M interface (one upgrade will include electrical power grids which will enable the modeling of basic power flow)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The SUTER capabilities are developed, maintained and sustained with baseline\/incremental upgrades plus any Quick Reaction Capability (QRC) developments acquired through the 645th Aeronautical System Group (AESG, a.k.a. BIG SAFARI System Program Office or SPO) in accordance with the BIG SAFARI Program Management Directive (PMD) and the BIG SAFARI Class Justification and Authorization (J&A) documents for acquisition of supplies and services.  The procured supplies and services are supported by the BIG SAFARI Life Cycle Management Plan (LCMP) across the full spectrum of system life cycle management -- developmental engineering to system retirement (\"cradle to grave\" support concept).  Due to the rapidly changing threat environment encountered during our prolonged commitment to Overseas Contingency Operations (OCO), the acquisition program manager has the authority to redirect funding as necessary to meet current stated and emerging\/evolving Combatant Commander requirements.  645th AESG, Wright Patterson AFB OH, manages the Cost Plus Fixed Fee (CPFF) contracts used to develop SUTER.  645th AESG will develop SUTER software on common hardware for systems and platforms designated to field this ISR capability.  Individual program management offices may contract directly with their prime contractors or through the 645th AESG for integration of these ISR capabilities on their respective systems and platforms."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SUTER"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Analyst Warehouse, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Baltimore, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.081"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.243"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.243"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development Test"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Analyst Warehouse, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Baltimore, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.235"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.252"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.252"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.1 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.2 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.3 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.4 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.5 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.6 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.7 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.8 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.9 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.10 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.11 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.12 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.13 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUTER 6.1.14 Development, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}