{
    "id": "efda83c1ea1a4bb128c9329a96eb68bc1a8f986e",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604659N"
        },
        "ProgramElementTitle": {
            "val": "(U)Precision Strike Weapons Development Program"
        },
        "R1LineNumber": {
            "val": "84"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "9.595"
            },
            "BudgetYearOne": {
                "val": "9.910"
            },
            "BudgetYearOneBase": {
                "val": "9.910"
            },
            "BudgetYearTwo": {
                "val": "45.088"
            },
            "BudgetYearThree": {
                "val": "65.094"
            },
            "BudgetYearFour": {
                "val": "125.097"
            },
            "BudgetYearFive": {
                "val": "135.108"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY16 and later funding for the Next Generation Land Attack Weapon has moved from Program Element 0204229N (Tomahawk Mission Planning Center) to 0604659N (Precision Strike Weapons Development Program) under the same Project Unit of 3378."
        },
        "ProgramElementMissionDescription": {
            "val": "Initial and continuing development of strike weapons consisting of armament, munitions, and weapon subsystems to allow for the horizontal integration among current and future weapon system capabilities to provide enhanced anti-surface and land strike capabilities in a demanding Anti-Access Area-Denial environment. This program provides for the development of weapon and weapon system technologies to address future requirements for enhanced and alternative weapon system capability requirements that include selectable output weapons, low collateral damage weapons, precision lethality weapons, area weapons, alternative warhead technology, Insenstive Munitions (IM), scaled munitions, DoD fuzing systems, sensors, extended range weapons and precision guided training round technology.\n\nThe Precision Strike Weapons Development Program Element (PE) supports the Next Generation Strike Capability (NGSC) by funding Next Generation Land Attack Weapon (NGLAW); a surface\/submarine fired survivable, long range, multi-mission, multi-platform conventional strike capability fielding in the 2028-2030 timeframe. The Next Generation Strike Capability (NGSC) strategy will address future threats in time to replace or update legacy weapons while bringing next generation technology to Department of the Navy (DoN) standoff conventional strike (Land Attack & ASuW). Within NGSC, NGLAW will be capable of attacking land and maritime, stationary and mobile targets while supporting two of the Navy's primary mission areas: 'Power Projection' (land attack from the sea\/undersea) and 'Sea Control' against enemy surface action groups\/combatants. To the maximum extent possible, NGSC will utilize common components and component technologies (e.g. navigation; communications; seeker; guidance and control) across the air-launched and sea-launched missile variants to reduce cost, shorten development timelines, and promote interoperability. \n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under ADVANCED COMPONENT DEVELOPMENT AND PROTOTYPES because it includes all efforts necessary to evaluate integrated technologies, representative models or prototype systems in a high fidelity and realistic operating environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "9.595"
                },
                "BudgetYearOne": {
                    "val": "65.243"
                },
                "BudgetYearOneBase": {
                    "val": "65.243"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "9.595"
                },
                "BudgetYearOne": {
                    "val": "9.910"
                },
                "BudgetYearOneBase": {
                    "val": "9.910"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-55.333"
                },
                "BudgetYearOneBase": {
                    "val": "-55.333"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-20.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-20.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-35.333"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-35.333"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Schedule: PU 3378\nAnalysis of Alternatives (AoA) changed from 1Q FY16-2Q FY17 to 2Q FY16-2Q FY18 due to revised Cruise Missile Strategy required to complete definition of requirements analysis. \nAdded ICD Staffing 1Q FY16-2Q FY16 to reflect pre Analysis of Alternative activities. \nAdded Initial Capabilities Document (ICD) Approval to 2Q FY16 to reflect approval of pre-Analysis of Alternatives acquisition documentation. \nAdded Technology Maturation & Risk Reduction (TMRR) phase 2Q FY18-4Q FY21 due to updated Cruise Missile Strategy that includes a FY28-FY30 Initial Operational Capability.\nMoved Material Solution Analysis from 1Q FY16-4Q FY18 to 3Q FY16-2Q FY18 due to updated Systems Engineering Technical Review (SETR) Strategy. \nSystem Readiness Review (SRR), Preliminary Design Review (PDR), Milestone B, Engineering Manufacturing and Development (EMD) phase and Critical Design Review (CDR) removed due to updated Cruise Missile Strategy that includes a FY28-FY30 Initial Operational Capability (IOC) versus a FY24 IOC."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3378"
                    },
                    "ProjectTitle": {
                        "val": "Next Generation Land Attack Weapon (NGLAW)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "9.595"
                        },
                        "BudgetYearOne": {
                            "val": "9.910"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.910"
                        },
                        "BudgetYearTwo": {
                            "val": "45.088"
                        },
                        "BudgetYearThree": {
                            "val": "65.094"
                        },
                        "BudgetYearFour": {
                            "val": "125.097"
                        },
                        "BudgetYearFive": {
                            "val": "135.108"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding is provided for the Next Generation Land Attack Weapon (NGLAW) that includes a survivable, long range, multi-mission, multi-platform (surface and subsurface) conventional strike capability in the FY28-FY30 timeframe. NGLAW will address future threats while bringing ship\/submarine Next Generation Strike Capability (NGSC) to Department of the Navy (DoN) standoff conventional strike (land and maritime attack). NGLAW will be capable of attacking land and maritime, stationary and mobile targets while supporting two of the Navy's primary mission areas: 'Power Projection' (land attack from the sea\/undersea) and 'Sea Control' against enemy surface action groups\/combatants. To the maximum extent possible, the Navy will utilize common components and component technologies (e.g. navigation; communications; seeker; guidance and control) to reduce cost, shorten development timelines, and promote interoperability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Land Attack Weapon (NGLAW)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.595"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct NGLAW AoA assessing weapons systems, emergent technologies, and industry Internal Research and Development (IRAD) activities\/proposals that can be used across multiple mission areas to reduce risk, development time and cost. Conduct threat assessments based on current and future scenarios and environments to inform performance requirements and relevant technology. Additionally, these technologies will be assessed for their maturity and applicability to fielded and future weapons to address expanded target sets to include mobile and moving land\/maritime targets. Results of the analysis will inform the requirement and acquisition approach to deliver an affordable, long term Strike Weapon."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.910"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.910"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue NGLAW AoA assessing weapons systems, emergent technologies, and industry Internal Research and Development (IRAD) activities\/proposals that can be used across multiple mission areas to reduce risk, development time, and cost. Complete threat assessments based on current and future scenarios and environments to inform performance requirements and relevant technology. The AoA will identify critical technologies that require maturation and these technologies will require investment to mature to a Technology Readiness Level (TRL) 6, appropriate for current and future acquisition programs."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Acquisition strategy will be influenced by the output of the AoA and the Material Development Decision (MDD)."
                        },
                        "PerformanceMetrics": {
                            "val": "Conduct NGLAW AoA."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Development Support- funding in FY17 required to complete requirements definition and acquisition approach associated with NGLAW."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC-WD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "China Lake, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.838"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.641"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.641"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development Support- AIR 4.0M"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC-AD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.838"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.370"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.370"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JHU\/APL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.919"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.899"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.899"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2017PB_0604659N_3378_FILE1.PNG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Next Generation Strike Weapon"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Acquisition Milestones: Milestones: ICD Staffing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Acquisition Milestones: Milestones: ICD Approval"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Acquisition Milestones: Milestones: Analysis of Alternatives"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Systems Development: Systems Development: Material Solution Analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Systems Development: Systems Development: Technology Maturation & Risk Reduction"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}