{
    "id": "f98b9511f9ad7ff2d229192644e89c479379ac48",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603640M"
        },
        "ProgramElementTitle": {
            "val": "MC Advanced Technology Demo"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "125.696"
            },
            "CurrentYear": {
                "val": "131.490"
            },
            "BudgetYearOne": {
                "val": "140.416"
            },
            "BudgetYearOneBase": {
                "val": "140.416"
            },
            "BudgetYearTwo": {
                "val": "142.407"
            },
            "BudgetYearThree": {
                "val": "142.368"
            },
            "BudgetYearFour": {
                "val": "142.368"
            },
            "BudgetYearFive": {
                "val": "142.368"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval Science and Technology (S&T) Strategic Plan approved by the S&T Corporate Board (20 January 2015). This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps)to include specific Marine Corps objectives defined by the USMC S&T Strategic Plan. It provides the vision and key objectives for the essential S&T efforts that will enable the continued supremacy of United States Naval forces in the 21st century. The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. It also directly supports Expeditionary Force 21 (EF 21), which is now the Marine Corps' capstone concept that establishes  the vision and goals for USMC S&T over the next 10 years and provides a plan for guiding the design and development of the future force.  One third of the Marine Corps operating forces will be forward  deployed.  These forces will be task-organized into a greater variety of formations, capable of operating from a more diverse array of ships dispersed over wider areas, in order to meet the Combatant Commanders' security cooperation and partner engagement requirements.  In the event of crises, those forces will be able to composite these distributed formations into larger, cohesive naval formations.  This presents both challenges and opportunities for USMC S&T. Expeditionary Force 21 will inform future decisions regarding how the Marine Corps will adjust organizational structure to exploit the value of regionally focused forces.  A fixed geographic orientation will facilitate Marine Commanders and their staffs with more frequent interactions with theater- and component-level organizations, establishing professional bonds and a shared sense of the area's challenges and opportunities.  Expeditionary Force 21 provides the basis for future Navy and Marine Corps capability development to meet the challenges of the 21st Century.  The vision for Expeditionary Force 21 is to provide guidance for how the Marine Corps will be postured, organized, trained, and equipped to fulfill the responsibilities and missions required around the world.  Through Expeditionary Force 21, the Marine Corps intends to operate from the sea and provide the right sized force in the right place, at the right time.\n\nAs a key component of naval expeditionary forces, the Marine Corps has unique and technologically stressing requirements because of its expeditionary mission and intensive operational tempo, Marine Air-Ground Task Force (MAGTF) structure, and conduct of maneuver warfare. Critical requirements in this PE are: Command, Control, Communications, Computers (C4); Intelligence, Surveillance, and Reconnaissance (ISR); maneuver techniques and means; force protection; logistic sustainment; human performance, training and education; and firepower. There are ongoing actions to develop and demonstrate advanced technologies and concepts in operational environments. Joint service efforts are aligned with Defense Technology Objectives and Joint Warfighting Capability Objectives. In addition, there is funding for experimentation in warfighting concepts as well as operational assessment of emerging technologies, to include technical support of operating forces to assess military utility of selected technologies. This PE specifically supports: continued development of enhanced warfighting capabilities through field experiments with Marine operating forces; rapid response to low-, mid-, and high-intensity conflicts as well as methods for countering irregular threats; and expansion of seabasing and naval force packaging capabilities. The investment directly assists in fulfilling the forward presence requirements of Sea Shield and the transformational capabilities prescribed by Sea Strike. The Future Naval Capability (FNC) process is supported and funds are programmed accordingly. This PE is largely focused on demonstration of products and capabilities from the knowledge base and Discovery and Invention (D&I) phases of Naval S&T. As Naval partners, the Navy and Marine Corps S&T Team strive to transition technologies that will implement objectives outlined in the Naval Operations Concept. This PE also funds technical solutions designed to increase Naval force capability, such as the Naval Expeditionary Combat Command. Investments in S&T provide the opportunities for future capabilities and will prevent technological surprise. The PE as a whole will advance the amphibious and expeditionary capabilities for the Combatant Commanders. The Marine Corps Service Campaign Plan (MCSCP, guided by the Commandant's Planning Guidance, is the lens through which USMC S&T priorities are acted upon in order to support the future development of the Total Force.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "128.320"
                },
                "CurrentYear": {
                    "val": "137.562"
                },
                "BudgetYearOne": {
                    "val": "140.416"
                },
                "BudgetYearOneBase": {
                    "val": "140.416"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "125.696"
                },
                "CurrentYear": {
                    "val": "131.490"
                },
                "BudgetYearOne": {
                    "val": "140.416"
                },
                "BudgetYearOneBase": {
                    "val": "140.416"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.624"
                },
                "CurrentYear": {
                    "val": "-6.072"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.103"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-5.969"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.624"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2223"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps ATD"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "84.107"
                        },
                        "CurrentYear": {
                            "val": "88.818"
                        },
                        "BudgetYearOne": {
                            "val": "93.355"
                        },
                        "BudgetYearOneBase": {
                            "val": "93.355"
                        },
                        "BudgetYearTwo": {
                            "val": "94.664"
                        },
                        "BudgetYearThree": {
                            "val": "94.925"
                        },
                        "BudgetYearFour": {
                            "val": "93.976"
                        },
                        "BudgetYearFive": {
                            "val": "93.976"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Critical Marine Corps requirements\/imperatives addressed in this Project are: Maneuver; Force Protection; Human Performance, Training and Education; Logistics; Command, Control, Communications and Computers (C4); Intelligence, Surveillance and Reconnaissance (ISR) and Firepower.   These are ongoing efforts to develop and demonstrate advanced technologies and system concepts in an operational environment.  Multiple transitions into the Sub-system\/Component Advanced Development Phase are planned, as well as fieldable prototyped to reduce risk in System Concept Development and Demonstration.  A tactically effective Mine Countermeasures (MCM) capability is vital to Force Protection and necessary if Maneuver on land is to become a functional component of Naval Expeditionary Maneuver Warfare.  Maneuver, supported by MCM provides synchronization and speed of detection, breaching, clearance, proofing, and marking operations.  This project supports: 1) engaging regional forces in decisive combat on a global basis; 2) responding to all other contingencies and missions in the full spectrum of combat operations (high, middle, and low intensity), in Military Operations in Urban Terrain (MOUT), and in Operations other than War (OOTW); and 3)  warfighting experimentation.  By providing the technologies to enable these capabilities, this project supports the goals and objectives of the Strike, Littoral Warfare and Surveillance Joint Mission Areas.  These are ongoing efforts to develop and demonstrate advanced technologies and system concepts in an operational environment. \n\nIn addition, this project supports the goals and objectives of the Littoral Combat\/Power Projection related Enabling Capability (EC) within the Future Naval Capabilities (FNC) portfolio.  The focus of the EC within this PE is technology related to Urban, Asymmetric, and Expeditionary Operations (UAEO).  The UAEO Capability Gap is a science and technology developmental area that is of the highest importance to Marine Corps operations in Iraq and Afghanistan and is one of the highest ranked Capability Gaps prioritized by the Chief of Naval Operations and the Marine Corps Combat Development Command (MCCDC).  The UAEO technology gap is being pursued as part of an overall effort that addresses the Sea Strike Capability Gap."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMMAND, CONTROL, COMMUNICATIONS, COMPUTERS (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity integrates and demonstrates enhanced communications and situational awareness in warfighting environments and communication and situational awareness technologies for near term USMC operations. The focus is on development and leveraging advanced C4 technologies to enable enhanced Distributed Operations, Irregular Warfare, and Marine Corps Expeditionary Warfare.  Specifically, the C4 Thrust intends to demonstrate markedly improved capabilities in over-the-horizon (OTH), beyond line-of-sight, and restricted environment communications; mobile networking; tactical decision making; tactical situational awareness; and small unit position location and navigation.  Advanced technology resources will be applied to complement commercial, other service, and defense agency investments to produce a technology base to address identified Marine Corps technology gaps."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.124"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued urban navigation with limited Global Positioning System availability demonstrations.\n- Continued demonstrations of improved urban communications capabilities.\n- Continued developing tailored tactical Human to Machine Interfaces aligned to primary operational functions and non-intrusive within the battlespace.\n- Continued creating services for the tactical network that are fully operable with DCGS and the DCGS Integration Backbone.\n- Continued Application-Network Architectures, Conformal Antenna Integration and Demonstration Spiral 2 and C3 for the Individual Marine Spiral Two.\n- Continued Application Network Architecture and Automated Small Unit Decision Tools.\n- Continued Advanced Communications Systems and Small Unit C3.\n- Continued smart radio efforts.\n- Completed creating a service oriented sensor network for expeditionary forces' current and future tactical sensors.\n- Initiated Tactical Cyber Warfare.\n- Initiated mobile security.\n- Initiated Networking On-The-Move Technology insertion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.374"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above.\n- Complete mobile security.\n- Initiate MAGTF C2 Technology insertion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete demonstrations of improved urban communications capabilities.\n- Complete Application-Network Architectures, Conformal Antenna Integration and Demonstration Spiral 2 and C3 for the Individual Marine Spiral Two.\n- Complete Application Network Architecture and Automated Small Unit Decision Tools.\n- Complete urban navigation with limited Global Positioning System availability demonstrations\n- Complete Advanced Communications Systems and Small Unit C3.\n- Initiate an Advanced HF Antenna effort."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIREPOWER"
                                    },
                                    "Description": {
                                        "val": "This activity develops technology for application on current and future expeditionary weapons and elements of the kill chain.  It includes, but is not limited to, the following technologies: fuze, fire control, launch\/propulsion, lethality, and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.997"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of targeting and engagement technologies for distributed operations collaborative fires integration and demonstrations.\n- Continued design, development, prototyping and testing of lightweight technologies that provide individual Marines enhanced capabilities to detect and identify man-size targets out to at least the maximum effective range of their personal weapons during all conditions (daylight, limited visibility, & darkness) by integrating multiple capabilities into a single system.\n- Continued E&D portion of Awareness for Lightweight Engagements and Remote Targeting (ALERT) to develop large aperture, lightweight lens with enhanced fields of view.\n- Continued E&D portion of Semi-Autonomous Fires Technology (SAFT) to develop semi-autonomous fire control systems for use in next generation remote weapons systems, to enhance performance and minimize gunner\/operator burden.\n- Completed scalable effects conventional warhead concept development.\n- Completed improved mortar munition integration and demonstrations.\n- Completed Flight Control Kinematic Unit effort (effort renamed Flight Control Mortar). Design & develop technology that provides guidance, navigation, and controls (GNC) to 81mm mortar rounds to enable trajectory shaping in urban environment to precisely & accurately strike specific targets.\n- Completed Non-Magnetic Azimuth Sensing technology.\n- Completed development of Miniature Urban Missile, leveraging technology from MEMS, designation, guidance and control, and warhead design, to develop a shoulder launched missile capable of defeating a variety of targets.\n- Completed development of precision 60mm mortar system, to demonstrate increased precision, range, and lethality in a light mortar, providing indirect fire support through projectile flight trajectory shaping.\n- Completed Weapons Spectral Signature Characterization and Mitigation (WSSCM) to develop pigments, dyes, and polymers to mitigate Short Wave Infrared (SWIR) signature for weapons systems applications.\n- Initiated investigation of the scalability of variable effects conventional munitions, gun, and propulsion technologies for improving firepower effectiveness while increasing affordability and decreasing logistics burden in support of expeditionary warfare.\n- Initiated development of precision fires engagement technologies, to include trajectory shaped 81mm mortars, 83mm missiles, and smaller precision munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.365"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above.\n- Initiate High Reliability Dual Purpose Improved Conventional Munitions (DPICM) Replacement (HRDR) to include projectile integration, lethality enhancement, fuze setting integration and aerodynamic and aerospace technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.521"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.521"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE PROTECTION"
                                    },
                                    "Description": {
                                        "val": "This activity supports the Force Protection Thrust's Advanced Technology Demonstration efforts in the areas of individual Marine platforms, equipment and autonomous systems.  This includes technologies to enable detection, neutralization, breaching, and clearing of explosive hazards from the beach exit to inland objectives.  Efforts supported under Force Protection also include the demonstration of technologies such as Air Defense\/Counter Rocket, Artillery, and Mortar (CRAM) and counter tactical surveillance and targeting, including pre-shot sniper detection, technologies in support of maneuver warfare, small unit distributed operations, and technologies for improved Personnel Protective Equipment for individual protection against blast, ballistic, and blunt impact threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.378"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of technologies to defeat side\/top attack and advanced fuze mines through signature reduction and advanced signature duplication.\n- Continued development of technologies to locate and defeat IEDs.\n- Continued development of technologies to defeat advanced mine fuzes (seismic, acoustic, and infrared).\n- Continued Anti-Tank Guided Missile (ATGM) effort to defeat ATGMs in complex urban environment.\n- Continued Warfighter modeling and simulation efforts for the Warfighter-as-a-System analysis approach and methodology combining survivability, mobility, and warfighter performance parameters.\n- Continued demonstration of laser technology readiness for battlefield employment. \n- Continued physics-based characterization of signatures of proud\/buried targets\/explosive hazard indicators across the spectrum of applicable detection modalities using knowledge\/investigation of target physics.\n- Continued a program to demonstrate the fusion of multiple modes of detection of explosive hazards into a single system.\n- Continued development of advance modular and scalable personal protective equipment utilizing advances in mobility\/survivability modeling and simulation, materials, and bio-fidelic surrogates.\n- Continued development of materials and helmet systems that absorb\/dissipate blast shock waves\n- Continued an advanced technology demonstration for modular mission packages for the detection, neutralization, marking and reporting of explosive hazards using multiple, existing vehicles in movement to contact and amphibious raid scenarios.\n- Continued an advanced technology demonstration for autonomous vehicles in the detection, neutralization, marking and reporting of explosive hazards using multiple, existing vehicles in movement to contact and amphibious raid scenarios.\n- Continued an advanced technology demonstration that detect and classify tactical surveillance and targeting threats before engagement from a moving platform.\n- Completed the demonstration of the feasibility of a deployable mission package consisting of technologies capable of screening multiple individuals rapidly over a wide area to detect, classify and track suicide bombers at relevant distances within a critical time frame for action. \n- Completed the development of detecting and locating sniper weapons using the return of their unique radar signatures.\n- Completed fusion of technologies that will detect and classify optics (sniper scopes, ccds, eyeball, etc) from a moving platform. \n- Completed the development of automated human detection via spectral imaging during low-light level operation conditions (e.g. dusk\/dawn\/moonlit\/starlit night). \n- Initiated an integrated technology demonstration to develop a system of systems that addresses route reconnaissance and clearance for a MEU.\n- Initiated a project to develop organic technology solutions for the detection and clearance of explosive hazards and obstacles encountered by Marine Corps forces during amphibious operations.\n- Initiated a project to investigate the detection and neutralization of explosive hazards in multiple, diverse, environments.\n- Initiated a program to fuse multiple technologies that will detect and classify tactical surveillance and targeting threats before engagement from a moving platform. \n- Initiated projects to develop Personnel Protection Equipment (PPE) through novel Modular, Tailorable and scalable design concepts which increase survivability and operational suitability to the warfighter.\n- Initiated broad based material (ceramics, fiber and Fiber Re-Enforced Plastics) to demonstrate the possibility of significant weight reductions (greater than 50%) can be achieved."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.838"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above.\n- Complete Anti-Tank Guided Missile (ATGM) effort to defeat ATGMs in complex urban environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.720"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.720"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete a program to fuse multiple technologies that will detect and classify tactical surveillance and targeting threats before engagement from a moving platform.\n- Complete development of materials and helmet systems that absorb\/dissipate blast shock waves.\n- Initiate an advanced technology demonstration that uses Warfighter modeling and simulation efforts and advanced materials to create, test, and evaluate modular and scalable personal protective equipment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN PERFORMANCE, TRAINING & EDUCATION"
                                    },
                                    "Description": {
                                        "val": "This activity addresses the applied research effort of the Human Performance Training and Education thrust (HPT&E).  The HPT&E thrust investment profile is directed at two technology investment areas, Warrior Resilience, and Decision Making and Expertise Development. The funding aligned to Warrior Resilience is focused on advanced training technologies and methodologies that enhance neural, cognitive, and physical readiness.  Those funds aligned to Decision Making and Expertise Development refers to training and education technologies and methodologies that accelerate the development and improve the retention of skills in decision making, situation awareness, and individual and team adaptability and coordination on decentralized, dynamic and dispersed battlefields."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.255"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued the development of small-unit training for adaptability and resiliency in decision making (SUDM), to enhance the Marine Air Ground Task Force's capabilities by training and equipping small-unit leaders to handle the demanding complexities and possess the adaptive mindset necessary to operate across the spectrum of conflict; empowering our strategic corporals as well as all of our junior leaders to fight, operate, and win in this challenging security environment. \n- Completed team immersive language and cultural learning in simulation environments.\n- Completed development of physical conditioning assessment and training optimization methods to improve warfighter performance  \n- Completed mobile field technologies for predicting readiness and performance into more advanced development and demonstration of utility.\n- Completed development of technologies and methodologies for integrated mental skills resilience training (previous efforts neural mechanisms of mental skills resilience).\n- Completed the development of rapid auto cognitive task analysis(AutoCTA), to address the problems associated with accurately determining training system requirements, to develop a standardized, theory driven and JCIDS aligned, rapid CTA technique for extracting knowledge from experts and efficiently modeling tasks. \n- Completed development of technology to improve the transfer and maintenance of resilience training in the Marine Corps, to include measures of climate for Warfighter resilience, and small unit leader and team member training to enhance climate resilience, social support, and relapse prevention modules for deployment.\n- Initiated design and development of a Marine augmented classroom environment (ACE) that will enhance instructors' teaching performance and student learning outcomes. \n- Initiated design and development of a test-bed and conduct The Basic School evaluation to test the efficacy of simulation based training in that curriculum. \n- Initiated development and demonstrate an agent-based surrogate instructor development environment (ASIDE) to allow USMC to field small-team focused intelligent training solutions. \n- Initiated development of training to optimize the use of resilience skills (TOURS), specifically develop and iterate training modules for relapse prevention, deployable refresher training, supports for transfer climate and social support for small unit leaders. \n- Initiated development of an individualized fatigue countermeasure training tool for Marines that will provide increased fatigue resilience training effectiveness, improved fatigue management and reduced fatigue-related operational errors. \n- Initiated development of a master instructor development system (MIND) which will provide measurement framework to support the development of master instructors by creating a developmental model of instructor mastery. \n- Initiated design and development of methods for establishing optimal training intervals for the Marine Corps Martial Arts Program (MCMAP) for improvement in physical performance and warrior mindset."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.767"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above.\n- Complete the development of training to optimize the use of resilience skills (TOURS), specifically develop and iterate training modules for relapse prevention, deployable refresher training, supports for transfer climate and social support for small unit leaders.\n- Complete design and development of methods for establishing optimal training intervals for the Marine Corps Martial Arts Program (MCMAP) for improvement in physical performance and warrior mindset.\n- Initiate the development of measures of training effectiveness that connect training tasks with measures of performance under various stressors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.207"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.207"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete design and development of a test-bed and conduct The Basic School evaluation to test the efficacy of simulation based training in that curriculum. \n- Complete development and demonstrate an agent-based surrogate instructor development environment (ASIDE) to allow USMC to field small-team focused intelligent training solutions. This effort initiated in FY 2013 due to operational requirements.\n- Complete design and development of a Marine augmented classroom environment (ACE) that will enhance instructors' teaching performance and student learning outcomes. \n- Initiate a unified theory of warrior resilience and fitness to enhance performance and mitigate injuries at the infantry small unit level."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INTELLIGENCE, SURVEILLANCE, AND RECONNAISSANCE (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity supports the demonstration of technologies to enhance situational awareness and tactical decision making through automated analysis, fusion of data, rapid integration of information, and acquired knowledge resulting in actionable intelligence at the lower command levels. The activity includes the demonstration of ISR efforts involving enhanced reconnaissance and persistent surveillance, and sensors for unmanned ground and aerial vehicles.   Advanced Technology demonstrations also include the collection of information [monitoring, sensing, and locating] in the 3D urban battlespace as well as exploiting information [identifying and classifying data] as part of the intelligence preparation of the battlespace in order to facilitate operational maneuver and distributed operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.545"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued new Actionable Intelligence for Expeditionary and Irregular Warfare efforts which include Human Network Decision Modeling and the fusion across modeling approaches to increase prediction accuracy.\n- Continued the development of a workflow manager capable of cloud service discovery and configuration.\n- Continued research on the development of automated data tagging algorithms that enable connected graphs of structured and unstructured data.\n- Continued technology development required to enable tactical UAS on-board processing of terabytes of data in real time.\n- Continued development of a user composable search and display capability enabled by map reduce technology.\n- Continued Tagging, Tracking, and Locating efforts to demonstrate a system that will automatically translate large amounts of wide area surveillance data into tracks, useful to expose entity to entity associations; build urban context, as well as detect events and anomalies; and associate objects, tasks, locations and events for creating actionable intelligence.\n- Continued project to improve the enterprise recognition of critical tactical information relevant to real-time mission execution. \n- Continued project to demonstrate the feasibility of analytic populated big data architectures to populate and maintain a global knowledge environment relevant to rapid turn amphibious mission planning.  \n- Continued project to develop a set of video analytic classifiers (entity, behavior, and scene) that can run in a power efficient manner in embedded hardware.\n- Continued project to improve expeditionary force capabilities to discover and process data across integrated cross domain systems.\n- Continued project to enable the synchronized planning and management and ISR assets given a set of disparate mission information requirements. \n- Continued project to enhance the extraction of target quality information from unregistered unstructured images and imagery.\n- Continued effort to automate the design and conduct of use cases relevant to tactical information requirements.\n- Completed development of advanced tactical sensor nets that localize mobile detection of threats in a complex environment. \n- Completed development and demonstration of measurement and signature intelligence data management and integration capability. \n- Completed efforts to refine enemy course of action prediction software to adapt to stimuli.\n- Completed development of tactical sensor nets with organic unattended multi-level security processing and information dissemination.\n- Completed new Relevant and Situational Information on Demand such as Identity Dominance Enabled by an Integrated Biometric\/Tag Track and Locate (TTL) Capability, providing human tracking algorithms based on models of biometric (face, voice and soft) and TTL (optical taggant) capabilities and modeling a biometric\/optical taggant system relevant to human tracking across an urban 5 km x 2 km area.\n- Completed efforts to develop methods and techniques for investigating open source information on the Internet to form a human terrain map indicating space and time features to aid network identification and prediction of enemy activity.\n- Completed efforts to incorporate social models for human decision making with statistical models.\n- Completed efforts to extend the utility of track classification algorithms to sparse data.\n- Completed efforts to automatically fuse data across all identifiers (TTL, biometrics, symbols) based on similarity measures.\n- Completed efforts to show entity tracking using disparate ground and air sensors and tools that automatically compute latent area atmospheric measures.\n- Completed development of model based own force decision tools based on adversarial decision making models. \n- Completed development of an active layered sensing capability.\n- Completed research to develop more audio exploitation algorithms that can be used on audio files with a low signal to noise.\n- Initiated research to develop concept based information retrieval from unstructured data sources based on structured grammars or intensity vectors.\n- Initiated research to develop a capacity to run tracklett fusion, track analysis and data to track or track to track correlation as a distributed service run as a map-reduce job, both forensically and in real time.  \n- Initiated research to develop a prototype system capable of maintaining the entity models needed for entity co referencing during real time natural language processing workflows.\n- Initiated research on the development of a capability to automate the extraction of video events relevant to mission information needs in real time on power efficient hardware.\n- Initiated research on implementing orchestrated advanced analytics running across cloud and non-cloud based architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.730"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above.\n- Complete new Actionable Intelligence for Expeditionary and Irregular Warfare efforts which include Human Network Decision Modeling and the fusion across modeling approaches to increase prediction accuracy.\n- Complete the development of a workflow manager capable of cloud service discovery and configuration.  \n- Complete Tagging, Tracking, and Locating efforts to demonstrate a system that will automatically translate large amounts of wide area surveillance data into tracks, useful to expose entity to entity associations; build urban context, as well as detect events and anomalies; and associate objects, tasks, locations and events for creating actionable intelligence.\n- Complete research to develop concept based information retrieval from unstructured data sources based on structured grammars or intensity vectors. \n- Initiate project to optimize the collection planning process through automation by automatically generating sensor plans, automating the production of information products, and delivering the most relevant information to the warfighters to enable rapid response in an evolving intelligence environment.  \n- Initiate project to develop a capability to automatically deliver mission relevant information to an agile tactical unit based on mission ontologies, user preferences and high level descriptions of information needs.\n- Initiate project to develop a capability that will track and enhance mission readiness enabled by a dynamic machine understanding of mission information needs, a matured sensor optimization ability and operations research applied to course of action analysis.\n- Initiate the development of level 1 and level 2 fusion capabilities applied to complex graphs.\n- Initiate the development of cost functions for predictions made from data embedding spaces. \n- Initiate the development of complex event detection that is informed by entity pedigree."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.170"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.170"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete research on the development of automated data tagging algorithms that enable connected graphs of structured and unstructured data.\n- Complete technology development required to enable tactical UAS on-board processing of terabytes of data in real time.\n- Complete research to develop a capacity to run tracklett fusion, track analysis and data to track or track to track correlation as a distributed service run as a map-reduce job, both forensically and in real time.\n- Complete research to develop a prototype system capable of maintaining the entity models needed for entity co referencing during real time natural language processing workflows.\n- Complete research on technologies needed to tailor information delivery to warfighters based on mission context and user preferences.\n- Complete project to enhance the extraction of target quality information from unregistered unstructured images and imagery.\n- Initiate the development of a knowledge informed workflow manager capable of generating workflows automatically in response to alert conditions.\n- Initiate the development of power efficient neuro inspired algorithms for machine understanding."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LITTORAL COMBAT\/POWER PROJECTION (LC\/PP)"
                                    },
                                    "Description": {
                                        "val": "This activity addresses the advanced technology development associated with associated with the Marine Corps participation in the Department of the Navy's (DoN) Science and Technology Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the DoN Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are generated by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders.  The funding is aligned with the Naval challenges associated with projecting power despite anti-access and area denial, specifically the Sea Shield, Power and Energy, FORCEnet, and the Naval Expeditionary Maneuver Warfare warfighting capability gaps. The funding profile reflects the alignment of the FNC program investments into Enabling Capabilities (ECs); ECs respond to priority Naval warfighting capability gaps.  Funding for each EC is aligned to a 6.2 or 6.3 Budget Activity (BA) as appropriate.\n\nThe FY2016 to FY2017 increase in the Littoral Combat\/Power Projection activity is due to a FY2016 Congressional reduction and will realign the activity to its original programming levels in FY2017.  Accordingly, the Future Naval Capabilities within the activity will be re-phased and amended appropriately to accommodate the delta."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.368"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of wide area surgical and persistent surveillance technologies. \n- Continued development of the Ground Based Air Defense On-the-move high energy laser demonstrator.  \n- Continued development of modular scalable effects prototype weapon.\n- Continued development of tactical urban breaching technologies.\n- Continued development of counter improvised explosive devices technologies.\n- Continued development of advanced survivability and mobility technologies for Marine Corps tactical and combat vehicles. \n- Continued development of technologies to lighten the load of warfighters by 1) reducing the weight of and improving the capability of the day\/night weapon sight, 2) eliminating battery incompatibility, and 3) providing Graphical User Interface (GUI-based) software for tradeoff analyses based on Military Operational Posture.  \n- Continued the development of a wide area hyperspectral sensor for small UAS platforms.\n- Completed development of fuel efficient Medium Tactical Vehicle Replacement (MTVR) technologies. \n- Initiated development of an azimuth and inertial navigation system (AIMS).   \n- Initiated development of spectral and reconnaissance imagery for tactical exploitation (SPRITE)-(EMW-FY14-01), previously funded in 0603673N)  \n- Initiated development of Target Processing Center (TPC) sensor correlation and fusion technology; specifically, context fusion, and radar fusion and false track mitigation. \n- Initiated development of technologies to enable the exchange of actionable information at the tactical edge; specifically, actionable information tactical applications, data conditioning and network adaptive communication services.\n- Initiated the development of advanced models that translate changes in METOC conditions to changes in mission task measures of effectiveness.\n- Initiated the development of algorithms capable of improving the accuracy of the threat picture in a targeting processing center."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.255"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above.\n- Complete development of an azimuth and inertial navigation system (AIMS).\n- Complete development of modular scalable effects prototype weapon. \n- Complete development of tactical urban breaching technologies.\n- Complete development of counter improvised explosive devices technologies. \n- Complete development of advanced survivability and mobility technologies for Marine Corps tactical and combat vehicles. \n- Complete development of technologies to lighten the load of warfighters by 1) reducing the weight of and improving the capability of the day\/night weapon sight, 2) eliminating battery incompatibility, and 3) providing Graphical User Interface (GUI-based) software for tradeoff analyses based on Military Operational Posture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.150"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.150"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above.\n- Continue development of Densified Propellant Fire From Enclosure\/Enclosed Space(DP FFE\/CS)enabling capability; specifically the analysis to incorporate tungsten into the SMAW Block 2 rocket motor propellant to decrease the detrimental effects of launch back-blast and over-pressure in confined spaces. (Effort was previously funded by PE 0603673N FY16.)\n- Initiate development of Advanced Topcoat System - Ground Vehicle Enabling Capability (EPE-FY16-01); specifically the formulation development of a high performance, zero-isocyanate Chemical Agent Resistant Coating (CARC) system that provides enhanced corrosion resistance and improved operational functionality on ground vehicle platforms.\n- Initiate the development of a high reliability distributed fuzing system for the 155mm DPICM projectile."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LOGISTICS"
                                    },
                                    "Description": {
                                        "val": "This activity supports Marine Corps Expeditionary Logistics which is the practical discipline and real world application of the deployment, sustainment, reconstitution, and re-deployment of forces engaged in expeditionary operations.  Expeditionary Logistics replaces mass with assured knowledge and speed, is equally capable ashore or afloat in austere environments, and is fully scalable to meet uncertain requirements.  Expeditionary Logistics logically divides into four pillars:  efficient and responsive force sustainment, planning and directing logistics operations, logistics demand reduction, and fleet maintenance.  These pillars are thoroughly integrated and perpetually related in execution.\n\n\nThe FY 2015 to FY 2016 increase in the Logistics Thrust Activity is due to the initiation of the intelligent microgrid systems effort in support of Expeditionary Force-21."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.042"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued exploring the development of portable fuel cell technologies capable of providing Power in the 100 Watt to 500 Watt power range.\n- Continued analysis of material alternatives for automated vehicle health monitoring and reporting.\n- Continued demonstration of advanced concepts for mobile infrastructure.\n- Continued integration and demonstration of electrochemical ultracapacitors into hybrid electric power systems. \n- Continued efforts to improve advanced electrical power generation from fuel cells and renewable sources as well as to improve the efficiency of conventional generation via hybridization and smart-grid technologies.\n- Continued integration and demonstration of advanced materials to reduce maintenance into selected vehicle and machinery components.\n- Continued the development of robotic systems to facilitate the packaging and handling of logistic supplies.\n- Continued a field demonstration of renewable energy devices and deployable equipment showing fewer liabilities when delivering expensive fuel, thereby lowering Marine Corps operational costs.\n- Completed efforts to develop a micro turbine generator capable of 100W average power.\n- Completed research into developing a replaceable electrode battery power source that consists of a metallic structure that is consumed during power generation and then easily replaced with a new metallic component that restores a full charge. \n- Completed development of a backpack that prevents oscillatory and transient peak loading forces from causing skeletal injury while enhancing human mobility with heavy loads.\n- Completed development of advanced lightweight fuel to energy conversion concepts.  This includes development of power management electronics for reducing power requirements for military radios.\n- Initiated operations research and analysis efforts to enhance seabased expeditionary supply chain concepts and technologies. \n- Initiated development of alternative (non-electrochemical) energy storage technologies for hybrid power system load management.\n- Initiated development of low energy desalination technologies to allow for efficient salt-water purification at the small\/individual scale.\n- Initiated the development of anti-fouling and non-fouling water purification components to enable enduring performance of small water purification systems.\n- Initiated the development of real-time water quality monitoring systems for use with small scale water purification systems.\n- Initiated the development of efficient water packaging and distribution technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.603"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above.\n- Complete exploring the development of portable fuel cell technologies capable of providing Power in the 100 Watt to 500 Watt power range.\n- Complete integration and demonstration of electrochemical ultracapacitors into hybrid electric power systems. \n- Initiate development of infrastructureless In-Transit Visibility (ITV) technologies to enable asset tagging, tracking, locating, and monitoring anywhere in the expeditionary supply chain.\n- Initiate the development of modular thermoacoustic systems capable of acting as power generation or heat-pump devices.\n- Initiate the development of alpha-particle semiconductors to harness energy from alpha-emitting materials and create ultra-high energy density nuclear batteries.\n- Initiate the development of ultra-high efficiency piezoelectric devices.\n- Initiate the development of intelligent microgrid systems for the expeditionary unit."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.061"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.061"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete integration and demonstration of advanced materials to reduce maintenance into selected vehicle and machinery components.\n- Complete analysis of material alternatives for automated vehicle health monitoring and reporting.\n- Complete demonstration of advanced concepts for mobile infrastructure.\n- Complete the development of robotic systems to facilitate the packaging and handling of logistic supplies.\n- Complete efforts to improve advanced electrical power generation from fuel cells and renewable sources as well as to improve the efficiency of conventional generation via hybridization and smart-grid technologies.\n- Complete operations research and analysis efforts to enhance seabased expeditionary supply chain concepts and technologies. \n- Complete development of alternative (non-electrochemical) energy storage technologies for hybrid power system load management.\n- Complete a field demonstration of renewable energy devices and deployable equipment showing fewer liabilities when delivering expensive fuel, thereby lowering Marine Corps operational costs.\n- Complete development of infrastructureless In-Transit Visibility (ITV) technologies to enable asset tagging, tracking, locating, and monitoring anywhere in the expeditionary supply chain.\n- Complete the development of modular thermoacoustic systems capable of acting as power generation or heat-pump devices.\n- Complete the development of alpha-particle semiconductors to harness energy from alpha-emitting materials and create ultra-high energy density nuclear batteries.\n- Complete the development of ultra-high efficiency piezoelectric devices.\n- Complete the development of intelligent microgrid systems for the expeditionary unit."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANEUVER"
                                    },
                                    "Description": {
                                        "val": "The Maneuver Thrust Technology Area focuses on the development, demonstration, and transition of\ntechnologies that will increase the warfighting capabilities and effectiveness of current and future Marine Corps maneuver systems. This Thrust aims at capturing emerging and \"leap ahead\" technologies in the areas of mobility, materials, propulsion, survivability, durability, signature reduction, modularity, and unmanned systems.  The emphasis is on enhancing capabilities for manned and unmanned ground platforms in support of Marine Corps expeditionary warfare objectives including: Expeditionary Force-21, Operational Maneuver from the Sea, Ship to Objective Maneuver,  SeaBasing, and sustained operations ashore.\n\nThe FY 2015 to FY 2016 increase in the Maneuver Thrust Activity is due to increased cost associated with development of a vehicle demonstrator that focuses on enhanced crew survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.398"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued advanced electromagnetic armor technology development efforts.\n- Continued development of fuel efficiency and battlefield power systems for improved performance.\n- Continued survivability improvements and technologies to mitigate acceleration and traumatic brain injuries to occupants to enhance tactical mobility and survivability.\n- Continued advanced suspension systems development with ride height adjustment, ride quality adjustment, rollover prevention, and load equalizing systems for USMC tactical wheeled platforms to enhance tactical mobility in support of Distributed Operations.\n- Continued a survivability\/active protection systems improvement effort to increase effectiveness of defeat (Pdefeat) of shoulder launched RPG type threats and ATGM threats on light platforms utilizing non-kinetic kill technologies.\n- Continued efforts evaluating the current ground fleet platforms for their mobility and control capabilities as they relate to inclusion of an autonomous vehicle capability that will provide support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Continued efforts to demonstrate integrated armor solutions that provide lighter weight armor materials with enhanced protection to vehicle occupants thereby enhancing tactical mobility and survivability. \n- Continued programs to address and enhance maneuver capability gaps in mobility such as efforts, transitioned from 6.2, aimed at the development of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Continued the development of autonomy technologies and system concepts that will enable unmanned ground vehicles (UGVs) to be used as autonomous logistic connector vehicles.\n- Continued the development of fuel saving vehicle technologies, including advanced transmission, power train, and electrical power system technologies.\n- Continued mobility technologies that enable improved vehicle\/warfighter agility and stability.\n- Continued lightweight armor, material, and structural technologies that enable maneuver and survivability of small, light expeditionary platforms.\n- Continued survivability technologies that enable defeat of all unitary and tandem RPG and select ATGM threats, and the demonstration of survivable vehicles.\n- Continued the development of technologies that enable vehicle component modularity and reduce life cycle costs.\n- Continued development of a Combat S&T Vehicle demonstrator to enhance crew survivability and vehicle fuel efficiency. \n- Continued new mobility efforts for On-Board Vehicle Power to increase mobile exportable power for Diesel Electric Propulsion Concepts and a Fuels effort to investigate future fuel alternatives for internal combustion engines to include Fischer-Tropsch and coal gasification processes for use in military tactical wheeled vehicles. \n- Continued Maneuver Enabling Technologies such as Vehicle Stabilization to improve vehicle suspension and control technologies to stabilize the platforms themselves to improve ride quality, shoot on the move capability and human systems integration. \n- Continued studies to identify technology development plans to close identified force protection capability gaps. \n- Continued a Vehicle Demonstrator program to design and fabricate an Integrated Power Demonstrator platform capable of producing the power needs for mobility and survivability concept demonstrations. \n- Initiated development of a vehicle demonstrator that focuses on enhanced crew survivability. \n- Initiated the development of autonomous perception technologies to enable operations under adverse atmospheric conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.886"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.576"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.576"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this PE is the development of technologies to meet unique Marine Corps needs in conducting Expeditionary Maneuver Warfare.  The program consists of a collection of projects categorized by critical warfighting function.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2297"
                    },
                    "ProjectTitle": {
                        "val": "Futures Directorate"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "41.589"
                        },
                        "CurrentYear": {
                            "val": "42.672"
                        },
                        "BudgetYearOne": {
                            "val": "47.061"
                        },
                        "BudgetYearOneBase": {
                            "val": "47.061"
                        },
                        "BudgetYearTwo": {
                            "val": "47.743"
                        },
                        "BudgetYearThree": {
                            "val": "47.443"
                        },
                        "BudgetYearFour": {
                            "val": "48.392"
                        },
                        "BudgetYearFive": {
                            "val": "48.392"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "As a subordinate organization under the Deputy Commandant, Combat Development and Integration (DC, CD&I), the mission of the Futures Directorate (FD) is to identify plausible future security environments and develop and explore warfighting concepts and Concepts of Operations (CONOPS).  It does this in order to identify potential future capability gaps and opportunities in order to inform future force development.  DC, CD&I is designated as the United States Marine Corps (USMC) Advocate for Science and Technology (S&T).  As Director FD, the Commanding General (CG) of the Marine Corps Warfighting Laboratory (MCWL) is the DC, CD&I designated Proponent of USMC S&T and serves as the USMC Executive Agent for Marine Corps S&T.  The FD also serves as the Marine Corps' liaison to the Joint Staff for Joint Concept Development and Experimentation; thereby facilitating service-specific experiments as well as participation in joint service experimentation.  \n\nThe current Futures Directorate Campaign Plan (FDCP) addresses how the Naval Services must reshape their capabilities in order to meet the concepts and CONOPS called for in the Secretary of the Navy's \"Cooperative Strategy 21\" and the Marine Corps' capstone \"Expeditionary Force 21 (EF21)\" concept.  Execution of the FDCP results in recommendations to Marine Corps advocates and proponents so that they may more cohesively and logically structure the future Navy and Marine Corps team.  In support of the Marine Corps' role to provide an ever-ready quick strike force to protect US interests, FDCP pursues concepts and new capabilities focused on the Marine Air-Ground Task Force (MAGTF).  The MAGTF is the Marine Corps' doctrinal, task organized, force deployment package.  It consists of four elements:  the Command Element that provides overarching command and control (C2) of the entire force; the Ground Combat Element normally built around a core infantry unit with supporting armor, artillery, and other ground units; the Aviation Combat Element which provides aircraft, air defense, and other aviation functions; and the Logistics Combat Element which consists of combat service support (CSS) elements including medical, supply, and transportation.  FDCP also examines future enhancements in training, organization, and equipment.  FD accomplishes its mission through five subordinate Divisions:  \n\nFutures Assessment Division's (FAD's) mission is to:  research, examine, and describe plausible future security environments 15 to 30 years into the future.  Knowledge of these future security environments will provide an estimate of possible future threats, challenges, and opportunities, to include:  the rise of possible partners and adversaries, emerging disruptive technologies, and likely sources of conflict.  This work is largely accomplished through research, seminar participation, and coordination with various experts in academia, the intelligence community, and think tanks. \n\nEmergent Force Development's (EFD's) mission is to:  explore select future security environments, emerging warfighting opportunities and challenges in order to guide development of Marine Corps Service concepts and CONOPS.  EFD is responsible for the production of formally published concepts, CONOPS, and options for future force organization and posture that describe how the Marine Corps will operate and fight.\n\nThree Divisions fall under CG, MCWL to conduct concept-based experimentation.  MCWL's mission is to:  explore and analyze Marine Corps service concepts using an integrated combination of research; modeling and simulation (M&S); wargaming; live force experimentation; S&T discovery, assessment, and integration; and analysis in order to better understand how these concepts expose gaps and create opportunities for future force development. \n\nWargaming Division conducts formal wargames to frame emerging warfighting concepts, establish the Joint context for the Marine Corps Force Development System, and establish priorities for development of experimental and non-experimental capabilities. \n\nExperiment Division conducts live force concept-based experimentation to facilitate exploration of prototype and surrogate technologies, as well as Tactics, Techniques, and Procedures (TTPs), in order to better refine equipment requirements and to identify Doctrine, Organization, Training, Materiel, Leadership, Personnel, and Facilities (DOTMLPF) initiatives needed to produce future capabilities.  \n\nScience and Technology Division conducts investigations and assessments to identify, modify where appropriate, and evaluate technological capabilities that support advanced warfighting concepts, and to explore the military utility of promising new commercial or government technologies in support of urgent and compelling needs.  MCWL investigates the relevance to EF21 capabilities and gaps of advanced technologies according to the following EF21 derived Thrust Areas:  Command, Control, Communications, and Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR); Autonomy and Robotics; MAGTF Fires; Maneuver; Expeditionary Logistics (to include Expeditionary Energy); Expeditionary Medicine; Cyber and Electronic Warfare (EW); and Force Protection. \n\nFD\/MCWL investments encompass inquiries into multiple warfighting areas, including:  CSS and Force Protection; MAGTF C4; MAGTF ISR; Fires, Targeting, and Maneuver; and Warfighting Excellence."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMBAT SERVICE SUPPORT (CSS) AND FORCE PROTECTION"
                                    },
                                    "Description": {
                                        "val": "This activity includes FD\/MCWL CSS and force protection experimentation efforts including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced capabilities. Although this category covers several small (less than $500K per FY) efforts being pursued by FD\/MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact.  Investments in this activity may be conducted under the Thrust Areas of Expeditionary Logistics, Expeditionary Medicine, Force Protection, or Autonomy and Robotics. \n\nThe FY 2016 to FY 2017 increase in category funding is attributable to a shift in radar technology use (due to lack of technological advances as well as availability), while investigating systems that can identify, neutralize, or destroy unmanned systems.  This realization led to increased costs due to exploring additional\/alternative radar capabilities.  In addition, efforts related to automating ship to shore surface connectors as well as placing an increased emphasis on providing enhanced medical care over a distributed battlefield (afloat as well as ashore) caused funding to increase.  These efforts are being pursued to provide additional MAGTF support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.262"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to develop and experiment with bio-sciences (medical) technologies. \n- Continued assessment of unmanned ground logistics delivery technologies that support infantry small unit operations. \n- Continued a MCWL-Defense Advanced Research Projects Agency (DARPA) partnership for the development and demonstration of a MCWL centric legged robot in an effort to \"Lighten the Load\" of individual Marines. \n- Continued research and assessment of technologies that reduce the demand required to support the MAGTF. \n- Continued testing and assessment of logistics enablers in support of EF21 experimentation.\n- Initiated assessment and experimentation with technologies that provide enhanced medical care over a distributed battlefield, to include \"virtual\" care and the use of autonomous systems in support of medical evacuation over ground, surface (water), or air. \n- Initiated evaluation and assessment of emerging technologies that support energy demand reduction. \n- Initiated investigation and assessment of logistics related emerging autonomous air delivery technologies and capabilities that further enhance current Programs of Record (PORs) and influence future planning and decision making. \n- Initiated evaluation and experimentation with technologies that can identify, neutralize, or destroy unmanned systems (aerial, ground, or surface)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.788"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015 less those noted as completed above. \n- Complete a MCWL-DARPA partnership for the development and demonstration of a MCWL centric legged robot in an effort to \"Lighten the Load\" of individual Marines. \n- Initiate research and assessment of advanced manufacturing techniques to determine military utility in expeditionary environments. \n- Initiate assessment and experimentation to understand the relevance of autonomy to ship to shore surface connectors. \n- Initiate assessments and experimentation with advanced technologies to enable standoff detection of improvised explosive devices (IEDs)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.785"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.785"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as complete above. \n- Complete development and experimentation with bio-sciences (medical) technologies. \n- Complete research and assessment of technologies that reduce the demand required to support the MAGTF. \n- Initiate development and assessment of enhanced seabased medical capabilities in support of the MAGTF."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIRES, TARGETING, AND MANEUVER"
                                    },
                                    "Description": {
                                        "val": "This activity includes FD\/MCWL experimentation efforts in the areas of fires, targeting, and maneuver including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced capabilities.  Although this category covers several small (less than $500K per FY) efforts being pursued by FD\/MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact.  Investments in this activity will be conducted under the Thrust Areas of MAGTF Fires, Maneuver, and Autonomy and Robotics.\n\nThe FY 2015 to FY 2016 decrease in category funding is attributable to reducing investments in the weaponization portion of exploring both airborne and ground weaponized autonomous systems.\n\nThe FY 2016 to FY 2017 increase in category funding is mainly due to increased levels of investment into autonomous swarming technologies to capitalize on identified academia opportunities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.403"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development and assessment of weaponized unmanned ground robotic systems. \n- Continued development of technologies that enhance the utility of autonomous systems. \n- Continued test and assessment of future ship to shore connectors that support EF21.\n- Continued research, development, and experimentation with weapons and other ground combat systems that enhance the combat effectiveness of small units operating in the urban littorals.   \n- Initiated investigation of innovative technologies to enhance squad-level capabilities. \n- Initiated evaluation and assessment of both airborne and ground weaponized autonomous\/semi-autonomous \"man-in-the-loop\" systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.016"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015 less those noted as completed above.\n- Complete test and assessment of future ship to shore connectors that support EF21. \n- Initiate assessment and experimentation into the utility of robotic systems as platforms to support target acquisition and designation. \n- Initiate assessment of the expeditionary utility of autonomous swarming technologies for unmanned air and ground systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.071"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.071"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as complete above.\n- Complete evaluation and assessment of both airborne and ground weaponized autonomous\/semi-autonomous \"man-in-the-loop\" systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MARINE AIR-GROUND TASK FORCE (MAGTF) COMMAND, CONTROL, COMMUNICATIONS, AND COMPUTERS (C4)"
                                    },
                                    "Description": {
                                        "val": "With this submission, the name of the category changed to now include MAGTF in the title.  This change is made to provide clarification between separate C4 efforts discussed in another project within this PE.  \n\nThis activity encompasses all FD\/MCWL C4 related experimentation efforts including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced C4 capabilities. Although this category covers several small (less than $500K per FY) efforts being pursued by FD\/MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact.  Investments in this activity will be conducted under the Thrust Areas of C4ISR and Cyber\/EW.\n\nThe FY 2015 to FY 2016 increase in category funding is attributable to focusing on EF21, with development and testing of a configurable C2 suite that enhances operations from aviation platforms and evaluation and experimentation with emerging technologies that support future maritime C2 capabilities.  \n\nThe FY 2016 to FY 2017 decrease in category funding is mainly due to a culmination of experimentation with modified commercial-off-the-shelf (COTS) waveforms; thereby allowing a shift into using existing POR-based waveforms to conduct further experimentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.190"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development and assessment of a MAGTF network management system. \n- Continued development and assessment of a configurable C2 suite that enables operations from alternate seabased platforms in support of EF21 experimentation. \n- Continued development and assessment of a configurable C2 suite that enhances operations from L-Class shipping in support of EF21 experimentation. \n- Continued a follow-on effort to test and evaluation of an integrated C2 application in support of EF21 experimentation.\n- Initiated development and assessment of systems that permit unmanned aerial system (UAS) operations in a global positioning system (GPS) denied environment. \n- Initiated development and assessment of a configurable C2 suite that enhances operations from aviation platforms in support of EF21 experimentation. \n- Initiated investigations and assessment of technologies that support C2 enablers for shore deployed MAGTF elements that is platform agnostic and capable of deployment from the sea, air, or ground. \n- Initiated evaluation and experimentation with emerging technologies that support future maritime C2 capabilities\/EF21. \n- Initiated development and assessment of technologies that support a maritime Fly-In Command Element (FICE) capable of operating from the sea-base during the conduct of immediate crisis response operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.592"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015 less those noted as completed above.\n- Complete development and assessment of a configurable C2 suite that enables operations from alternate seabased platforms in support of EF21 experimentation. \n- Complete development and assessment of a configurable C2 suite that enhances operations from L-Class shipping in support of EF21 experimentation. \n- Complete development and assessment of technologies that support a maritime FICE capable of operating from the sea-base during the conduct of immediate crisis response operations. \n- Initiate assessment and experimentation with integration and interoperability of software applications to increase the situational awareness, lethality, and survivability of distributed tactical ground formations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.770"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.770"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as complete above.\n- Complete development and assessment of a MAGTF network management system. \n- Initiate exploration, development, and experimentation of cyber\/EW capabilities at the tactical level, to enable tactical operators to sense, visualize, and exploit the cyber\/EW environment.\n- Initiate development and experimentation that enable seamless operations in a technology denied environment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MARINE AIR-GROUND TASK FORCE (MAGTF)  INTELLIGENCE, SURVEILLANCE, AND RECONNAISSANCE (ISR)"
                                    },
                                    "Description": {
                                        "val": "With this submission, the name of the category changed to now include MAGTF in the title.  This change is made to provide clarification between separate ISR efforts discussed in another project within this PE.\n\nThis activity includes FD\/MCWL ISR related experimentation efforts including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced ISR capabilities.  Although this category covers several small (less than $500K per FY) efforts being pursued by FD\/MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact.  Investments in this activity will be conducted under the Thrust Areas of C4ISR and Autonomy and Robotics.\n\nThe FY 2015 to FY 2016 decrease in category funding is attributable to reassessment of seabased and landing force ISR capability investments as well as adjusting investments in enhancing UAS sensor packages.\n\nThe FY 2016 to FY 2017 increase in category funding is mainly due to reassessing, refocusing, and enhancing seabased and landing force ISR capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.297"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development and assessment of seabased and landing force ISR capabilities that enable EF21 experimentation. \n- Continued development, integration, and assessment of technologies to fuse multiple sensor payloads into a single user interface to enable utility for tactical operators.\n- Initiated development and assessment of enhanced UAS sensor packages. \n- Initiated examination and assessment of technologies that support future employment of UAS operations from seabased platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.575"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as complete above.\n- Complete development and assessment of enhanced UAS sensor packages."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FUTURES DIRECTORATE (FD) \/ MARINE CORPS WARFIGHTING LABORATORY (MCWL) OPERATIONS (SUPPORT)"
                                    },
                                    "Description": {
                                        "val": "FD\/MCWL Operations (Support) efforts include overall FD\/MCWL experimentation doctrine, planning, analysis, data collection, as well as technology transition tracking efforts.  Although this category covers several small (less than $500K per FY) efforts being pursued by FD\/MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.748"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to synthesize results and lessons learned into proposed DOTMLPF recommendations for the Marine Corps. \n- Continued to provide technical, strategic, and managerial support to Marine Corps experimentation. \n- Continued to provide overall analysis and reporting of experimentation efforts, analytical assistance during experiment design, and maintenance of an ad-hoc analysis capability.\n- Initiated deliberate broad-based commercial technology forecasting in support of experimentation long-range planning and combat development. \n- Initiated technical, strategic, and managerial support for operations with advanced technology utilizing autonomy, robotics, and cyber capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.811"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.682"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.682"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WARFIGHTING EXCELLENCE"
                                    },
                                    "Description": {
                                        "val": "This activity includes FD\/MCWL efforts in the development and assessment of joint and service warfighting concepts, joint and service missions, analysis of emerging threats and opportunities, and joint capability experimentation.  It also includes FD\/MCWL service experimentation in areas that impact multiple warfighting functions.  Although this category covers several small (less than $500K per FY) efforts being pursued by FD\/MCWL, most programs listed below are considered major (valued at $500K or more) or have near-real-time operational impact.\n\nThe FY 2015 to FY 2016 increase in category funding is mainly due to increased focus on M&S-based hardware, software, and training capabilities that support planning\/experimentation processes, as well as investments to improve Wargaming abilities.\n\nThe FY 2016 to FY 2017 decrease in category funding is attributable to reduced levels of investment in broad-based technical and analytical support at the component, Service, and Joint levels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.689"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued executive agent responsibilities for the Marine Corps Title Ten (X) Wargame, Expeditionary Warrior, as well as the Joint and other service Title X programs, such as the United States Army's Unified Quest, the Air Force's Unified Engagement and Futures wargame, and the Navy Global wargame.  Title X war games address future capabilities in the context of Title X readiness responsibilities. \n- Continued management and oversight of non-Title X Wargaming, including the highly visible Office of the Secretary of Defense Net Assessment Transformation War Game series and the Special Operations Command wargaming series. \n- Continued to support the core Center for Emerging Threats and Opportunities (CETO) mission to:  provide broad-based technical and analytical support for Marine Corps combat development and experimentation programs at the component, Service, and Joint levels.  This support includes the full spectrum of combat development-related missions and tasks to include the assessment of plausible future security environments and the identification of future threats, adversaries, opportunities, technologies, strategic settings, and associated geographic, environmental, economic, and demographic conditions in order to inform the development of innovative warfighting concepts, CONOPS, and capabilities across the DOTMLPF spectrum.  Serve as a catalyst to stimulate thought and debate on issues of importance to the Marine Corps. \n- Continued funding contributions to Joint Concept Technology Demonstrations (JCTDs) and Emerging Capability Technology Demonstrations (ECTDs) (formerly known as Advanced Concept Technology Demonstrations (ACTDs)).  Both JCTDs and ECTDs are intended to rapidly field needed capabilities by using emergent mature technologies matched with innovative operational concepts.\n- Initiated development and assessment of modeling and simulation hardware, software, and training capabilities that support planning\/experimentation processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.890"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.705"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.705"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this PE is the development, demonstration, and assessment of technologies that represent capabilities to meet unique Marine Corps needs in conducting Expeditionary Maneuver Warfare in the future.  The program consists of a collection of projects categorized by critical warfighting function.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                }
            ]
        }
    }
}