{
    "id": "fb250579ab8b924014579e86f8cfe4885a0ec0f6",
    "meta": {
        "filename": "dod-2017_RDTE_2017_DISA_U_RDTE_MasterJustificationBook_Defense_Information_Systems_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Defense_Information_Systems_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0302019K"
        },
        "ProgramElementTitle": {
            "val": "Defense Info. Infrastructure Engineering and Integration"
        },
        "R1LineNumber": {
            "val": "197"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "104.746"
            },
            "PriorYear": {
                "val": "12.680"
            },
            "CurrentYear": {
                "val": "10.120"
            },
            "BudgetYearOne": {
                "val": "18.041"
            },
            "BudgetYearOneBase": {
                "val": "18.041"
            },
            "BudgetYearTwo": {
                "val": "23.499"
            },
            "BudgetYearThree": {
                "val": "23.130"
            },
            "BudgetYearFour": {
                "val": "22.447"
            },
            "BudgetYearFive": {
                "val": "22.893"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Information Infrastructure Engineering and Integration effort encompasses two projects: Modeling and Simulation and DoD Information Network (DODIN) Systems Engineering and Support. There are two major activities under the Modeling and Simulation project: Modeling and Simulation and DODIN Enterprise Wide Systems Engineering (EWSE).\n\nThe DODIN EWSE activity resolves near term (one to three years) high-priority technical issues defined by DoD Chief Information Officer (DoD CIO) and Defense Information Systems Agency (DISA), that impact operational capabilities affecting DODIN End-to-End (E2E) interoperability and performance. \n\nThe Modeling and Simulation project provides architecture, systems engineering and E2E analytical functions for DISA and its customers, ensuring integrated capabilities to fulfill warfighter mission requirements. Ongoing beneficiaries of these capabilities include DoD CIO, the DISA Network Services Directorate, the DISA Enterprise Services Directorate, Program Executive Office-Mission Assurance, the Defense Information Systems Network Command Center and Joint Communications Simulation System users in DoD.\n\nThe DoDIN Systems Engineering and Support project performs discovery, research, development and experimentation of emerging and commercial technologies through the Office of the Chief Technology Officer (OCTO) to fill capability shortfalls and technology gaps across the Future Years Defense Program (FYDP).   The OCTO identifies these gaps\/shortfalls, pursues leading innovative solutions from industry, academia, and the Federal sector, and engages industry partners for commercial best practices.  The OCTO develops technology forecasts and innovation roadmaps for existing and nascent DISA programs (Cloud Computing, Unified Capabilities, Cyber Security, End User Device\/Mobility, and Process\/Automation).  The OCTO conducts technical system engineering reviews and oversight of DISA and DoD enterprise products and services.  The OCTO performs early identification of technology needs and explores, develops, and delivers recommended emerging technologies to the DISA Requirements & Analysis Office."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.612"
                },
                "CurrentYear": {
                    "val": "10.186"
                },
                "BudgetYearOne": {
                    "val": "9.720"
                },
                "BudgetYearOneBase": {
                    "val": "9.720"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.680"
                },
                "CurrentYear": {
                    "val": "10.120"
                },
                "BudgetYearOne": {
                    "val": "18.041"
                },
                "BudgetYearOneBase": {
                    "val": "18.041"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.068"
                },
                "CurrentYear": {
                    "val": "-0.066"
                },
                "BudgetYearOne": {
                    "val": "8.321"
                },
                "BudgetYearOneBase": {
                    "val": "8.321"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "3.068"
                                },
                                "CurrentYear": {
                                    "val": "-0.066"
                                },
                                "BudgetYearOne": {
                                    "val": "8.321"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.321"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase of +$3.068 in FY 2015 is due to increased engineering activities to support information assurance and cyber security engineering solutions.  These increased activities leverage mobility and cloud technology needs in support of the warfighter.\n\nThe decrease of -$0.066 in FY 2016 is attributable to a reduction in collaboration with industry subject matter experts.\n\nThe increase of +$8.321 in FY 2017 properly realigns civilian payroll, 62 FTEs and nonpay funding from PE0604764K for the Chief Technology Office (CTO) to promote centralized and coordinated technology policy, direction, standards, and leadership in order to influence technology innovation that meets future DoD requirements. Additionally, funding will perform discovery, research, development and experimentation of emerging and commercial technology to support development and adoption of key technology solutions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "E65"
                    },
                    "ProjectTitle": {
                        "val": "Modeling and Simulation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "70.317"
                        },
                        "PriorYear": {
                            "val": "8.458"
                        },
                        "CurrentYear": {
                            "val": "6.079"
                        },
                        "BudgetYearOne": {
                            "val": "7.709"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.709"
                        },
                        "BudgetYearTwo": {
                            "val": "10.555"
                        },
                        "BudgetYearThree": {
                            "val": "10.408"
                        },
                        "BudgetYearFour": {
                            "val": "10.132"
                        },
                        "BudgetYearFive": {
                            "val": "10.333"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Modeling and Simulation project provides architecture, systems engineering and end-to-end (E2E) analytical functions for the Defense Information Systems Agency (DISA) and its customers, ensuring integrated capabilities to fulfill warfighter mission requirements. Modeling and Simulation activities support the Department of Defense (DoD) communications planning and investment strategy, including: application performance assessments, contingency planning, network capacity planning and diagnostics, and systems-level modeling and simulation. Project efforts provide across-theater information awareness for Combatant Commands through application solutions for integrated networks, including DoD’s missions in Afghanistan and the Defense Information Systems Network (DISN) by: (1) supporting the development and implementation of DoD Information Network (DODIN) Enterprise Wide Systems Engineering (EWSE) processes essential to evolving the DODIN in a manner that enables interoperability and E2E performance for critical DODIN programs; (2) developing standardized DISA systems analyses and integration processes to improve systems integration across DISA for all DISA developed communication systems and services; and (3) providing the underlying modeling and simulation and analytical support for E2E DISA and DoD systems engineering and assessment. \n\nProject efforts provide DoD decision makers with services and a suite of tools capable of identifying key points of impact on DoD command and control information systems and recommending trade-offs within the DODIN configuration with regard to prioritized performance, availability, and security. This effort will reduce the risk in products deployed to the warfighter through improved network performance and traffic analysis, and an efficient means of troubleshooting and subsequent redesign."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.458"
                                            },
                                            "Text": {
                                                "val": "Continued EWSE efforts to resolve high-priority technical issues impacting E2E capabilities of DODIN transport, computing services, applications, information assurance (IA), network operations (NetOps) and enterprise services. Analyzed Platform as a Service (PaaS), Infrastructure as a Service (IaaS), Software as a Service (SaaS), Cloud Access Point (CAP), encrypted storage and other cloud computing services to be integrated or interoperated with DoD capabilities. Performed technical assessments for open source alternatives for enterprise email, knowledge management and office automation solutions.  Developed  enterprise architecture and SysML modeling artifacts for JIE, Defense Enterprise Email 2.0, cyber security architecture and other enterprise services. Examined application of commercial wireless technologies in DODIN to include tactical environments.  The results of analysis and examination were socialized with the DoD community for action and adoption.  Where appropriate, the results were documented in GIG Technical Profiles (GTP) for compliance by the Programs of Record (POR).\n\nContinued efforts to enhance modeling capabilities that provide DISN IP and Transport Capacity Planning models, modifying tools and processes to reflect the operational DISN architecture and technologies as evolved under Joint Information Environment (JIE) initiatives and technical advances.  These enhancements included: (1) preparing for the FY 2017 Technology Refresh (feasibility analyses required prior to hardware being added to the DODIN) and new user requirements; (2) enhanced modeling and instrumentation techniques for new or evolving enterprise Services and customer needs in DISA program\/project decisions and planning (e.g. JIE, Joint Regional Security Stack, (JRSS), and Defense Enterprise Computing Centers); (3) DoD Internet traffic models and analyses for capacity planning and IA initiatives for the CYBERCOM and organizations within DISA (4) enhanced modeling tools and techniques to provide inputs to network planning and performance assessments in support of Unified Communications and E2E security goals of the evolving DISN; (5) capacity planning and modeling for data center infrastructure computing and network; and (6) an updated version of the Joint Communications Simulation System (JCSS)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.079"
                                            },
                                            "Text": {
                                                "val": "Will continue EWSE efforts to resolve high-priority technical issues impacting interoperability of DODIN capabilities in communications, computing services, applications\/services, information assurance (IA) and net-centric operations (NetOps). Will analyze\/prototype cloud computing services that can be integrated or interoperated with DoD capabilities. Will identify capability candidates for analysis; perform technical market research, alternatives analysis and trade-off studies of candidates within a defined trade space; analyze and evaluate existing\/new capabilities through engineering methods to include proof-of-concept demonstrations; and perform technical assessments to develop technical recommendations supporting solution development decisions.  Will analyze\/prototype cloud computing services and open source capabilities for integration and interoperability with DoD capabilities. Will continue to examine application of SDN technologies for Core Data Centers and DISN. Will continue to perform technical assessments for open source alternatives for new technology solutions.  Will develop enterprise architecture and SysML modeling artifacts for high priority DISA enterprise services. Will enhance proactive end-to-end performance capabilities, including data collection and tools to support enterprise wide troubleshooting and analysis. The results will be socialized with the DoD community for action\/adoption or further development. Where appropriate, the results will also be documented in GTP for compliance by the POR.\n\nWill continue efforts to enhance modeling capabilities that will provide DISN IP and Transport Capacity Planning models, modifying tools and processes to reflect the operational DISN architecture and technologies as evolved under Joint Information Environment (JIE) initiatives and technical advances. These enhancements include: (1) preparing for the FY 2018 Technology Refresh (feasibility analyses required prior to hardware being added to the DODIN) and new user requirements; (2) enhanced modeling and instrumentation techniques for new or evolving enterprise Services and customer needs in DISA program\/project decisions and planning; (3) DoD Internet traffic models and analyses for capacity planning and IA initiatives for CYBERCOM and additional organizations within DISA; (4) enhanced modeling tools and techniques to provide inputs to network planning and performance assessments in support of Unified Communications and E2E security goals of the evolving DISN; and (5) an updated version of the Joint Communications Simulation System.\n\nThe decrease of -$2.379 between FY 2015 and FY 2016 is attributable to reduction in research efforts for EWSE; specifically the Service Level Interoperability for Tactical Edge and Core (SLITEC) area."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.709"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.709"
                                            },
                                            "Text": {
                                                "val": "Will evolve EWSE and standards efforts to operationalize the E2E performance efforts and distill the standards efforts to support DISA Strategic Initiatives and to resolve high-priority technical issues impacting interoperability of DoDIN capabilities in communications, computing services, enterprise applications\/services, information assurance (IA) and net-centric operations (NetOps).  Will identify capability candidates for analysis; perform technical market research, alternatives analysis and trade-off studies of candidates within a defined  trade space; analyze and evaluate existing\/new capabilities through engineering methods to include proof-of-concept demonstrations; and perform technical assessments to develop technical recommendations supporting solution development decisions.  Will analyze\/prototype cloud computing services and open source capabilities for integration and interoperability with DoD capabilities. Will support application and implementation of SDN technologies for Core Data Centers and the DISN. Will continue to enhance end-to-end performance capabilities, including data collection and tools to support enterprise wide troubleshooting and analysis. The results will be socialized with the DoD community for action\/adoption or further development. Where appropriate, the results will also be documented in GTP for compliance by the POR.\n\nWill continue efforts to enhance modeling capabilities that will provide DISN IP and Transport Capacity Planning models and expand computing infrastructure modeling capabilities, modifying tools and processes to reflect the operational DODIN architecture and technologies as evolved under Joint Regional Security Stacks (JRSS) and the common informational architecture initiatives and technical advances. These enhancements include: (1) preparing for the FY 2019 Technology Refresh (feasibility analyses required prior to hardware being added to the DODIN) and new user requirements; (2) enhanced modeling and instrumentation techniques for new or evolving enterprise services and customer needs in DISA program\/project decisions and planning; (3) DoD Internet traffic models and analyses for capacity planning and IA initiatives for CYBERCOM and organizations within DISA; (4) enhanced modeling tools and techniques to provide inputs to network planning and performance assessments in support of Unified Communications and End-to-End (E2E) security goals of the evolving DODIN; (5) capacity planning for data centers infrastructure computing and network;  and (6) an updated version of the Joint Communications Simulation System.\n\nThe increase of +$1.630 between FY 2016 and  FY 2017 is due to broadened and enhanced modeling and simulation methodologies to properly identify the network planning and bandwidth sufficiency needs of the evolving DODIN."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0302019K"
                                    },
                                    "Title": {
                                        "val": "Operation & Maintenance, Defense-Wide"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.731"
                                        },
                                        "CurrentYear": {
                                            "val": "15.496"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.989"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.989"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.606"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.437"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.579"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.911"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "EWSE uses contractors to assist\/supplement the Government lead\/team for technical activities. Subject matter experts in both large and small businesses are sought for the engineering support. Firm fixed price contracts with one option year are typically used in open competition. Furthermore, technical work with Federally Funded Research and Development Centers (FFRDCs) such as MITRE and MIT Lincoln Lab are established and coordinated when the Government can leverage their expertise and R&D in the key technology.  \n\nModeling and Simulation uses a range of contractors for modeling support to the various projects. Contractors range from small to large business, predominantly using open competition methods and Firm Fixed Price (FFP) tasks and utilizing multi-year (base plus option years) contracts where possible. Support includes network modeling tool and processes development to adapt to ever-evolving OSD\/DISA programs and projects, analyses, capacity planning, and network redesign using the models. Some specific support (e.g., integration with proprietary software) will require contracting with OPNET (e.g., sole source). FFRDCs are also considered depending upon the task."
                        },
                        "PerformanceMetrics": {
                            "val": "DISN core transport bandwidth sufficiency, tied to capacity planning and activation of bandwidth in the DISN optical core to keep at least 25% spare capacity, to allow for provisioning of unforeseen requirements and rerouting under outages.\n\nDISN IP Core bandwidth sufficiency tied to capacity planning and activation of IP bandwidth to maintain average bandwidth utilization of DISN IP Core and NIPRNet backbone circuits under 65% during daily peak periods.\n\nDISN SIPRNet bandwidth sufficiency tied to capacity planning and activation of IP bandwidth to maintain average bandwidth utilization of SIPRNet backbone circuits under 50% during daily peak periods.\n\nThe EWSE projects will be measured by the number of technical studies performed with associated systems engineering artifacts (market research reports, technology assessments, solutions analyses, etc.) that are developed to support DODIN capabilities; and the number of proof-of-concept demonstrations or pilots executed to support viability of the technical approach\/recommendation. These products will be coordinated with the stakeholders, users and\/or Program Management Offices (PMO) to ensure EWSE provides the right deliverables for solution development decisions.  \n\nFY15 actual target (met):  2 technical studies, 7 engineering artifacts, and 2 concept demonstrations.  \nFY16 planned target: 2 technical studies, 6 engineering artifacts, and 2 concept demonstrations.  \nFY17 planned target: 2 technical studies, 6 engineering artifacts, and 2 concept demonstrations.\n\nThe Modeling and Simulation project provides architecture, systems engineering and E2E analytical functions for DISA and its customers, ensuring integrated capabilities to fulfill warfighter mission requirements. Ongoing beneficiaries of these capabilities include DoD Enterprise Activities, the DODIN and DISA applications, as well as engineering capabilities support to programs and projects to address technical and engineering solutions to activities such as information assurance and cyber security; mobility and cloud technologies and warfighter and mission support activities."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development 1"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OPNET Tech, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bethesda, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.108"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.296"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.467"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.467"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APPTIS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chantilly, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.689"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.133"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 3"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Noblis"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Falls Church, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.312"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.312"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 4"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen, Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.210"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.569"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.658"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.658"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 5"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NRL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.100"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.100"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 6"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Soliel, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.852"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.010"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.025"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 7"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Estrela Tech, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Vienna, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.479"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.326"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 8"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "COMPTEL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.926"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.335"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.261"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 9"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT Lincoln Labs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cambridge, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.040"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.599"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.205"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 10"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.011"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.458"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.384"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.532"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.532"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise Wide Systems Engineering 11"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fairfax, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.784"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.784"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Clear Sky Pilot"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFRL Terremark"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "18.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "18.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Narus"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFRL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.450"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.450"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cyber Accelerator"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DTIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.516"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.516"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Commercial Integration Demonstration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DTIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.750"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.750"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Web Content Filtering:  Perimeter Defense Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oberon Associates"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.854"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.854"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Host Based Security Ops Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Summit Technologies, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.700"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.700"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Secure Configuration Management Ops Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Cyber Security research and Solutions Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.964"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.964"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 11"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Johns Hopkins University Applied Physics Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Laurel, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.450"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.450"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-04"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Meade"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.502"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.502"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cloud Hosted Shared Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Nisga's Data Systems LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Herndon, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cloud\/ Gateway Pilot"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Alvarez and Associates"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tysons Corner, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.304"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cloud\/ Gateway Pilot"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BY Light Professional IT Services"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.413"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Comptel"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.072"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.072"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Horizontal Engineering"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Horizontal Engineering"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation Applications"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Modeling and Simulation Applications"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T62"
                    },
                    "ProjectTitle": {
                        "val": "DoD Information Network (DoDIN) Systems Engineering and Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "34.429"
                        },
                        "PriorYear": {
                            "val": "4.222"
                        },
                        "CurrentYear": {
                            "val": "4.041"
                        },
                        "BudgetYearOne": {
                            "val": "10.332"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.332"
                        },
                        "BudgetYearTwo": {
                            "val": "12.944"
                        },
                        "BudgetYearThree": {
                            "val": "12.722"
                        },
                        "BudgetYearFour": {
                            "val": "12.315"
                        },
                        "BudgetYearFive": {
                            "val": "12.560"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The DoD Information Network (DODIN) Systems Engineering and Support project aligns with the updated DISA Strategic Plan, which includes the Chief Technology Officer’s Outlook and a Technology Watchlist.  The Watchlist identifies key technology areas that are essential for Defense Information Systems Agency (DISA) including:  Networking, Computing and Storage, Unified Capabilities, Mobility Devices and Applications, Cybersecurity and Network Operations.\n\nThe DODIN Systems Engineering and Support Project ensure the technical strategies for the Defense Information Systems Agency (DISA) are in line with the DoD IT Efficiency strategy and Department of Defense Chief Information Office (DoD CIO) Capabilities Planning Guidance (CPG) for 2017 – 2021 through the Office of the Chief Technology Officer (OCTO).  These strategies will establish the foundation for DISA's technology investments and technical development.  The OCTO leverages technology to drive efficiencies and cost savings to the DoD, the Warfighter, and other Federal Agencies, and provides actionable, decision-oriented information to the Secretary of Defense, Joint Staff, Military Services, Combatant Commands, and other mission partners in satisfying DoD mission objectives.\n                                                            \nCyber security and cloud computing present critical near term challenges, especially the ability to securely leverage commercial cloud service offerings.  The OCTO’s partnership with Defense Advanced Research Projects Agency (DARPA) will assess and transition technologically relevant and mature solutions. Included are applications with a security wrapper that detect and mitigate cyberattacks; smart routing and managed reputation capability; embedded system defense capabilities; and resilient and intrusion-tolerant network capabilities. \n\nPartnerships with industry, academia, and the Federal sectors will produce requisite cyber measures and ensure optimal use of commercial cloud services.  The OCTO will conduct technology assessments, process improvements, as well as the analysis and review of potential technology solutions, products, capabilities and services to ensure consistency with DODIN architecture and standards.  Enabled by the Technology Assessment Framework (TAF) and the DISA Technology Information Repository (DTIR), the OCTO will perform “quick looks” and deeper technology evaluations to provide critical awareness, characterization, and suitability of specific technologies.  These include the assessments of advanced cloud management capabilities; physical containers to enable mobile data center; emerging open source Storage Service APIs and\/or abstractions and global standards for storage services; analytic platform performance baselines of emerging commercial analytic platform products; advanced approaches to Continuity of Operations (COOP) in a hybrid cloud environment; and the next generation software defined networks for automating and virtualizing the DODIN."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Department of Defense Information Network (DODIN) Systems Engineering and Support (formerly Global Information Grid (GIG) Systems Engineering and Support)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.222"
                                            },
                                            "Text": {
                                                "val": "Supported the transition of applications and services to Core Data Centers for Joint Information Environment (JIE) capabilities, concepts and operations.  Cloud computing technologies and service delivery models were developed. These technologies included, cyber threat and exploitation vectors and mitigations, full featured Geo-Location Policy Based Mobile Device Management and secure mobile multi user\/environment technologies, next generation Software Defined Networks, and supporting concept of operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.041"
                                            },
                                            "Text": {
                                                "val": "CTO will develop the Technology Environment (TE), composed of the technical infrastructure, associated processes, practices, and methodologies that are used to evaluate and characterize new technologies.  Within the TE, CTO will continue to perform technical assessments and proof of concepts for key capability portfolios (networking, computing & storage, UC, mobility, cyber security, and network operations).  Also included are future cloud computing technologies and innovative service delivery models, mobile devices, application development and vetting best practices, and next generation virtualized Software Defined Networks for automating and virtualizing the DODIN.  CTO will continue to partner with commercial partners, academia, technical analysis centers, as well as member organizations within the Intelligence Community, to bring state of the art capabilities to DISA for better communications and monitoring tools, enterprise services and improved end-user services and capabilities.  Innovation funds will continue to explore, develop and deliver emerging technologies to the Warfighter.  The funding will allow the Department to leverage technology to drive efficiencies and cost saving to DoD, the Warfighter, and other Government Agencies. Technologies including Cloud Services, future infrastructure architectures, Cyber Security, Software Defined Anything, Big Data, cloud computing, mobile computing, mobile applications, wireless will be piloted, matured and developed.\n\nThe decrease of -$0.181 between FY 2015 and FY 2016 is attributable to a reduction in collaboration with industry subject matter experts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.332"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.332"
                                            },
                                            "Text": {
                                                "val": "Will conduct technology assessments, process improvements, as well as the analysis and review of potential technology solutions, products, capabilities and services to ensure consistency with DODIN architecture and standards.  Enabled by the TAF and the Defense Technical Intelligence Report (DTIR), the OCTO will perform “quick looks” and deeper technology evaluations to provide critical awareness, characterization, and suitability of specific technologies.  These include the assessments of advanced cloud management capabilities, physical containers to enable mobile data center; emerging open source Storage Service APIs and\/or abstractions and global standards for storage services, analytic platform performance baselines of emerging commercial analytic platform products, advanced approaches to COOP in a hybrid cloud environment, and the next generation software defined networks for automating and virtualizing the DODIN.\n\nWill assess and transition technologically relevant and mature solutions, provides smart routing and managed reputation capabilities; Software Symbiotes which provides embedded system defense capabilities; and advanced technologies and protocols that provide resilient and intrustion-tolerant network and messaging capabilities.  \n\nWill produce requisite cyber measures and ensure optimal use of commercial cloud services through Partnerships with industry, academia, and the Federal sectors. \n\nThe increase of +$6.291 from FY 2016 to FY 2017 is primarily attributable to the discovery, research, development and experimentation of emerging and commercial technology needed to support the development and adoption of key technological solutions, the realignment of civilian Full-Time-Equivalents (FTEs) and the associated payroll from PE0604764K to promote centralized, coordinated technology policy, direction, standards, and leadership allowing CTO and DISA the ability to influence and promote technology innovation that meets future DoD requirements.  In addition, CTO will perform assessment and reconnaissance of emerging technologies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "O&M, DW\/PE 0302019K"
                                    },
                                    "Title": {
                                        "val": "Operation & Maintenance, Defense-Wide"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.835"
                                        },
                                        "CurrentYear": {
                                            "val": "0.994"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.607"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.607"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.890"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.925"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.026"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Market research during the acquisition process includes a review of DISA contracts, other DoD contract vehicles, and other Federal Government agency contracts which are advertised for Government-wide usage.  This market research also includes consideration of small businesses including minority\/women owned (8A) businesses, Historically Black Colleges and Universities, mentor\/protégé and other specialized contract vehicles and processes. Market research evaluates all contractors available from DISA sources for their ability to deliver the products specifically required for the unique program efforts.  The program works collaboratively with vendors to obtain generic cost data for planning and analysis purposes.  Past and current contract prices for similar work and other government-wide agency contracts provide additional sources of information.  Quotes from multiple sources help provide averages for more realistic cost estimates.  DISA makes a concerted effort to award many of its contracts to small businesses.  Additionally, many of the DISA contracts are awarded with multiple option periods. These have the benefit of fixing labor costs over an extended period and minimizing the administrative costs associated with re-issuing short-term contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "Number of Technology Assessments\n        \nPerformance Metrics\nPerformance is measured by project milestones and the adoption of these technologies into existing Programs of Record (PORs) or as new program offerings to the DoD and intelligence communities. Metrics that will be used include number and percentage of emerging and mature technologies adopted by DISA and DoD, number and percent of technology research and development initiatives and investments in the DoD, peering organizations and industry partners attributable to technology research. These investments and evolution plans identify, promote, channel and align technology research and investments to reduce time to field emerging technologies to satisfy warfighter requirements. See specific metrics below:\n\nMetric: Performance is measured by the number of technologies assessed and the adoption or influence of the technologies assessed on DoD, DISA or IC programs, projects or services. Technologies are identified by many venues to include research and development initiatives, technology watch-lists from various sources (e.g. in-house, peer organizations, industry and\/or academic advisors) and commercial product releases that have potential applicability to the warfighter mission area. These measures will allow CTO to align technology research and development with capabilities gaps and needs resulting in improved operational effectiveness and efficiencies.\n\nMeasure\/Goal: Number of pilot and technology assessments instantiated within the CTO Technical Environment. Number research initiatives designed, developed and demonstrated and transitioned to programs, projects, or services.\n\nFY15 Actual (Met)l: 8 Assessed and 5 transitioned \nFY16 Target: 8 Assessed and 5 transitioned\nFY17 Target: 8 Assessed and 5 transitioned"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.042"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.485"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.484"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.702"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.702"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Industry Tech Res"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Gartner"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.249"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.249"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.249"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GIG Technical Insertion Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SRA, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fairfax, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.211"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.211"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.211"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.601"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.601"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.601"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DAMA-C"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Micro-electronics Activity"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.794"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.794"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.794"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Thin Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT Lincoln Labs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.250"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.010"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.26"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.26"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Moya Technologies, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.212"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.212"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.212"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.315"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.315"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.315"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Science and Technology Associates, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.151"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charleston, SC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.376"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.376"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.376"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.691"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.691"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.691"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TWM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Falls Church, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.202"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.202"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.202"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SOLERS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.995"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.020"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.020"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.015"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.015"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.351"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.351"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.351"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.415"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.327"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.467"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.579"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.579"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "IV2: IT Consulting Services, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Jackson, WY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.074"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.650"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Information Assurance TWM Follow On"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.440"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.154"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.154"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TIE NEMS: B&D Consulting"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.417"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.417"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tapestry Technologies, INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.212"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.212"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Management Services - Civilian Pay"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.848"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.848"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Technical Direction Agent (TDA)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Technical Direction Agent (TDA)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering Support"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Industry\/University Technical Research"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Industry\/University Technical Research"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technology Assessments"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Technology Assessments"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}