{
    "id": "ff6b2d03a5db06f2ebc83a13b9a9770d1645e626",
    "meta": {
        "filename": "dod-2017_RDTE_2017_DARPA_U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602716E"
        },
        "ProgramElementTitle": {
            "val": "ELECTRONICS TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "169.690"
            },
            "CurrentYear": {
                "val": "174.798"
            },
            "BudgetYearOne": {
                "val": "221.911"
            },
            "BudgetYearOneBase": {
                "val": "221.911"
            },
            "BudgetYearTwo": {
                "val": "234.424"
            },
            "BudgetYearThree": {
                "val": "236.582"
            },
            "BudgetYearFour": {
                "val": "233.270"
            },
            "BudgetYearFive": {
                "val": "245.370"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "169.203"
                },
                "CurrentYear": {
                    "val": "174.798"
                },
                "BudgetYearOne": {
                    "val": "170.783"
                },
                "BudgetYearOneBase": {
                    "val": "170.783"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "169.690"
                },
                "CurrentYear": {
                    "val": "174.798"
                },
                "BudgetYearOne": {
                    "val": "221.911"
                },
                "BudgetYearOneBase": {
                    "val": "221.911"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.487"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "51.128"
                },
                "BudgetYearOneBase": {
                    "val": "51.128"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "5.640"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.153"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "51.128"
                                },
                                "BudgetYearOneBase": {
                                    "val": "51.128"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015:  Increase reflects reprogrammings offset by the SBIR\/STTR transfer. \nFY 2016:  N\/A\nFY 2017:  Increase reflects initiation of new start programs: Limits of Thermal Sensors (LOTS) and Connect.Everything, and expansion of several efforts supporting precision, navigation and timing and electromagnetic spectrum dominance."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "ELT-01"
                    },
                    "ProjectTitle": {
                        "val": "ELECTRONICS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "169.690"
                        },
                        "CurrentYear": {
                            "val": "174.798"
                        },
                        "BudgetYearOne": {
                            "val": "221.911"
                        },
                        "BudgetYearOneBase": {
                            "val": "221.911"
                        },
                        "BudgetYearTwo": {
                            "val": "234.424"
                        },
                        "BudgetYearThree": {
                            "val": "236.582"
                        },
                        "BudgetYearFour": {
                            "val": "233.270"
                        },
                        "BudgetYearFive": {
                            "val": "245.370"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program element is budgeted in the Applied Research budget activity because its objective is to develop electronics that make a wide range of military applications possible.\n\nAdvances in microelectronic device technologies, including digital, analog, photonic and MicroElectroMechanical Systems (MEMS) devices, continue to have significant impact in support of defense technologies for improved weapons effectiveness, improved intelligence capabilities and enhanced information superiority.  The Electronics Technology program element supports the continued advancement of these technologies through the development of performance driven advanced capabilities, exceeding that available through commercial sources, in electronic, optoelectronic and MEMS devices, semiconductor device design and fabrication techniques, and new materials and material structures for device applications.  A particular focus for this work is the exploitation of chip-scale heterogeneous integration technologies that permit the optimization of device and integrated module performance.\n\nThe phenomenal progress in current electronics and computer chips will face the fundamental limits of silicon technology in the early 21st century, a barrier that must be overcome in order for progress to continue.  The program element will therefore explore alternatives to silicon-based electronics in the areas of new electronic devices.  The program element will also explore new architectures to use devices of all types, new software to program the systems, and new methods to fabricate the chips.  Approaches include nanotechnology, nanoelectronics, molecular electronics, spin-based electronics, quantum-computing, new circuit architectures optimizing these new devices, and new computer and electronic systems architectures.  Projects will investigate the feasibility, design, and development of powerful information technology devices and systems using approaches for electronic device designs that extend beyond traditional Complementary Metal Oxide Semiconductor (CMOS) scaling, including non-silicon-based materials technologies to achieve low cost, reliable, fast and secure computing, communication, and storage systems.  This investigation is aimed at developing new capabilities from promising directions in the design of information processing components using both inorganic and organic substrates, designs of components and systems leveraging quantum effects and chaos, and innovative approaches to computing designs incorporating these components for such applications as low cost seamless pervasive computing, ultra-fast computing, and sensing and actuation devices.  \n\nThis project has five major thrusts: Electronics, Photonics, MicroElectroMechanical Systems, Architectures, Algorithms, and other Electronic Technology research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive Radio Frequency Technology (ART)"
                                    },
                                    "Description": {
                                        "val": "There is a critical ongoing military need for flexible, affordable, and small size, weight and power (SWaP) real-time-adaptable military electromagnetic interfaces.  The Adaptive Radio Frequency Technology (ART) program will provide the warfighter with a new, fully adaptive radio platform capable of sensing the electromagnetic and waveform environment in which it operates, making decisions on how to best communicate in that environment, and rapidly adapting its hardware to meet ever-changing requirements, while simultaneously significantly reducing the SWaP of such radio nodes.  ART technology will also provide each warfighter, as well as small-scale unmanned platforms, with compact and efficient signal identification capabilities for next-generation cognitive communications, and sensing and electronic warfare applications.  ART technology will also enable rapid radio platform deployment for new waveforms and changing operational requirements.  The project will remove the separate design tasks needed for each unique Radio Frequency (RF) system, which will dramatically reduce the procurement and sustainment cost of military systems.  ART aggregates the Feedback Linearized Microwave Amplifiers program, the Analog Spectral Processing program, and Chip Scale Spectrum Analyzers (CSSA) program, and initiates new thrusts in Cognitive Low-energy Signal Analysis and Sensing Integrated Circuits (CLASIC), and Radio-Frequency Field-Programmable Gate Arrays (RF-FPGA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.003"
                                            },
                                            "Text": {
                                                "val": "- Demonstrated a radio reconfigurable between five different RF systems using integrated phase-change switch and silicon germanium (SiGe) technologies.  Phase change switch reliability improved to 400,000 cycles and power handling improved by 10X to nearly 1 watt.\n- Integrated a highly reconfigurable RF front-end into a commercial software defined radio board that broadened the user base for RF-FPGA technology and transitioned multiple RF-FPGA cognitive radios.\n-  Demonstrated the ability to, without prior knowledge, classify 32 wireless communication signal types in a hand held form factor while consuming less than 10 mW of power. \n-  Demonstrated an adaptable, fully integrated radio system that is small enough to be carried by a warfighter and is resistant to jamming."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.550"
                                            },
                                            "Text": {
                                                "val": "-  Investigate transition paths for phase change switch technology including potential transitions into a commercial semiconductor foundry.\n- Investigate transition paths for RF-FPGA reconfigurable RF front-ends including supplying demo units to DoD end users and investigating commercial paths for suppling the technology to the DoD.\n- Increase power handling of phase change switch technology to > 1W and improve reliability to > 1 Million cycles to meet the performance requirements of military and commercial communications systems.\n-  Demonstrate an RF front-end reconfigurable between five different RF systems with performance approaching (> 90%) that of a fixed point solution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.500"
                                            },
                                            "Text": {
                                                "val": "-  Finalize transition plans for a fully reconfigurable RF circuit technology at the component and system levels."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diverse & Accessible Heterogeneous Integration (DAHI)"
                                    },
                                    "Description": {
                                        "val": "The scaling of silicon (Si) transistors to ever smaller dimensions has led to dramatic gains in processor performance over the past fifty years. In parallel, Integrated Circuits (IC) designers for RF circuits have leveraged the different material properties of compound semiconductor (CS) technologies such as indium phosphide (InP), gallium arsenide (GaAs), gallium nitride (GaN) and silicon-germanium (SiGe) to enable devices that operate at frequencies and powers difficult or impossible to achieve in Silicon.  Historically, a designer would have to decide between the high density of Si circuits or the high performance of CS materials.  Prior DARPA efforts have demonstrated the ability to achieve near-ideal \"mix-and-match\" capability for DoD circuit designers with limited demonstrations of the heterogeneous integration of silicon and InP technologies that far exceeded what can be accomplished with one technology alone.  Specifically, the Compound Semiconductor Materials On Silicon (COSMOS) program enabled transistors of InP to be freely mixed with silicon complementary metal-oxide semiconductor (CMOS) circuits to obtain the benefits of both technologies (very high speed and very high circuit complexity\/density, respectively).  The Diverse & Accessible Heterogeneous Integration (DAHI) effort will take this capability to the next level, ultimately offering the seamless co-integration of a variety of semiconductor devices (for example, GaN, InP, GaAs, antimonide based Compound Semiconductors), microelectromechanical (MEMS) sensors and actuators, photonic devices (e.g., lasers, photo-detectors) and thermal management structures.  This capability will revolutionize our ability to build true \"systems on a chip\" (SoCs) and allow dramatic size, weight and volume reductions while enabling higher performance such as power, bandwidth or dynamic range in our electronic systems for electronic warfare, communications and radar.  \n\nIn the Applied Research part of this program, high performance RF\/optoelectronic\/mixed-signal systems-on-a-chip (SoC) for specific DoD transition applications will be developed as a demonstration of the DAHI technology.  To provide maximum benefit to the DoD, these processes will be transferred to a manufacturing flow and made available (with appropriate computer aided design support) to a wide variety of DoD laboratory, Federally Funded Research and Development Center (FFRDC), academic and industrial designers.  Manufacturing yield and reliability of the DAHI technologies will be characterized and enhanced.  This program has advanced technology development efforts funded in PE 0603739E, Project MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.400"
                                            },
                                            "Text": {
                                                "val": "-  Completed first run development of new CMOS-compatible processes to achieve heterogeneous integration with diverse types of compound semiconductor transistors, MEMS, and non-silicon photonic devices, including interconnect and thermal management approaches.\n-  Developed wafer-bonding-based and assembly-based heterogeneous integration process technology, enabling the design of demonstration circuits.\n-  Completed first manufacturing run demonstrating yield and reliability enhancement for multi-user foundry capability based on developed diverse heterogeneous integration processes.\n-  Successfully created circuits using the DAHI process that represent a variety of next generation systems, such as radar, EW, and communications.  These include Gallium Nitride (GAN) -Indium Phosphide (InP) differential and push-pull amplifiers, heterogeneously integrated RF\/optoelectronic circuits, and integrated polyphase transmitter and voltage-controlled oscillator-amplifier chains using silicon CMOS, InP Heterojunction Bipolar Transistor (HBTs), and GaN High-Electron-Mobility Transistor (HEMTs)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.983"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate heterogeneous integration of advanced node silicon CMOS processes achieved with diverse types of compound semiconductor transistors, MEMS, and non-silicon photonic devices, including interconnect and thermal management approaches.\n-  Transition multi-user foundry interface to independent design service from proprietary foundry model to enable community access to diverse heterogeneous integration processes.\n- Demonstrate sustainable model and accessibility via foundry\/customer engagements, including detailed cost models and quotations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate heterogeneous integration process variant based on low cost Si interposer technology combining heterogeneously integrated multi-technology circuits with high Q passive technologies.\n-  Demonstrate integration of emerging device technologies into established heterogeneous integration process flow with minimal process deviation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Common Heterogeneous integration & IP reuse Strategies (CHIPS)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Fast and Big Mixed-Signal Designs (FAB)\n\nThe scaling of silicon transistors to ever smaller dimensions has led to dramatic gains in processor performance over the past forty years. In parallel, IC designers for RF circuits have leveraged the different material properties of compound semiconductor (CS) technologies such as gallium arsenide (GaAs), gallium nitride (GaN) and silicon-germanium (SiGe) to enable devices that operate at frequencies and powers difficult or impossible to achieve in silicon.  When integrated together the heterogeneous integration of these technologies has been demonstrated to far exceed what can be accomplished with any one technology alone. The process of integrating CS technologies on silicon currently requires that the silicon transistor dimension, or process node, be fixed which requires designs to be remade for various combinations of technology and process node, a costly and time consuming effort. This program will investigate the potential for a truly process-agnostic integration technology that is inclusive of any current or future circuit fabrication technology with a standardized interconnect topology. Such a technology platform will enable the design of individual circuit intellectual property (IP) blocks, such as low-noise amplifiers or analog-to-digital converters (ADC), with a goal of re-using them across applications and resulting in time and cost savings.  Re-use will allow the DoD to spread the upfront design cost of these blocks over several designs instead of leveling the burden on a single program.  Furthermore, the IP can be designed in the fabrication process best suited for the performance goals and evolve more quickly than larger, more expensive single-chip (monolithic) systems-on-a-chip.  Through standardization of the interface, CHIPS will enable the DoD to leverage the advancements driven by the global semiconductor market rather than relying on a single on-shore foundry provider or on proprietary circuit designs owned by a few traditional prime performers.\n\nIn the Applied Research part of this program, focus will be placed on the rapid development and insertion of microsystems utilizing the CHIPS technology.  For example, the development of an ADC combining a SiGe circuit integrated with 14 nanometer Silicon CMOS will be explored.  This program has advanced technology development efforts funded in PE 0603739E, Project MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.823"
                                            },
                                            "Text": {
                                                "val": "-  Determined the best choices for the RF and digital technologies and the best methods of co-integration (monolithic, through-silicon via (TSV) and interposer) in order to achieve program objectives, along with identifying partner(s) for fabrication and\/or integration.\n-  Began circuit design activities to determine performance benefits of new processes enabled by the program.\n-  Studied the best technology for various RF functional blocks for optimal use of mixed technologies.\n-  Investigated a methodology for enabling reuse of government funded or commercial IP and mechanisms for storing them for future use.\n-  Initiated studies that investigated the benefits to development cycle and cost reduction for electronics IC s through internal IP reuse at a large defense contractor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.800"
                                            },
                                            "Text": {
                                                "val": "-  Continue to investigate choices for the RF and digital technologies and the best methods of co-integration (monolithic, through-silicon via (TSV) and interposer) in order to achieve program objectives, along with identifying partner(s) for fabrication and\/or integration.\n-  Continue to study the best technology for various RF functional blocks for optimal use of mixed technologies.\n-  Investigate tradeoff matrix for various co-integration (monolithic, through-silicon via (TSV) and interposer) strategies for RF and digital technologies.\n-  Develop a cost model to analyze the impact of IP reuse using insight gained from large defense contractor development cycle study. \n-  Study the system level impact of IP re-use for the optimal use of RF mixed technology functional blocks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.500"
                                            },
                                            "Text": {
                                                "val": "-  Finalize potential standards definitions for high-bandwidth interfaces of CMOS chiplet-to-chip interconnections.\n-  Study the system level impact of IP re-use for the optimal use of RF mixed technology functional blocks.\n-  Initiate circuit demonstrations of chip-to-chip interconnects for CMOS chip stacks.\n-  Initiate circuit demonstrations with heterogeneous integration of DOD IP blocks and commercial IP blocks.\n-  Continue circuit design activities to determine performance benefits of new processes enabled by the program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Direct On-Chip Digital Optical Synthesis (DODOS)"
                                    },
                                    "Description": {
                                        "val": "The development of techniques for precise frequency control of RF and microwave radiation in the 1940's revolutionized modern warfare.  Frequency control is the enabling technology for RADAR, satellite and terrestrial communications, and positioning and navigation technology, among many other core DoD capabilities.  By comparison, frequency control at optical frequencies is relatively immature, comparable to the state-of-the-art of microwave control in the 1930's.  The first practical demonstration of optical frequency synthesis, utilizing a self-referenced optical comb, was performed in 1999 and, since that time, the precision and accuracy of optical measurements has improved by four orders of magnitude, including the demonstration of atomic clocks utilizing optical-frequency atomic transitions that far outperform existing technology based on microwave transitions.  To date, however, optical frequency control has been constrained to laboratory experiments due to the large size, relative fragility, and high cost of optical comb-based synthesizers.  Recent developments in self-referenced optical frequency combs in microscale resonators enable the development of a fully-integrated chip-scale optical frequency synthesizer.  Ubiquitous low-cost robust optical frequency synthesis is expected to create a similar disruptive capability in optical technology as microwave frequency synthesis did in the 1940's, enabling high-bandwidth coherent optical communications, coherent synthesized-aperture LiDAR, portable high-accuracy atomic clocks, high-resolution standoff gas\/toxin detection, and intrusion detection, among other foreseen applications.\n\nThe Direct On-chip Digital Optical Synthesis (DODOS) program will integrate a diverse range of photonic and electronic components to create a microscale, high-accuracy optical frequency synthesizer, in a compact, robust package, suitable for deployment in a wide variety of mission-critical DoD applications.  Significant challenges in the program include the integration of heterogeneous devices and materials that are incompatible with conventional high-volume manufacturing of integrated circuits, optimizing efficient on-chip pump lasers and high-bandwidth detectors, and developing high-precision microwave control electronics with low power consumption.  Basic research for this program is funded within PE 0601101E, Project ES-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.664"
                                            },
                                            "Text": {
                                                "val": "-  Completed modeling and proof-of-concept experiments to validate low-threshold approaches to optical frequency combs.\n-  Developed DODOS system architectures and integration approaches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.400"
                                            },
                                            "Text": {
                                                "val": "-  Validate device-level performance requirements, such as the control-loop bandwidths and optical link budget, needed to reach the DODOS program metrics at the system level.\n-  Prototype critical photonic components in processes consistent with subsequent co-integration.\n-  Demonstrate tabletop DODOS, utilizing microscale components compliant with Phase-1 Program objectives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Validate prototype photonic integrated circuits containing all optical components required by the DODOS system architecture.\n-  Implement off-chip electronics and algorithms and demonstrate DODOS electro-optic functionality.\n-  Develop packaging techniques to co-integrate DODOS photonics and electronic control circuits."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Arrays at Commercial Timescales (ACT)"
                                    },
                                    "Description": {
                                        "val": "Phased arrays are critical system components for high performance military electronics with widespread applications in communications, electronic warfare and radar.  The DoD relies heavily on phased arrays to maintain technological superiority in nearly every theater of conflict.  The DoD cannot update these high cost specialized arrays at the pace necessary to effectively counter adversarial threats. The Arrays at Commercial Timescales (ACT) program fills this gap through the use of commercial-of-the-shelf components that can undergo technology refresh far more frequently in response to a continually changing threat environment.  ACT will develop adaptive and standardized digital-at-every-element arrays that can replace static analog beamformers with cost effective digital array systems capable of a yearly technology refresh.  By doing so, phased arrays will become ubiquitous throughout the DoD, moving onto many platforms for which phased arrays had been previously prohibitively expensive to develop or maintain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "-  Continued development and integration of common hardware components, such as application specific integrated circuits and field programmable gate arrays, for a wide range of phased array antenna systems; finalized initial designs and began fabrication for ACT demonstration units to be completed and tested in FY16.\n-  Signed Memorandum of Understanding (MOU) between the Army Research Lab (ARL) and DARPA to support the performance testing of ACT Common Modules for potential Army transition opportunities.\n-  Continued to identify government application spaces and transition paths for the ACT Common Module and reconfigurable antenna apertures to include the planned use of ACT technology components in a new AFRL program.\n-  Finalized design and started fabrication of application specific integrated circuits (ASIC) in 32 nanometer (nm) CMOS, 65 nm CMOS and Silicon Germanium (SiGe) technologies that enable commonality across a wide range of phased array platforms.\n-  Performed first measurements on fabricated SiGe ASICS demonstrating RF filter performance and RF amplifier performance as predicted by modeling."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.550"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate Common Module hardware viability through government testing of delivered hardware components in a government furnished system platform.\n-  Organize an ACT common module demonstration day to inform potential transition partners and industrial users on the measured performance of the Phase I modules.\n-  Investigate the benefits of and develop plans and preliminary designs for upgrading the ACT Common Module in a state-of-the-art fabrication process.\n- Demonstrate a fundamental element of a reconfigurable antenna array and define a list of personalities possible to cover the DoD application space. \n-  Continue to identify government application spaces and transition paths for the ACT Common Module and reconfigurable antenna apertures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop the ACT common module using an advanced process node and demonstrate the performance improvement compared to the common module developed with an earlier node in Phase I.\n-  Demonstrate rapid technology refresh of the common modules developed in Phase 1.\n-  Drive the ACT common module technology transition process by gathering and sharing test results with potential users.\n- Develop a reconfigurable antenna array using 16 elements that cover multiple frequency bands (S, X bands) using the technology demonstrated earlier in the program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC)"
                                    },
                                    "Description": {
                                        "val": "The effectiveness of combat operations across all domains increasingly depends on our ability to control and exploit the electromagnetic (EM) spectrum, and to deny its use to our adversaries.  Below 30 GHz, the proliferation and availability of inexpensive high-power commercial RF sources has made the EM spectrum crowded and contested, challenging our spectrum dominance.  The numerous tactical advantages offered by operating at higher frequencies, most notably the wide bandwidths available, is driving both commercial and DoD solid-state and vacuum electronic amplifiers into the millimeter wave (mm-wave) spectrum above 30 GHz.  Control of the mm-wave spectrum necessitates advanced and increasingly more sophisticated electronic components and systems.  The performance of these systems strongly depends on the available amplifier power which impacts how much power the system can radiate.\n\nThe High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC) program seeks to strengthen our dominance of the EM spectrum and create overmatch capability by developing a new class of wideband, high-power vacuum electronic amplifiers.  The size, weight, and power (SWaP) will be consistent with reusable airborne and mobile platforms enabling an increased offset range and the ability to engage multiple targets at the speed of light.  Realization of wideband, high power vacuum electronic amplifier technology will require significant advancements in cathodes with high current-density and long lifetime, beam-wave interaction circuits with wide bandwidth and high power handling capability, wideband and low-loss vacuum windows, and compact magnetic structures for electron beam transport.  The HAVOC amplifier will provide leap-ahead capabilities to air, ground, and ship-based communications, sensing, and electronic warfare systems.  Opportunities for transfer of the HAVOC technology to the Services will be identified during the execution of the early phases of the program.  The technology transfer efforts will follow a spiral development process to mitigate risk and provide the opportunity to incorporate new technological developments as they occur. Basic research for this program is funded within PE 0601101E, Project ES-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate the design and modeling of a wide-bandwidth, high power mm-wave vacuum electronic amplifier.\n-  Identify performance parameters and engineering tradeoffs required to meet or exceed the program metrics for both power and bandwidth in a compact form factor, incorporating new concepts for novel beam-wave interaction structures and advanced thermal management.\n-  Assess state of the art in cathodes, vacuum windows, and magnetic structures for electron beam transport and identify components and technologies that meet or exceed design requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Design, fabricate, and test high current-density cathodes capable of producing beam current consistent with amplifier output power requirements.\n-  Design, fabricate, and test wide bandwidth interaction structures with high beam-wave interaction efficiency and high power handling capability.\n-  Design, fabricate, and test wide bandwidth vacuum windows with high power handling capability.\n-  Investigate new magnetic materials and magnet configurations that enable compact, integrated beam focusing and transport architectures.\n-  Integrate components into prototype amplifiers and begin testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precise Robust Inertial Guidance for Munitions (PRIGM)"
                                    },
                                    "Description": {
                                        "val": "The DoD relies on GPS for ubiquitous and accurate positioning, navigation, and timing (PNT). With the increased prevalence of intentional GPS jamming, spoofing, and other GPS-denial threats, GPS access is increasingly unavailable in contested theaters and alternative sources of PNT are required.  In particular, guided munitions navigation is the most immediate and among the most demanding of GPS-denial challenges, due to the necessity of operating in highly contested theaters and the stringent requirements for minimization of cost, size, weight, and power consumption (CSWaP). The Precise Robust Inertial Guidance for Munitions (PRIGM) program will develop low-CSWaP inertial sensor technology for GPS-free munitions navigation.  PRIGM comprises two focus areas: 1) Development of a Navigation-Grade Inertial Measurement Unit (NGIMU) that transitions state-of-the-art MEMS to DoD platforms by 2020; and 2) Research and development of Advanced Inertial MEMS Sensors (AIMS) to achieve gun-hard, high-bandwidth, high dynamic range navigation requirements with the objective of complete autonomy in 2030.  PRIGM will advance state-of-the-art MEMS gyros from TRL-3 devices to a TRL-6 transition platform (complete IMU) that enables Service Labs to perform TRL-7 field demonstrations.  PRIGM will exploit recent advances in heterogeneous integration of photonics and CMOS and advanced MEMS technology to realize novel inertial sensors for application in extreme dynamic environments and beyond navigation-grade performance.\n\nFuture warfighting scenarios will take place in a GPS-denied world.  High-dynamics navigation applications, such as smart munitions, require low-CSWaP inertial sensors demonstrating high bandwidth, high precision, and high shock tolerance. Conventional MEMS inertial sensors rely on capacitive sensing to measure position, which suffer from perturbations due to asymmetry, temperature sensitivity, parasitic capacitances, and squeeze film damping of gas in narrow gaps.  Various methods have been proposed to overcome challenges with capacitive readout.  One solution is optical sensing, which has demonstrated high sensitivity, low noise position sensing and potential to reject external vibrations.  Recent advances in heterogeneous integration, on-chip optical waveguides, and quantum-assisted sensing and readout of MEMS\/NEMS have resulted in new capabilities to enable candidate technologies for PRIGM.  The candidate technologies include optically interrogated MEMS gyroscopes and accelerometers, waveguide optical gyroscopes, and rate-integrating MEMS gyroscopes.  Basic research for this program is funded within PE 0601101E, Project ES-01 and advanced development for the program is budgeted in PE 0603739E, Project MT-15."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Model and design architectures for chip-scale, waveguide optical gyroscopes, which combine the essential components and functionality of ring-laser into a photonic integrated circuit.\n-  Model and design optically interrogated MEMS inertial sensors, leveraging the high sensitivity of optical interrogation with the precision machining and low-CSWaP enabled by MEMS.\n-  Develop processes for co-fabrication of MEMS and photonic integrated circuits.\n-  Design and simulate photonic and MEMS-photonic sensors suitable for high shock survival."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.911"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.911"
                                            },
                                            "Text": {
                                                "val": "-  Integrate component technology and demonstrate integrated photonic-MEMS inertial sensors with beyond navigation grade performance.\n-  Design and fabricate heterogeneously integrated, chip-scale waveguide optical gyroscopes.\n-  Demonstrate navigation grade accuracy and stability of integrated inertial sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Near Zero Energy RF and Sensor Operations (N-ZERO)"
                                    },
                                    "Description": {
                                        "val": "The DoD has an unfilled need for a persistent, event driven sensing capability, where physical, electromagnetic and other sensors can be pre-placed and remain dormant until awoken by an external trigger or stimulus.  State-of-the-art sensors use active electronics to monitor the environment for the external trigger.  The power consumed by these electronic circuits limits the sensor lifetime to durations of weeks to months.  The Near Zero Power RF and Sensor Operations (N-ZERO) program will extend the lifetime of remotely deployed sensors from months to years.  N-ZERO will develop the underlying technologies and demonstrate the capability to continuously and passively monitor the environment and wake-up an electronic circuit upon detection of a specific signature or trigger. Thereafter, sensor lifetime will be limited only by processing and communications of confirmed events.\n\nThe N-ZERO program will replace the power consuming electronic circuits used for processing and detection of information in current systems with passive or extremely low power devices.  The N-ZERO program will develop RF communications and physical sensor systems that collect, process, and detect the presence of useful information, while rejecting spurious signals and noise, using the energy in the collected information to perform these functions.  This will eliminate or significantly reduce the standby power consumption from the battery.  By doing so, the N-ZERO program will provide the warfighter with wireless sensors systems with drastically increased mission life.  The basic research component of this program is budgeted under PE 0601101E, Project ES-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Design and fabricate hardware components and microsystems for detecting RF signals with received power levels less than 1 nano-Watt while consuming less than 10 nW of power.\n-  Design and fabricate hardware components and microsystems for detecting and discriminating the presence of a specific machine at a distance of 0.5 m while consuming less than 10 nW of power consumption.\n-  Identify government application spaces and transition paths that will make use of N-ZERO detection and signal processing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate the detection performance and power consumption of the RF and physical sensor microsystems.\n-  Design, fabricate and evaluate microsystems enabling passive or near zero energy collection, processing and detection of RF communications and physical sensor signatures at reduced (10 fold) signal strength.\n-  Identify and engage potential users in the National Security space to develop N-ZERO transition opportunities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wafer-scale Infrared Detectors (WIRED)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Microwaves and Magnetics (M&M)\n\nLeveraging investments in high-volume wafer scale processing has made digital imaging technologies ubiquitous, for example, making high resolution digital cameras common place in every cell phone.  A smaller scale revolution is currently underway due to the development of long-wave infrared (LWIR) thermal imaging sensors.  These sensors are also manufactured at the wafer scale, and they are becoming widely available due to the low cost relative to existing infrared (IR) imaging technologies.  No similar technology exists in the tactically and strategically important short-wave and mid-wave IR (SWIR\/MWIR) bands.  The Wafer-scale Infrared Detectors (WIRED) program addresses these needs by developing high performance SWIR and MWIR Focal Plane Array (FPA) technologies that are manufactured at the wafer scale.  These sensors will provide increased standoff distances to smaller Tier I and II class unmanned aerial vehicle platforms, low cost missiles, hand held weapon sights\/handheld surveillance systems, helmet-mounted systems, and ground vehicle-mounted threat warning systems.\n\nThe MWIR detector technologies developed under WIRED will provide, for the first time, MWIR FPAs that do not require heavy, expensive cryogenic coolers.  The SWIR detector technologies will provide, for the first time, diffraction limited imaging with compact optics.  Significant challenges include obtaining high detector performance from disordered materials that can be deposited directly onto readout integrated circuits (ROICs).  New ROIC designs will also be required to achieve the noise reduction and pixel pitches required for the suggested applications."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Explore fundamental properties of disordered materials, and evaluate the processes that affect sensor performance at elevated operating temperatures.\n-  Develop and evaluate MWIR sensor technology that is compatible with wafer-scale processing, and demonstrates high performance at operating temperatures compatible with low-cost thermoelectric coolers.\n-  Develop and evaluate SWIR sensor technology that is compatible with wafer-scale processing, and provides an architecture which will scale to a near diffraction-limited pixel pitch."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop models that describe the fundamental behavior of disordered materials and apply them to device-level simulations.\n-  Demonstrate imaging from MWIR detectors that are integrated directly onto ROICs and evaluate detector performance\/characteristics at temperatures of 230 K.\n-  Demonstrate imaging from small pixel SWIR detectors that are integrated directly onto ROICs and evaluate detector performance\/ characteristics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modular Optical Aperture Building Blocks (MOABB)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly MultiPLEX\n\nWhile radio-enabled technologies manipulate radio waves for sensing (e.g. RADAR) and communication, optical systems leverage visible light and can enable foliage-penetrating light detection and ranging (LIDAR), navigation, 3D imaging, and long-range communications. Although the basic technology already exists, optical systems have been limited by their size, weight, and cost. A traditional optical telescope, for instance, requires expensive precision lenses and mirrors, large empty volumes for gathering and focusing light, and heavy mechanical steering components. Mechanical steering's limited speed and precision also impedes the use of optical systems in certain defense applications, although LIDAR is more suitable for detailed imaging relative to RADAR.\n\nThe Modular Optical Aperture Building Blocks (MOABB) program seeks to greatly reduce the size and weight of optical systems while increasing steering rates. Specifically, MOABB aims to construct millimeter scale optical unit cells that can be coherently arrayed onto a flat surface to form a much larger, higher power device. These building blocks would replace the precision lenses, mirrors, and mechanical components from a conventional optical system. MOABB would also develop scalable optical phased arrays, borrowing from RADAR the technology required to steer electromagnetic waves, such as light and radio, without mechanical components. These advances would allow for a 100-fold reduction in size and weight and a 1,000-fold increase in steering rate. For applications such as LIDAR, laser communications and laser illumination, MOABB provides a compelling opportunity to replace empty space and bulk components with a planar, integrated system."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Design and simulate non-mechanically steered millimeter-scale transmit and receive unit cells with 5mW of output power.\n-  Perform preliminary thermal modeling of the device, demonstrating a path to air-cooling."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete architecture design and application study for chip-scale LIDAR. \n-  Fabricate and test a millimeter-scale unit cell transmit and receive elements.\n-  Simulate low-loss grating design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Circuit Realization At Faster Timescales (CRAFT)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Diamond Enhanced Devices (DiamEnD)\n\nHigh performance electronics are at the heart of most modern military systems. Today, when selecting the electronics for advanced systems, DoD programs must choose between a high performing, custom integrated circuit that takes years to design, or a significantly lower performing general purpose integrated circuit that can be designed in a few months.  The tradeoff between performance and time has placed the DoD in an undesirable state.  The Circuit Realization At Faster Timescales (CRAFT) Program will break this paradigm by developing a custom integrated circuit design flow and methodology that will drastically reduce the amount of effort required to design a custom integrated circuit by 10 times while preserving high performance.  CRAFT will enable critical DoD electronic system needs by reducing the barrier to the design and fabrication of custom integrated circuits in leading-edge CMOS technology.\n\nThe CRAFT program will investigate novel design flows that utilize recent advances in software development methodology to reduce the amount of required design time.  The goal will be a reduction in the manual labor required for verification by automating much of the design tasks with automated generators.  In addition, CRAFT will explore increasing the level of design reuse and the flexibility of transferring a design from one foundry to another as well as migrating from one foundry technology to a more advanced technology."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete design submissions for the first Fin Field Effect Transistor (FinFET) multi-project wafer shuttle run.\n-  Define the initial architecture of the proposed object-oriented design flows. \n-  Initiate effort to establish a repository where the Intellectual Property (IP), methodology, and tools required to implement the object oriented design flow will be stored and distributed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete and evaluate the first two FinFET multi-project wafer shuttle runs.\n-  Initiate efforts to transfer design elements between foundries and across technology nodes.\n-  Complete initial testing of at least two full object oriented design flows."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atomic Clock with Enhanced Stability (ACES)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Next Generation Atomic Clock\n\nAtomic clock technology provides the high-performance backbone of timing and synchronization for DoD navigation, communications, Intelligence Surveillance and Reconnaissance (ISR), and Electronic Warfare (EW) systems.  Prior DARPA investment in Chip-Scale Atomic Clock (CSAC) technology has led to recent demonstrations of enhanced DoD capabilities, enabled by the availability of atomic-quality timing in portable battery-powered applications.  The Atomic Clock with Enhanced Stability (ACES) program will develop a next-generation low-size, weight, and power (SWaP) atomic clock, with 100X-1000X improvement in key performance parameters, by employing alternative approaches to atomic confinement and interrogation, with particular focus on developing the component technologies necessary to enable low-cost manufacturing and robust deployment in harsh DoD environments.\n\nACES will develop chip-scale atomic clocks achieving temperature coefficient of frequency < 10^-15\/°C, drift < 10^-13\/month, instability < 10^-11\/sqrt(tau), and retrace < 10^-13 which are robust against acceleration and magnetic fields (10^-13\/g and 10^-13\/gauss, respectively).  This will enable precise timing on low size, weight, and power (SWaP) platforms with extended mission duration.  In order to achieve these performance metrics, new enabling technology and interrogation techniques will be integrated into systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-   Begin modelling and simulation to support architecture development of the ACES device."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform Laboratory demonstration of functioning clock of the ACES architecture.\n-  Develop and verify low-SWaP physics package components consistent with proposed performance and overall physics package power consumption of <250 mW.\n-  Demonstrate a breadboard atomic clock physics package with power consumption < 250 mW, instability of less than 10^-11\/ sqrt(tau), and frequency retrace of less than 10^-11.\n- Develop and design an integrated physics package with overall volume of < 30cm^3 and power consumption of <250 mW."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Limits of Thermal Sensors (LOTS)"
                                    },
                                    "Description": {
                                        "val": "The long wave infrared (LWIR) is the most commonly used spectral band for thermal imagery, and current systems must choose between high performance cryogenically cooled focal plane arrays (FPAs), and uncooled microbolometers.  Microbolometers offer a significant reduction in size, weight, and cost (SWaP-C), at the expense of reduced sensitivity and slower response time.  The objective of the LOTS program is to demonstrate a detector technology that breaks this traditional trade space by providing the same benefits in SWaP-C as current microbolometers while approaching the sensitivity of a cryogenically cooled sensor.  The result will be the ability to deploy smaller, lighter, cheaper sensors on higher value assets and in more critical missions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate at least 3x performance improvement in uncooled microbolometers over current production performance.\n-  Demonstrate sensor fabrication in a production environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Connect.Everything"
                                    },
                                    "Description": {
                                        "val": "The Connect.Everything program will focus on the fielding of low-power, intelligent communication modules with high functionality density to enable ubiquitous connectivity.  Research efforts will focus on leveraging commercial industry investment in future wireless technology to develop communication modules that operate within the various unlicensed radio frequency (RF) and millimeter wave (mm-wave) frequency bands.  Employing advanced silicon technology, a fully-integrated multi-channel transceiver array including antenna, RF front-end amplifiers, passives, modems, and digital processors will be realized with a goal of reducing the barrier of connecting an existing device into a high data rate network.  These universal communication modules will be capable of accepting digital input data and DC power only, modulating the digital data and generating RF\/mm-wave radio signals, and receiving and demodulating external RF\/mm-wave radio signals into digital output data. More importantly, built-in calibration, tuning, and self-test functions will be integrated so that the communication module will not require costly post-manufacture testing and evaluation.  The program will extend current state of art Multiple-Input Multiple-Output (MIMO) techniques toward future applications which require gigahertz bandwidth, low latency, low power, and high power efficiency to support seamless connectivity between users, sensors, payloads, and platforms across the RF and mm-wave spectrum."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a design concept for a fully-integrated, multi-channel communication module with embedded radio circuitry and digital processing capability to enable digital-in-to-RF transmitters and RF-in-to-digital-out receivers on a single integrated circuit.\n-  Design a subset of the critical RF\/mm-wave and digital circuits that enhance the functionality of the communication module.\n-  Evaluate the communication capabilities, limitations, power consumption, and output power as well as spectrum efficiency of the communications module using modeling and simulation tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IntraChip Enhanced Cooling (ICECool)"
                                    },
                                    "Description": {
                                        "val": "The IntraChip Enhanced Cooling (ICECool) program is exploring disruptive technologies that will remove thermal barriers to the operation of military electronic systems, while significantly reducing size, weight, and power consumption.  These thermal barriers will be removed by integrating thermal management into the chip, substrate, or package technology.  Successful completion of this program will raise chip heat removal rates to above 1 kW\/cm^2 and chip package heat removal density to above 1kW\/cm^3 in RF arrays and embedded computers.\n\nSpecific areas of focus in this program include overcoming limiting evaporative and diffusive thermal transport mechanisms at the micro\/nano scale to provide an order-of-magnitude increase in on-chip heat flux and heat removal density, determining the feasibility of exploiting these mechanisms for intrachip thermal management, characterizing the performance limits and physics-of-failure of high heat density, intrachip cooling technologies, and integrating chip-level thermal management techniques into prototype high power electronics in RF arrays and embedded computing systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the full implementation of the fundamental building blocks of evaporative intrachip cooling including embedded micron-scale microfluidic channels with pin fins in 3D Silicon (Si) chips with two-phase flow approaching 90% vapor exit quality.\n-  Demonstrated High Power Amplifiers (HPA) thermal test vehicles with thermal resistance reduced by 3x compared to the State of the Art (SoA) that successfully handled die-level heat fluxes of 1 kW\/cm2 and transistor hot spots fluxes of 30 kW\/cm2 as well as embedded High Performance Computers (HPC) thermal test vehicles that successfully handled hot spot fluxes of 2 kW\/cm2.  \n-  Designed application-oriented electrical test vehicles to demonstrate the performance benefits of embedded microfluidic cooling and related these results to system-level performance and size, weight, power and cost (SWaPC) benefits to DoD programs-of-record through the use of intrachip thermal management technologies.\n-  Designed fully-functional HPAs and HPCs to demonstrate the thermal and electrical performance benefits of embedded microfluidic cooling where the reduction in thermal resistance will enable a 3x or greater increase in output power (HPAs) or computational performance (HPCs) compared to the State of the Art (SOA) baseline."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.750"
                                            },
                                            "Text": {
                                                "val": "-  Perform reliability testing of ICECool electrical demonstration modules to establish mean time to failure and compatibility with relevant Military specifications.\n- Test and demonstrate fully-functional HPAs with a 3x or greater increase in output power over the baseline GaN-on-SiC approach.\n-  Design application-ready ICECool modules and subarrays to facilitate transition of ICECool enabled components into relevant systems.\n-  Engage in transition activities for the ICECool technology to include insertion of ICECool enabled components in relevant subsystems such as transmit\/receive modules and embedded airborne computing platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "In vivo Nanoplatforms (IVN)"
                                    },
                                    "Description": {
                                        "val": "The In vivo Nanoplatforms (IVN) program seeks to develop the nanoscale systems necessary for in vivo sensing and physiologic monitoring and delivery vehicles for targeted biological therapeutics against chemical and biological (chem-bio) threat agents.  The nanoscale components to be developed will enable continuous in vivo monitoring of both small (e.g., glucose, nucleic acids, biomarkers) and large molecules (e.g., biological threat agents).  A reprogrammable therapeutic platform that targets gene regulatory sequences will enable tailored therapeutic delivery to specific areas of the body (e.g., cells, tissue, compartments) in response to traditional, emergent, and engineered threats.  The key challenges to developing these systems include safety, toxicity, biocompatibility, sensitivity, response, and targeted delivery.  The IVN program will have diagnostic and therapeutic goals that enable a versatile, rapidly adaptable system to provide operational support to the warfighter in any location."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated broad capability of in vivo nanoplatform sensors to detect additional military-relevant analytes (e.g., pH, cortisol) in an animal model with a robust signal.\n-  Demonstrated broad capability of in vivo nanoplatform therapeutics targeting gene regulatory sequences to maintain force health and reduce additional military-relevant pathogens or disease cofactors (e.g., multi-drug resistant bacteria, neurological disease) in an animal model.\n-  Updated regulatory approval pathway with results from animal model safety and efficacy testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.765"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate enhanced therapeutic performance via molecular targeting approaches in an animal model.\n-  Demonstrate the ability of skin-based sensors to detect physiologically relevant molecules (e.g., pH, ions, glucose, lactate, and cortisol) in an animal model.\n-  Demonstrate the ability of an in vivo nanoplatform to protect against infectious disease in an animal model.\n-  Continue to update regulatory approval pathway with results from animal model safety and efficacy testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pixel Network (PIXNET) for Dynamic Visualization"
                                    },
                                    "Description": {
                                        "val": "The PIXNET program addresses the squad level capability gap for target detection, recognition and identification in day\/night missions through real-time fusion of visible and thermal infrared (IR) imagery.  The vision of the program is to offer the warfighter a small and versatile camera that would be affordable for individual soldiers and provide multiple band imagery with fusion capability to take full advantage of different wavelength-band phenomenology in a compact single unit.  In the future, the availability of the PIXNET camera would enable a peer-to-peer networked system for image sharing within a squad, thereby providing a better common operating picture of the battlefield and significantly enhancing the warfighter's situational understanding.  The program aims to develop a low size, weight and power (SWaP), low cost, soldier-portable multiband infrared camera that will provide real-time single and multiple band imagery using a combination of a thermal and reflected spectral band.    The use of fused imagery in the PIXNET design will allow the soldier to detect camouflaged targets and distinguish targets from decoys.  The PIXNET camera will eliminate limitations posed by current camera systems, allowing for the detection, recognition and identification of targets from a single camera in daylight or no-light conditions.\n\nThe PIXNET program will focus on a significant reduction in SWaP and cost of infrared sensor components to enable the deployment of this technology to a wide range of participants in the theater.  The emphasis on a small form factor will enable new opportunities such as surveillance with small Unmanned Aerial Vehicles (UAV), multi-band rifle sights, vehicle-mounted systems, as well as helmet-mounted and handheld surveillance systems.  The phenomenology of utilizing the unique characteristics of different infrared wavelengths for target detection will be exploited.  The combination of a smart phone and PIXNET camera at the soldier level will enable more effective tactics, techniques and procedures (TTP) over the current capability.  The PIXNET program takes advantage of the computing capability of smart phones to process and fuse multicolor images and send them as videos or still images to the warfighter's helmet-mounted display via a wireless or wired connection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated brass board components for the visible and near infrared\/long-wave infrared (VNIR\/LWIR) helmet mounted camera.\n-  Refined algorithms to fuse data from thermal and reflective bands with good image registration.\n-  Completed data fusion demonstration and preliminary imaging for short-wave infrared\/long-wave infrared (SWIR\/LWIR) helmet mounted camera.\n-  Completed prototype design for short-wave infrared\/mid-wave infrared (SWIR\/MWIR) clip-on weapon sight camera.\n- Achieved 99.8% operability with MWIR Focal Plane Array (FPA) base layer of the clip-on weapon sight camera."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the VNIR\/LWIR camera and program completion.\n-  Demonstrate the SWIR\/LWIR helmet mounted camera on smart phone with real-time, on-board multi-band fusion and program completion.\n-  Demonstrate bench-scale brassboard SWIR\/MWIR camera with image fusion algorithms on an external laptop to demonstrate functionality.\n-  Demonstrate final SWIR\/MWIR clip-on weapon sight with on-board fusion and wireless transmission to a smart phone and program completion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vanishing Programmable Resources (VAPR)"
                                    },
                                    "Description": {
                                        "val": "The Vanishing Programmable Resources (VAPR) program will create microelectronic and mechanical systems capable of physically disappearing (either in whole or in part) in a controlled, triggerable manner, a characteristic referred to as transience.  The program will develop and establish an initial set of materials and components along with integration and manufacturing capabilities to undergird a fundamentally new class of electronics and mechanical structures defined by their performance and transience.  These transient electronics and structural systems ideally should perform in a manner comparable to Commercial Off-The-Shelf (COTS) systems, but with limited device persistence that can be programmed, adjusted in real-time, triggered, and\/or be sensitive to the deployment environment.  Applications include sensors for conventional indoor\/outdoor environments (buildings, transportation, and materiel), environmental monitoring over large areas, simplified diagnosis, treatment, and health monitoring in the field and airborne delivery vehicles with vanishing properties.  VAPR will explore transience characteristics of electronic devices and structural materials as well as build out an initial capability to make transient electronics and transient structural materials a deployable technology for the DoD and Nation.  The technological capability developed through VAPR will be demonstrated through two final test vehicles.  The transient electronics test vehicle will be a vanishing sensor with RF link.  The sensor with RF link will serve as an application vehicle showing the manufacturability of the research and process developed in the VAPR program being performed in PE 0601101E, Project TRS-01.  The sensor with RF link is meant to be functional on its own, but also a leading indicator of the types of circuits possible under the VAPR program.  The transient structural materials demonstration will be a vanishing air delivery vehicle capable of precise, gentle drops of small payloads (~3 lbs.).  This demonstration will be functional on its own and will also be a leading indicator of the types of complex vanishing mechanical structures enabled by VAPR materials and technologies.  The resulting prototype designs will establish a fundamental capability to gently, precisely, and without debris deliver mission-critical payloads and are expected to broadly apply to various concepts of operation (CONOPS) relevant to national security."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "-  Achieved a transience time of less than or equal to 5 minutes for simple electronic devices.\n-  Reduced the variability of transience time to less than or equal to 90 seconds for simple electronic devices.\n-  Demonstrated capability to operate foundry-fabricated transient electronic circuits and subsequent controlled transience."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete integration of transient devices and materials to form fully functional microsystems.\n-  Achieve a transience time of less than or equal to 30 seconds for transient functional microsystems.\n-  Improve the variability of transience time to less than or equal to 10 seconds.\n-  Realize reliable operation of transient microsystems for greater than 100 hours after deployment, with subsequent controlled transience."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Optimize novel transient materials for application in the air delivery vehicle, since it must meet structural and processing requirements while guaranteeing full and complete transience.\n-  Initiate commercial-scale production of novel transient materials. \n-  Complete preliminary design reviews of air delivery system that meets program-defined air-release and landing specifications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hyper-wideband Enabled RF Messaging (HERMES)"
                                    },
                                    "Description": {
                                        "val": "Modern weapons systems are dependent on radio frequency (RF) links for communications, command and control, geolocation and battle management.  This dependence will only grow with the move to disaggregated systems in the battlefield. To create assured RF links in contested environments, HERMES will study the architectures and develop the technologies to enable spread-spectrum links with 10 GHz of instantaneous bandwidth. The ultimate objective is >70 dB of jammer suppression.  This program will explore the limits of jammer suppression through a combination of processing gain and tunable filtering in a hyper-wideband system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed analysis and simulation of frequency-dependent channel propagation effects with associated mitigation methods.\n-  Defined system architecture to include wireless RF transmitter and receiver architectures.\n-  Tested prototype communication link demonstrating 6 GHz of instantaneous bandwidth and 25dB of jammer suppression."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and test photonic-enabled wideband receivers for future scaling of link technologies with overall reduction of the system size, weight and power (SWaP).\n-  Demonstrate a prototype broadband wireless communication link with 10 GHz of instantaneous bandwidth and 70dB of jammer suppression."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Direct SAMpling Digital ReceivER (DISARMER)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Direct SAMpling Digital ReceivER (DISARMER) program is to produce a hybrid photonic-electronic analog-to-digital converter (ADC) capable of coherently sampling the entire X-band (8-12 GigaHertz (GHz)).  Conventional electronic wideband receivers are limited in dynamic range by both the electronic mixer and the back-end digitizers.  By employing an ultra-stable optical clock, the DISARMER program will allow for mixer-less digitization and thereby improve the dynamic range 100x over the state of the art.  Such a wide bandwidth, high fidelity receiver will have applications in electronic warfare and signals intelligence systems while dramatically reducing the cost, size and weight of these systems.\n\nThe DISARMER program will develop a low jitter mode-locked laser to be used as the sampling source.  The program will also develop a novel photonic architecture in a compact platform capable of hybrid electronic-photonic track-and-hold functionality and coherent photo-detection.  This program has advanced technology development efforts funded in PE 0603739E, Project MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated 5 femtosecond (fs) optical clock jitter in a compact mode-locked source.\n-  Fabricated and tested the building block optical circuits for coherent demodulation of the optical signal.\n-  Finalize fabrication and packaging of temperature stable laser module capable of 8 GHz repetition rate, 1 ps pulse width, and < 5 fs of integrated timing jitter.\n-  Finalize fabrication and integration of photonic de-modulation module with high power photodiodes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Micro-Technology for Positioning, Navigation, and Timing (Micro PN&T)"
                                    },
                                    "Description": {
                                        "val": "The Micro-Technology for Positioning, Navigation, and Timing (Micro-PNT) program developed low-Cost, Size, Weight, and Power (CSWaP) inertial sensors and timing sources for navigation in GPS degraded environments, primarily focusing on the development of miniature solid state and atomic gyroscopes and clocks.  Both classes of sensors are currently unsuitable for small platform or dismount soldier applications. Micro Electro-Mechanical Systems (MEMS) sensors have limited performance but excellent CSWaP, while atomic sensors are capable of excellent performance but are limited to laboratory experiments due to complexity and high CSWaP.  Micro-PNT advanced both technology approaches by improving the performance of MEMS inertial sensors and by miniaturizing atomic devices.  Ultimately, low-CSWaP inertial sensors and clocks will enable ubiquitous guidance and navigation on all platforms, including guided munitions, unmanned aerial vehicles (micro-UAVs), and mounted and dismounted soldiers.\n\nThe successful realization of Micro-PNT depends on development of new microfabrication processes and novel material systems for fundamentally different sensing modalities, as well as understanding the error sources at the microscale and the scaling relationships for size reduction of sensors based on atomic physics techniques.  The Micro-PNT program included research into novel techniques for fabrication and integration of three-dimensional MEMS devices as well as theoretical and experimental studies of new architectures and geometries for MEMS inertial sensing.  Atomic physics research included the development of new architectures for atomic inertial sensing and investigation of miniature enabling technologies, whose conventional counterparts are currently large, power hungry, and temperature sensitive, limiting high performance sensors to laboratory demonstrations.  Advanced research for the program is budgeted in PE 0603739E, Project MT-12."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated on-chip MEMS calibration stages to track gyro bias and scale factor stability.\n-  Demonstrated proof of concept sourcing and sinking of Rb for alkali vapor pressure control.\n-  Demonstrated ultra-narrow linewidth lasers.\n-  Demonstrated waveguide modulation of on-chip lasers at atomic resonance wavelengths.\n-  Demonstrated self-calibrating MEMS gyroscope with long-term scale factor and bias of < 10 parts per million (ppm) of full scale range."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Terahertz Electronics"
                                    },
                                    "Description": {
                                        "val": "The Terahertz Electronics program developed the critical semiconductor device and integration technologies necessary to realize compact, high-performance microelectronic devices and circuits that operate at center frequencies exceeding 1 Terahertz (THz). There are numerous benefits for electronics operating in the THz regime and new applications in imaging, radar, communications, and spectroscopy.  The Terahertz Electronics program was divided into two major technical activities: Terahertz Transistor Electronics that included the development and demonstration of materials and processing technologies for solid-state transistors and integrated circuits for receivers and exciters that operate at THz frequencies; and Terahertz High Power Amplifier Modules that included the development and demonstration of vacuum electronic traveling wave tube (TWT) amplifiers for high power amplification of THz signals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.020"
                                            },
                                            "Text": {
                                                "val": "-  Completed measurements of receiver\/exciter technologies at and above 0.67 THz.\n-  Demonstrated oscillator circuits at 1.03 THz.\n-  Demonstrated a prototype THz transceiver link using THz indium phosphide high electron mobility transistor (HEMT) technology.\n-  Demonstrated a 1.03 THz solid-state amplifier, the first time a solid state circuit has operationally crossed the THz barrier.\n-  Demonstrated improved thermal performance of vacuum amplifier for high duty cycle operation at THz frequencies.\n-  Demonstrated the first vacuum electronic traveling wave tube amplifier at 1 THz."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nitride Electronic NeXt-Generation Technology (NEXT)"
                                    },
                                    "Description": {
                                        "val": "To realize high performance analog, Radio Frequency (RF) and mixed-signal electronics, a next-generation transistor technology with high cutoff frequency and high breakdown voltage is under development.  This technology enabled large voltage swing circuits for military applications that the current state-of-the-art silicon transistor technology cannot support.  The objective of the NEXT program was to develop a revolutionary, wide band gap, nitride transistor technology that simultaneously provides extremely high-speed and high-voltage swing [Johnson Figure of Merit (JFoM) larger than 5 Terahertz (THz)-V] in a process consistent with large scale integration of enhancement\/depletion (E\/D) mode logic circuits of 1,000 or more transistors.  In addition, this fabrication process was reproducible, high-yield, high-uniformity, and highly reliable.  The accomplishment of this goal was validated through the demonstration of specific program Process Control Monitor (PCM) Test Circuits such as 5, 51 and 501-stage ring oscillators in each program phase.  The impact of this next-generation nitride electronic technology is the speed, linearity, and power efficiency improvement of RF and mixed-signal electronic circuits used in military communications, electronic warfare and sensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.280"
                                            },
                                            "Text": {
                                                "val": "-  Established the baseline of the high-speed \/ high breakdown voltage NEXT fabrication technology with high reproducibility and yield.\n-  Designed, fabricated, and tested military-relevant circuits, such as millimeter-wave low noise amplifiers, power amplifiers and triplers, using the developed NEXT transistor technology.\n-  Developed NEXT process design kit to allow circuit designers to utilize NEXT technology in other advanced circuit designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Microscale Plasma Devices (MPD)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Microscale Plasma Devices (MPD) program was to design, develop, and characterize MPD technologies, circuits, and substrates.  The MPD program focused on development of fast, small, reliable, high-carrier-density, micro-plasma switches capable of operating in extreme conditions, such as high-radiation and high-temperature environments.  Specific focus was given to methods that provide efficient generation of ions that can perform robust signal processing of radio frequency (RF) through light electromagnetic energy over a range of gas pressures.  Applications for such devices are far reaching, including the construction of complete high-frequency plasma-based circuits, and microsystems with superior resistance to radiation and extreme temperature environments.  Two and multi-terminal devices consisting of various architectures were developed and optimized under the scope of this program.  MPDs were developed in various circuits and substrates to demonstrate the efficacy of different approaches.  MPD-based microsystems were demonstrated in DoD applications where electronic systems must survive in extreme environments.\n\nThe MPD applied research program focused on transferring the fundamental scientific advances funded by PE 0601101E, Project ES-01 to produce complex circuit designs that may be integrated with commercial electronic devices.  The MPD program resulted in the design and modeling tools, as well as the fabrication capabilities necessary to commercially manufacture high-performance microscale-plasma-device-based electronic systems for advanced DoD applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed integration of the simulation efforts into the Modeling, Simulation and Design Tool (MSDT) for commercial development of microplasma based electronics.\n-  Completed final testing of microcavity materials for robustness in a high power electromagnetic application in order to demonstrate a Technology Readiness Level (TRL) as needed for technology transition.\n-  Completed demonstration of plasma-based materials and devices in representative system applications for transition to multiple DoD customers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}